[{"venue":"Neighborhood Theatre","event":"CASPA [Opening Act: Truth, ConRank, Zen Selekta, Makak]","date":"10 28 17","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1542971-caspa-charlotte/","desc":"UK bass pioneer, DJ, label owner, ex-pro basketball player, straight talking dubstep champion, dopest ghost: Caspa can be introduced in many ways. But the best is through his beats. His decade-deep discography has dented dances since dubstep's earliest chapters. Over three studio albums, four mix compilations, 30+ singles and many high-profile remixes including Depeche Mode, The Prodigy, Deadmau5, Kaskade, Swedish House Mafia, Grand Puba, Ludacris, Miike Snow and TC, his precision heavyweight productions have been released on eminent labels such as Digital Soundboy and Tempa as well as his own influential imprints DubPolice and Subsoldiers. Both iconic dubstep brands that have played a major role in the worldwide dubstep phenomenon and boasted the earliest work of some of the scene's most respected creative artists like L-Wiz, Subscape, The Others, Emalkay and Caspa's partner in grime Rusko. \n\nDJ-wise he's just as renowned: West London to Cape Town via USA, Australia, India and beyond, Caspa demonstrates how uncompromised club dynamics can work from some of the world's most iconic festival stages (Glastonbury, Sonar, EDC Vegas, Dour Festival) to some of the world's most respected club institutions such as Fabric whose mix CD series featured his and Rusko's era-defining, generation-inspiring 'Fabriclive 37' album. \n\nFast forward: Caspa continues to innovate at the heart of UK bass culture. From 2014's lean, molten back-to-basics '500' concept to 2017's sub-stacked 'Vibrations' series by way of his and Rusko's rule-wrecking slew of genre-burning EPs and well into the future, Caspa continues to push the music he lives his life for in many ways. But the best has yet to come.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/55/14-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1542971"},{"venue":"Neighborhood Theatre","event":"DIGITOUR: GOODTIMES [Opening Act: Tyler Brown, Bryce Hall, Jackson Krecioch, Mikey Barone, Justin Blake]","date":"10 05 17","times":"Doors: 5:30 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1530669-digitour-goodtimes-charlotte/","desc":"DigiTour Media is a touring music and social media festival production company, known for producing the world's first social media tour.\n\nDigiTour is a next level, interactive, variety show - expect comedy, theatrical sketches, games, music, and a one of a kind live experience!","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/92/91-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1530669"},{"venue":"Neighborhood Theatre","event":"PINK FLOYD LASER SPECTACULAR","date":"09 21 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1531548-pink-floyd-laser-spectacular-charlotte/","desc":"After 30+ years of touring, Paramount's Laser Spectacular has become a cult classic, presenting the music of Pink Floyd like you've never seen it before. Presented for the first time in 1986, producer Steve Monistere has established the Laser Spectacular as the longest running, touring theater show in history! Driven by cutting edge effects, Full Color Lasers, Hi-Def Multi-Screen Video Projection, Concert Quality Sound and Lighting Effects, your senses are confronted with an array of visual displays, choreographed to the soundtrack of the 2.5-hour show.\n\nViewed through specially designed 3-D glasses, the audience is drawn into this magical production, often singing along with the re-mastered sound track. The show has become a favorite with progressive rock fans of all ages. At most shows, parents are seen rocking out with their teenagers, as the Laser Spectacular brings together two generations of Pink Floyd music fans.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/01/95/96/37-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1531548"},{"venue":"Neighborhood Theatre","event":"EILEN JEWELL [Opening Act: The Edwards Brothers]","date":"08 30 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1494745-eilen-jewell-charlotte/","desc":"Crafting a unique style that mixes poetic ballads with swinging rockers, Eilen Jewell ranks among the best in the Americana genre today. As the reigning Queen of the Minor Key, Jewell leads a tight quartet who blend influences of surf-noir, early blues, rockabilly, and 1960s era rock and roll. \n\nOver the course of a decade, Eilen and her band have toured relentlessly. They have performed for legions of fans from Boston to Boise and Madrid to Melbourne at festivals, theaters, rock clubs and coffeehouses. Eilen’s fans marvel at her warmth, unique wit, and onstage humor alongside her beautiful songs and fiery performances.\n \nJewell’s fifth studio album, Sundown Over Ghost Town was released in May of 2015(Signature Sounds). The album was recorded with Eilen’s longtime road band in her hometown of Boise, and is composed of twelve stunning, original compositions that feature some of her most personal stories yet.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/15/33/87-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1494745"},{"venue":"Neighborhood Theatre","event":"PURGATORY 75: INFERNO - 15th Anniversary Celebration","date":"10 14 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1525891-purgatory-75-inferno-15th-charlotte/","desc":"PURGATORY IS BACK !\n\nCharlotte’s longest running theme event is celebrating 15 years of unbuckling the Bible Belt, Purgatory 75: Inferno brings you the most wicked infernal pleasures and devilish delights ever! Descend with us into the debauchery of the damned as we bring the hottest party this side of Hell back to celebrate our return by drinking,dancing and exploring the kink side of the underworld! \n\nFEATURING MUSIC BY:\n- DJ TRISKYL (Purgatory Resident, Atlanta, GA)\n- DJ DREES (Asheville NC, Augusta GA)\n\nWITH PERFORMANCES BY:\n- KAROL HELMS - Innovative pole artist, teacher and champion\n\nUSPDF Pro Miss Sexy 2010 USPDF East Coast Champion 2009 http://www.PolePraxis.com/ https://www.youtube.com/watch?v=U120b4eXAh4&feature=youtu.be \n\n- ICARIA & LUNA RHEA - Sexy power duo Icaria & Luna Rheapush the boundaries of aerial entertainment art. Together they operate Circus Innovations, the groundbreaking and innovative circus arts collective that combines the tantalizing danger of aerial circus performance with the dark and sensual world of kink entertainment . Whether flying by rope chain or something beyond your imagination this duo will blow your fucking mind ! http://facebook.com/circusinnovations\n\n\n- ARCANE ARTS - Masters of Sideshow, Fire, Flow, Dance, Sultry and Macabre. \n\n- WOLFLING & STEVHAN HAND - Cabaret destructo/electro performance with fetish and macabre leanings. “It’s thunderdome x 10 like whoa”\n\n- KAROLINA VON - Stunning and sensual aerial silk artist specializing in the seductive side of performance flight - https://www.facebook.com/KarolinaVon/ \n\n- JORDAN GARCIA - Awe inspiring circus feats of strength and body mobility in a sensual display of erotic movement.\n\nFULL VENDOR MARKETPLACE FEATURING:\n-Sunless Creations: http://www.stores.ebay.com/sunless-creations \n-Pleasure Bound Leather : http://www.facebook.com/pages/Pleasurebound-Leather/158344684180947 \n-Dead Ed's Alternative Clothing http://www.facebook.com/deadeds/ \n\nINTERACTIVE BDSM PERFORMANCES FEATURING: St Andrew's Crosses Soft-Play Station Piercing Play Flogging Medical Torture Electro Stimulation Hot Wax play and more! \n***FULLY-INTERACTIVE KINK DEMOS AND SIDE STAGE PERFORMANCES BY*** \n- Dr Spankenstein - Shepherd Shivalia - House of Payne - Wolf’s Den - https://www.facebook.com/Wolfsdenpr... \n\n***ALSO FEATURING*** \n- The Beautiful Purgatory Go-Go Dancers bring their evil, enticing, and sultry moves to the stage!\n\n*** 21+ ONLY - VALID ID REQUIRED *** \n\n\nJOIN IN THE CONVERSATION AND SHARE YOUR PHOTOS VIA SOCIAL MEDIA by using the hash-tag: #PurgatoryCLT Facebook: @SingleCellProductions Twitter: @SingleCellProd Instagram @ officialsinglecellproductions \n\nFOR TICKETS & MORE INFO PLEASE VISIT: http://www.SingleCell.us \nSPONSORED IN-PART BY: - A Stranger Concept Productions - Film and multi media production studio.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/61/38/48-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1525891"},{"venue":"Neighborhood Theatre","event":"ROADCASE ROYALE: NANCY WILSON OF HEART AND LIV WARFIELD","date":"10 01 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1531543-roadcase-royale-nancy-wilson-charlotte/","desc":"Fronted by Liv Warfield of Prince’s New Power Generation and Nancy Wilson, co-founder of Heart, ROADCASE ROYALE has a rich background in rock and R&B. Warfield, Wilson, and their bandmates bring their decades of experience from the upper echelon of the music industry to ROADCASE ROYALE, along with a renewed sense of direction and drive. Joining Wilson and Warfield are Warfield’s lead guitarist Ryan Waters and Heart veterans Dan Rothchild (bass), Ben Smith (Drums) and Chris Joyner (Keys). Each of these members shines in ROADCASE ROYALE, with their various sensibilities creating the group’s sensitive, passionate, and driving rock and R&B sound.\n\nLiv Warfield, a former track star at Notre Dame, was initially noticed by Prince after the release of her debut album “Embrace Me” and a YouTube video of her singing “Gimme Shelter.” She worked closely with Prince as a member of New Power Generation and he was the executive producer of her second solo album. Nancy Wilson, a guitar virtuoso since the age of 10, is celebrated as one of the seminal musicians in rock history, as a leader of the Rock And Roll Hall of Fame-inducted Heart. Ryan Waters has worked as lead guitarist and musical director for Liv Warfield’s solo work since 2012, and previously worked with artists such as Sade, Cee Lo Green, and India Arie. Ben Smith, Dan Rothchild, and Chris Joyner carry with them an impressive musical pedigree – Rothchild is the son of Doors producer Paul Rothchild and has worked with Stevie Nicks, Fiona Apple and Beck, while Joyner has worked with numerous musicians including Ray LaMontagne, Jason Mraz and Sheryl Crow. Smith has performed with Mike Inez and Mike McCready and has been working with Heart since the 1990s.\n\nNancy Wilson – Vocals and Guitar\n\nNancy Wilson is celebrated as one of the seminal musicians in the history of Rock n' Roll. A guitar virtuoso from the age of 10, Nancy, and her sister Ann, led the multi-platinum rock group, Heart. Together they have gone on to sell 35 million records. Nancy is revered as an ingenious guitar player and a gifted vocalist. As a songwriter, Nancy has co-written a collection of indelible songs that have earned their way into the classic rock canon including, \"Magic Man,\" \"Crazy on You,\" \"Barracuda,\" and \"Straight On.\"\n\nDuring an era when females in rock n' roll were scarce, Nancy helped carve out a place for women to front a band and dominate a rock stage. Her icon status was cemented when Heart was inducted into the Rock n' Roll Hall of Fame in 2013. That same year, she and her sister received a star on the Hollywood Walk of Fame. The Wilson sisters celebrated another career milestone in 2013 when they performed Led Zeppelin's \"Stairway To Heaven\" at the Kennedy Center Honors. Their note-perfect performance was met with rowdy cheers and a standing ovation in the staid hall and brought members of Led Zeppelin to tears.\nNancy has also built a successful career as a film composer. Her composing credits include scores for the following films:\n\n•\t2005 Elizabethtown\n•\t2001 Vanilla Sky\n•\t2000 Almost Famous\n•\t1995 Jerry Maguire (main theme)\n•\t1989 Say Anything\n\nIn 2017, Nancy stands at the starting line of exciting new co-writing/performance opportunities with her powerhouse band ROADCASE ROYALE, revitalized, as she pushes forward into a fresh artistic world.   \n\nLIV WARFIELD – VOCALS\n\nLiv Warfield burst out of the Portland OR music scene in 2006 as “Portland’s most soulful singer” (Portland Monthly.) Her debut album “Embrace Me” caught the ear of the music industry, and soon legendary music icon Prince discovered Liv’s powerful singing and mighty stage presence after watching a YouTube video of her singing “Gimme Shelter.”  He invited her to join his vocal backing group the New Power Generation. Liv credits Prince with mentoring her, guiding and coaxing stronger performances from her both in the studio and on stage. He executive produced her second album “The Unexpected” and wrote the title track. \n\nLiv has also performed alongside Al Green, B.B. King, The Dave Matthews Band and The Roots and slayed on numerous TV shows such as The View, David Letterman and Jimmy Fallon. Rosie O’Donnell commented, “Liv Warfield, Holy Crap! Unreal. A voice you can’t imagine!” \n\nA little known fact about Liv is that she was a gymnast and track star at Notre Dame.  And now she is bringing that same blue-ribbon drive and focus to ROADCASE ROYALE. Her songwriting, her voice, her emotional approach to interpreting a song are unbeatable.\n\nRYAN WATERS - GUITAR\n\nRyan Waters’ long list of accomplishments as a musician and performer directly reflects his desire to create music with integrity without regard for convention and genre. Ryan joined Sade in 2000 as lead guitarist in their legendary live band and has since performed for millions of fans all over the world. He has also collaborated with many other top names in music, including CeeLo Green, India Arie, while continuing to write, produce and record original material. In 2012, began working with vocalist/songwriter, Liv Warfield as her lead guitarist and musical director. Together, they wrote and co-produced her critically-acclaimed album “The Unexpected,” executive produced by Prince. \n\nBEN SMITH - drums\n\nBen began performing with Ann and Nancy Wilson in 1994, with their band Lovemongers. He has had the honor to work live and in the studio with the Wilson sisters and Heart ever since. Ben has also performed and/or recorded with a host of other legendary musicians including: Taj Mahal, Cyndi Lauper, Peter Frampton, jazz artists Nancy Wilson, Ernestine Anderson and Phoebe Snow. His film-based recording work includes the Cameron Crowe films (and soundtracks) \"Almost Famous,” “Vanilla Sky,” and “Elizabethtown.”  Ben is known as the “first call” session drummer in his hometown of Seattle and has an active career as a top producer in town.\n\nCHRIS JOYNER  - Keyboards\n\nLos Angeles native, Chris Joyner has a reputation as one of the music industry’s go-to pianists and keyboardists. He has recorded and toured with some of the biggest names in the industry, including Jason Mraz, Sara Bareilles, Tom Morello, Ray LaMontagne, Amos Lee, Ben Harper and Sheryl Crow. In 2015, Joyner released his well-received, sophomore solo record, “Domino,” which incorporates his primary influences like Dr. John, Stevie Wonder and The Beatles. Since 2014, Chris has toured extensively with Heart, supporting and enhancing their classic songs with his funky and soulful keyboard chops.\n\nDAN ROTHCHILD - Bass\n\nDan Rothchild carries an impressive music pedigree. Son of maverick producer Paul Rothchild (Doors, Janis Joplin, Bonnie Raitt, etc), he has forged a career of his own playing bass in studios and live for artists including Heart, Beck, Sheryl Crow, Fiona Apple, Stevie Nicks, Shakira, Melissa Etheridge, Carole King, Aimee Mann, and many others.  Along with Ben Smith, he has formed one of the most-admired live rhythm sections in current-day rock n roll. Dan enjoys album production as well, and produced Better Than Ezra's platinum-selling album \"Deluxe” and Heart’s latest full-length, “Beautiful Broken.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/62/40/93-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1531543"},{"venue":"Neighborhood Theatre","event":"COLTER WALL + TYLER CHILDERS","date":"09 20 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1534579-colter-wall-tyler-childers-charlotte/","desc":"Colter Wall is a young Saskatchewan born songwriter and performing musician. Steeped in Old Timey material and traditional Americana, Wall's sound is comprised of resonate and raw baritone vocals, Folk and Bluegrass style guitar and banjo picking, steady kick-drum stomping, and visually provoking, story telling lyrics. Wall Draws influence from legends of the past such as Hank Williams, Robert Johnson, Bob Dylan, Johnny Cash, Townes Van Zandt, and The Band, as well as more modern Americana pioneers including Shovels and Rope, Jack White, Ray Lamontagne, and Shakey Graves. Despite only recently beginning his musical career, Colter Wall has been seen in the company of Saskatchewan's infamous gritty bluegrass trailblazers,The Dead South. Wall has had the opportunity to open for The Dead South on several occasions with more show's upcoming. In addition to racking up memorable live shows across the province, Wall is planning on releasing an EP in the summer of 2015 and has been busy recording at Regina's own Studio One. From dive bars to fundraiser galas, Colter Wall has a history of leaving audiences in shock at the maturity of his voice as well as his songwriting.Like many great Southern storytellers, singer-songwriter Tyler Childers has fallen in love with a place. The people, landmarks and legendary moments from his childhood home of Lawrence County, Kentucky, populate the 10 songs in his formidable debut, Purgatory, an album that's simultaneously modern and as ancient as the Appalachian Mountains in which events unfold.\n\nThe album, co-produced by Grammy Award winners Sturgill Simpson and David Ferguson, is a semiautobiographical sketch of Childers' growth from wayward youth to happily married man, told in the tradition of a Southern gothic novel with a classic noir antihero who may just be irredeemable. Purgatory is a chiaroscuro painting with darkness framing light in high relief. There's catharsis and redemption. Sin and temptation. Murder and deceit. Demons and angels. Moonshine and cocaine. So much moonshine and cocaine. All played out on the large, colorful canvas of Eastern Kentucky.\n\nChilders had been searching for a certain sound for his debut album for years as he honed his craft, and was finding it elusive when his friend, drummer Miles Miller, introduced him to Simpson, the Grammy Award-winning musician and fellow Kentuckian. Childers sent Simpson a group of his songs, then went to visit him in Nashville.\n\n\"And he said, 'There's this sound. I know what you're trying to get at, the mountain sound,'\" Childers recalled. \"'So I asked, 'What are you doing?'\"\n\nIntrigued, Simpson enlisted the aid of Ferguson, the Grammy Award winning sound engineer. They assembled a band that included multi-instrumentalists Stuart Duncan, Michael J. Henderson and Russ Pahl, bassist Michael Bub and Miller on drums, of course, and helped Childers make a debut album of consequence that announces an authentic new voice.\n\n\"I was writing an album about being in the mountains,\" Childers said. \"I wanted it to have that gritty mountain sound. But at the same time, I wanted a more modern version of it that a younger generation can listen to -- the people I grew up with, something I'd want to listen to.\"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/41/85-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1534579"},{"venue":"Neighborhood Theatre","event":"THE MOUNTAIN GOATS [Opening Act: The Hot At Nights]","date":"09 05 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1500023-mountain-goats-charlotte/","desc":"John called me about playing with the Mountain Goats in 2001.\n\nNot for the first time, mind you. I’d signed on for a couple European tours in 1996, playing bass; the first had gone swimmingly and led to a second, which didn’t. Still, a foundation had been laid: John and I, already close friends, had developed over the course of those tours a musical chemistry strong enough that, even five years later, we were still bummed that the only people who got to see it were a handful of indifferent Bavarian villagers. “Do you want to do some recording?” John asked. Yeah, I said. We should totally do some recording.\n\nIt turned out to be a fateful conversation. Not more than a week or two later, the venerable London indie 4AD got in touch, and we found ourselves suddenly charged with making an album. In a studio. With a producer. \n\nWe spent an intense week at Dave Fridmann’s Tarbox Road, with Glasgow’s Tony Doogan at the board. There was some give and take. I loved the Mountain Goats, but I’d heard ten years’ worth of boombox Mountain Goats albums and wanted to swing for the fences. John was game while insisting that certain defining orthodoxies be preserved. We met in the middle and were both pretty ecstatic with the result: we felt like we’d gone out on a limb, but in a way that stayed true to the spirit of the project. And then Tallahassee came out and we got to read a bunch of articles about our new lo-fi album.\n\nIndefatigable in our efforts to escape the legacy of the Mountain Goats’ home-recorded past, over the course of the eight albums that followed we would exploit the production and engineering skills of meticulous sonic architects like John Vanderslice and Scott Solter, become even more of a band with the addition of Superchunk’s Jon Wurster on drums in 2007, and flesh out our songs with string and horn arrangements bordering on the Bacharachian. \n\nWith Matt Douglas fully on board as woodwinds-and-kitchen-sink guy, we’re now a four-piece, and to record this album, our fourth for Merge and the one to which you’re presumably about to listen, we went to Blackbird Studio in Nashville, as top-shelf a facility as any on the planet. They have the board Aja was recorded on. When Jon asked about snares, he was told, “We have 200 of them.” We had sixteen people from the Nashville Symphony Chorus skip out on a Mahler rehearsal to come in and sing on a song. Sixteen!\n\nThe theme this time around is goth, a subject closer to my heart perhaps than that of any Mountain Goats album previous. And while John writes the songs, as he always has, it feels more than ever like he’s speaking for all of us in the band, erstwhile goths (raises hand) or otherwise, for these are songs that approach an identity most often associated with youth from a perspective that is inescapably adult. Anyone old enough to have had the experience of finding oneself at sea in a cultural landscape that’s suddenly indecipherable will empathize with Pat Travers showing up to a Bauhaus show looking to jam, for example. \n\nBut underneath the outward humor, there is evident throughout a real tenderness toward, and solidarity with, our former fellow travelers—the friends whose bands never made it out of Fender’s Ballroom, the Gene Loves Jezebels of the world—the ones whose gothic paths were overtaken by the realities of life, or of its opposite. It’s something we talk about a lot, how fortunate and grateful we are to share this work, a career that’s become something more rewarding and fulfilling than I think any of us could have imagined. We all know how easily it could’ve gone the other way, and indeed for a long time did. \n\nMaybe that’s why John entrusted me with writing the coda to his song about a guy fed up with his major label bosses and contemplating packing it in. You know, the one I sang at the fancy recording studio, into a microphone worth more than I made in a year for most of my life. \n\nOkay, I’m wasting my time, I know. And it’s fine—as far as inevitable fates go, I can think of far worse. Please, enjoy Goths, the new album by those preeminent legends of lo-fi, the Mountain Goats!\n\n—Peter Hughes\nFebruary, 2017\nCharlotte","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/63/99-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1500023"},{"venue":"Neighborhood Theatre","event":"CONOR OBERST [Opening Act: The Felice Brothers]","date":"10 15 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1502259-conor-oberst-charlotte/","desc":"Conor Oberst joined his first band at the age of 13 and has been releasing music since 1993. Over the next two plus decades, he’s released cassette-only recordings, split 7-inches, and a dozen albums of uncommon insight, detail, and political awareness with his band Bright Eyes,  under his own name, as a member of Desaparecidos, as leader of the The Mystic Valley Band, and with the Monsters of Folk supergroup. \n\nIn Fall of 2015, and after more than a decade of living in New York City, Oberst returned to his hometown of Omaha, Nebraska, somewhat unexpectedly. Like John Lennon so famously said: “Life is what happens to you while you're busy making other plans.” After canceling a tour with Desaparecidos due to serious health issues, Oberst returned home to recuperate. The musician was unexpectedly back home at loose ends and faced with some long, cold, claustrophobic winter nights, with nothing really to do. Such conditions were the same as those that contributed to the very early songs he penned in his boyhood bedroom. This resulted in the anxious poetry, heightened self-awareness, and revealing confessionals that catalogued his doubts, demons, and nightmares. \n\n“It wasn’t premeditated at all. I don’t know if you know what Omaha is like in the winter, but it’s just paralyzing. You’re stranded in the house. Every night I was staying up late, making a point to play the new piano I had just bought and watching the snow fall outside the house. Everybody would be asleep and I would just go into this one room, make a fire, and play all night. In November I had a whole pick-up truck full of firewood delivered and I thought, ‘I’m never going to run out of it.’ Before I knew I had gone through half of the firewood and I had five songs. By February I had burned through it all, and I had 15 songs. I had just spent the whole winter making fires and playing music.”\n\nMaking and playing music has always been a healing balm for the sometimes troubled musician. And this time it especially seemed important. It was if he was writing himself back to sanity. Back to understanding what is really important and has meaning for him. And in the same kind of immediacy with which the songs were written, Oberst realized he needed to record them right away, in order to capture the kind of raw intensity and rough magic behind them. When Oberst wrote and recorded the songs, with just voice, piano, guitar and harmonica – he intended to ultimately record them with a full band. In the midst of putting together that band - upstate New York's The Felice Brothers plus the legendary drummer Jim Keltner (Neil Young, Jackson Browne, George Harrison, Bob Dylan, John Lennon, and many more) - the passionate responses Oberst was getting to those first solo recordings, from friends and colleagues, encouraged him to release the songs as-is, in their original sparse form, released in October 2016 as Ruminations. Pitchfork called it “a record like none other in Oberst’s catalog, stunning for how utterly alone he sounds,” and the UK’s Sunday Times called it, “The rawest album yet from the forever troubled one-time voice of a generation.  Political and very, very personal,” saying Oberst is “one of the best songwriters around.”\n\nMeanwhile, Oberst simultaneously moved ahead with his plans to record with the band, heading to the famed Shangri-la Studios in Malibu to record Salutations - co-produced with Keltner and engineered by long-time musical compadre Andy LeMaster. Guest contributions come courtesy of Jim James, Blake Mills, Maria Taylor, M Ward, Gillian Welch, Gus Seyffert, Pearl Charles, Nathaniel Walcott, and Jonathan Wilson.\n\nSalutations includes full band versions of the ten songs from Ruminations, plus seven additional songs, some from an additional session at Five Star Studios in Echo Park in fall 2016. Oberst says of the Salutations sessions: \"Jim (Keltner) was really the captain of the ship and the spiritual leader of the project. We leaned heavy on his fifty-plus years of musical insight to get us to where we needed to be. He brought such depth and dignity to the proceedings that made everyone else involved rise to the occasion. It was a true stroke of luck that he got involved when he did.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/99/68-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1502259"},{"venue":"Neighborhood Theatre","event":"HAVE MERCY [Opening Act: Boston Manor, Can't Swim, A Will Away]","date":"10 08 17","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1537899-have-mercy-charlotte/","desc":"in the case of Baltimore's Have Mercy, what wins out-and what ultimately astounds-is raw, unfiltered passion. The band's debut LP, The Earth Pushed Back, was one of the most honest records of 2013-an album that fans of punk and emo from Brand New to Tigers Jaw to Taking Back Sunday simply couldn't afford to miss out on. \n\nProduced by Paul Leavitt (All Time Low, The Dangerous Summer, many more), A Place Of Our Own is a refined, more muscular version of what they did well on The Earth Pushed Back - as if they trimmed the fat on some aspects of their sound while showing major growth across the board. It's an organic, sometimes subtle and sometimes very noticeable type of growth. Everyone simply sounds better from an instrumental perspective, and Swindle's gritty vocals have become only more defining this go-round. \n\nSince forming in 2011, Swindle feels the band truly has \"grown up as musicians and people and cannot wait for everyone to hear A Place Of Our Own.\"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/85/95-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1537899"},{"venue":"Neighborhood Theatre","event":"WYE OAK [Opening Act: Luke Temple]","date":"09 28 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1516597-wye-oak-charlotte/","desc":"Wye Oak announce shows and limited-edition rarities 7-inch in September\n\nAt the end of September, Wye Oak will embark on a special tour. The band describes what the audience can expect at these performances:\n \nWe’re so excited to set out on a brief run of smaller, more intimate shows this fall, where we’ll be trying out a bunch of brand-new material for the first time, taking questions from the audience, and just generally exposing y’all to our legendary brand of TMI-style stage banter. Come for a sneak peek at what’s next for us, or just to say hi. \n\nAlso, on September 22, Merge will release “Spiral” b/w “Wave Is Not the Water”, a limited-edition 7-inch on red vinyl. Pre-order your copy now! Jenn and Andy told us a little about each track, both of which were originally released in partnership with Adult Swim:\n\n“Spiral” popped up around 2012, at a time before we began work on Shriek. We were just starting to experiment with synthetic and more pop-oriented sounds, and also got assistance on the marimba from our friend Rod Hamilton, with whom Jenn was sharing a loft at the Copycat in Baltimore at the time. \n\n“Wave Is Not the Water” was created in the early months of 2017, without either of us ever setting foot in the same space. Andy was touring as the drummer for Lambchop and volleying the recording back and forth with Jenn via email, as seems to be the current state of things. \n\nPre-order “Spiral” b/w “Wave Is Not the Water” now, and don’t miss these very special evenings with Wye Oak!","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/59/57/97-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1516597"},{"venue":"Neighborhood Theatre","event":"PROTOMARTYR [Opening Act: Flasher]","date":"10 25 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1520602-protomartyr-charlotte/","desc":"Protomartyr – Relatives In Descent \n\nAfter a year of extensive touring in support of 2015’s The Agent Intellect, Protomartyr returned to their practice space in a former optician's office in Southwest Detroit. Guitarist Greg Ahee—inspired by The Raincoats' Odyshape, Mica Levi's orchestral compositions, and Protomartyr's recent collaboration with post-punk legends The Pop Group, for Rough Trade's 40th anniversary—began writing new music that artfully expanded on everything they’d recorded up until that point. The result is Relatives in Descent, their fourth full-length and Domino debut. Though not a concept album, it presents twelve variations on a theme: the unknowable nature of truth, and the existential dread that often accompanies that unknowing. This, at a moment when disinformation and garbled newspeak have become a daily reality.\n\n“I used to think that truth was something that existed, that there were certain shared truths, like beauty,” says singer Joe Casey. “Now that’s being eroded. People have never been more skeptical, and there’s no shared reality. Maybe there never was.”\n\nRelatives in Descent offers new layers and new insights, without sanding any of the edges born from their days as a Detroit bar band. Ahee’s guitar still crackles and spits electricity. Casey's voice continues to shift naturally between dead-eyed croon and fevered bark. Drummer Alex Leonard and bassist Scott Davidson remain sharp and propulsive, a rhythm section that’s as agile as it is adventurous. But this is also Protomartyr at their most impressive. After months of rehearsal, the band decamped to Los Angeles, California for two weeks in March of 2017, to record at 64Sound in Highland Park. Co-produced and recorded with Sonny DiPerri (Animal Collective, Dirty Projectors), who helped capture the band’s long-simmering vision for something more complex, but no less visceral, Relatives in Descent also features contributions from violinist Tyler Karmen and additional synths by Cheveu’s Olivier Demeaux. \n\nIt all begins with \"A Private Understanding,” pegged as the album's opening statement the second it was finished, and a wellspring from which the following eleven songs flow. At once beautiful and brutal, it mutates from drum-led oddity to unlikely anthem, with some of Casey’s most potent lyrical work at its center: “Sorrow's the wind blowing through/Truth is hiding in the wire.” He’d originally approached the writing on this album as an opportunity to move away from the anger and personal despair that defined much of Protomartyr’s previous three albums. But a lot has happened in the past two years. Disturbed by happenings both local (the ongoing, man-made tragedy of the Flint water crisis) and national (just about everything), Casey drew influence from the songwriting of Ben Wallers, the recently translated stories of Irish writer Máirtín Ó Cadhain, and Robert Burton’s The Anatomy of Melancholy, a sprawling, 17th century masterwork that provided both solace and confirmation. \n\nOne can hear these influences throughout, be it in the wary reportage of “Here Is The Thing” or the uncanny menace of \"Windsor Hum\", the shining city of \"Don't Go To Anacita” or the triptych of delusions both \"good\" and \"bad\" that is \"Up The Tower\", \"Night-Blooming Cereus\", and \"Male Plague\". In the end, Relatives in Descent offers a small light in the darkness, while never denying that we are all just standing in the dark.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/28/35-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1520602"},{"venue":"Neighborhood Theatre","event":"JUMP, LITTLE CHILDREN [Opening Act: Stop Light Observations, She Returns From War]","date":"10 20 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1518919-jump-little-children-charlotte/","desc":"JUMP BIO / WHERE ARE THEY NOW?\n\nThe band came together in their current lineup in 1994. Based out of Charleston, SC they toured regionally, nationally and internationally releasing 4 studio albums (The Licorice Tea Demos - 1995, Magazine - 1998, Vertigo - 2001, Between the Dim & the Dark - 2004), 2 EPs (Buzz - 1997, Between the Glow & the Light - 2005) 1 compilation of early material (The Early Years, Volume 1 - 2001) and a live double-album of their final performances (Live at the Dock Street Theatre - 2006). Known for their eclectic mix of musical influences from ethereal chamber pop to guitar driven alt-rock along with high-energy live shows, they built a grass-roots following of devoted fans across the country. After over a decade of touring and recording they announced an indefinite hiatus in 2005. Since then the members have focused their energy on pursuing new and exciting projects:\n\nJay Clifford\nJay released two solo records (Driving Blind - 2007, Silver Tomb for the Kingfisher - 2012) and founded his own studio, Hello Telescope, where he has produced records for artists such as Heather Nova and William Fitzsimmons. Jay has also collaborated with the Colorado Symphony orchestrating for artists like Ingrid Michaelson, Amos Lee and Ariel Pink for their Red Rocks concert series. \n\nWard Williams\nWard moved to New York City and has performed with various artists (Sara Bareilles, Alicia Witt, Vienna Teng, Brandi Carlisle among others).  \n\nMatthew and Evan Bivins\nThe Bivins Brothers' first post-Jump project was Cabaret Kiki, a neo-cabaret variety show with music. Kiki featured some of Charleston’s finest musicians (Bill Carson, Cary Ann Hearst, Nathan Koci, Ash Hopkins) along with dancers from Charleston Ballet Theater and many other talented writers, technicians and collaborators. \n\nThe Bivins then moved to Chicago, IL. Matt has been performing mostly as a stage actor with The House Theatre, City Lit Theater, Strawdog Theatre, Barter Theater of Virginia, and the Bughouse Theater.\n\nEvan has composed music for the Giordano Dance Company and performed and recorded with various artists (Duncan Sheik, Cary Ann Hearst, Rachel Ries, Mar Caribe, Grit & the Double Knit, Andy Wagner).\n\nJonathan Gray\nJohnny toured with various artists (Howie Day, William Fitzsimmons, Slow Runner, Cordovas, Post Cobra, Bill Carson, Josh Hoge, Crowfield) and has been teaching music to students of all ages at Hungry Monk in Charleston.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/06/55-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1518919"},{"venue":"Neighborhood Theatre","event":"AGAINST ME! [Opening Act: Bleached, The Dirty Nil]","date":"10 18 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1481480-against-me-charlotte/","desc":"Four years is a measurement of time that America has used for centuries to indicate change. Presidential terms last four years; high school diplomas and college degrees typically take four years apiece, too. It’s not an arbitrary thing, either: It typically takes that much time from the declaration of something changing for it to actually change.\n\nMeet Laura Jane Grace. Four years ago, the Against Me! frontwoman came out as transgender; 18 months later, she released the band’s sixth album, the fiery Transgender Dysphoria Blues, one which she began working on before her transition and helped document the struggles she was facing. It was an intensely personal record that took on a life of its own, connecting with thousands of new listeners drawn to Grace’s honesty and complexity while still pleasing Against Me!’s dedicated fanbase.\n\nNow, four years after Grace’s public reintroduction, Against Me! is ready to release their new album, Shape Shift With Me, September 16 on Total Treble. While much has changed in the lives of Grace and her bandmates—guitarist James Bowman, bassist Inge Johansson and drummer Atom Willard—in that time period, it’s clear that those intervening years have done wonders for creativity.\n\n“Everything with Shape Shift With Me has been really about keeping momentum going,” she says. “In between every tour we did for Transgender Dysphoria Blues, I would have a couple songs I had written and we would demo them. At the end of two years of touring, we had an album ready to record. Usually, you come off of touring for a record and you're back at square one. But this was so fully formed it felt like there was no choice but to go ahead and record the songs.”\n\nShape Shift With Me has the distinction of the first album Grace has written truly from the heart, with no metaphorical cloaks cast over the lyrics. It’s an album about love, that deceptively complex emotion we all struggle with yet has somehow eluded most of Grace’s songwriting for the past 20 years.\n\n“Tons of people have written about love. But while love is cliché, it’s infinitely relevant. For me, having always been in a punk band that was expected to be political, I never felt like I had that option to write about feelings in that way. That’s what I ended up being drawn to this time. It’s writing in a way I thought I could never write before, and not giving a shit about expectations.”\n\nAs such, Shape Shift With Me is a loose concept album about traveling the world and falling in and out of love, with Grace serving as the narrator. But even though she was opening herself up to new songwriting topics, she knew what her mission was from the start.\n\n“Is there a record that is about relationships from a trans perspective?” she asks rhetorically. “There needs to be more records about trans rights and everything like that, but feeling like I already did that, I wanted to move on to write commentary on living from a trans perspective. I wanted to write the transgender response to the Rolling Stones’ Exile On Main St., Liz Phair’s Exile In Guyville and the Streets’ A Grand Don’t Come For Free. All those records are relationship records. There’s been an infinite amount of records talking about what love means from a cisgender perspective. I wanted to present the trans perspective on sex, love and heartbreak.”\n\nWith Grace’s new motivation came a new outlook on the band, as well. Previous albums found the songwriting process to be a largely solitary experience, but she embraced the spirit of collaboration for Shape Shift With Me—so much so that when Cody Votolato of the Blood Brothers sent her some demos of songs he was working on for another project, she became inspired and ended up co-writing “Boyfriend” and “Norse Truth,” two of the album’s most memorable tracks, with him.\n\n“It was just about opening up to whatever comes my way karmically,” Grace says. “Whatever everyone in the band is willing to offer, I just wanted to be open to it. I didn’t want it to be like what it was in the past where it may have felt closed. I want it to be different.”\n\nIn a career already full of classic punk records, Shape Shift With Me feels like the definitive Against Me! album—it’s poppy and catchy (“Rebecca,” “Suicide Bomber”), aggressive and in-your-face (“ProVision L-3,” “Dead Rats”), sentimental and longing (“Crash,” “All This And More”). Moreover, it’s the culmination of four years of existence as Laura Jane Grace—there’s no going back now, so she might as well embrace it.\n\n“While I’ve always wanted the moon and the stars, I have a certain amount of humbleness,” she admits. “I just want to play shows and make records and write songs. That’s what I’ve always wanted to do. Of course I always want the biggest and best things for those shows and records and songs, but when it comes down to it, I just love doing it. I have no other ambitions or career goals.\n\n“David Bowie put out 27 full-lengths. Prince put out 39 full-lengths,” Grace remarks. “That is so inspiring to me—working, creating art, creating records and let everyone else sort it out. That’s what I’ve always wanted to do and that’s what I will keep on doing.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/53/84/88-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1481480"},{"venue":"Neighborhood Theatre","event":"SUPERCHUNK [Opening Act: Bat Fangs]","date":"10 27 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1538650-superchunk-charlotte/","desc":"Since releasing their first 7-inch in 1989, Superchunk has run the gamut of milestone albums: early punk rock stompers, polished mid-career masterpieces, and lush, adventurous curveballs. Conventional wisdom holds that a band two decades into its career can only rehash or reinvent, but with Majesty Shredding, Superchunk has done something entirely different. Neither a return nor a departure, Majesty Shredding telescopes two decades into 41 indelible, action-packed minutes. It is the sound of youthful exuberance fine-tuned with grown-up confidence. And it may very well be Superchunk’s best record yet.\n\nThough it has been nine years since Superchunk released their last full-length album, Here’s to Shutting Up, Majesty Shredding is the result of a focused burst of creativity brought on by the band’s recent volley of live performances. Having cleared the deck of odds and sods with last year’s Leaves in the Gutter EP, Superchunk frontman Mac McCaughan set about to write a batch of songs that would capture the spirit of the band’s live shows. From 1997’s Indoor Living through Here’s to Shutting Up, Superchunk had written most of their records together, building their songs through collaborative writing and rehearsal. But, in an effort not to overthink their new material (and because drummer Jon Wurster lives a couple hundred miles away from the rest of the band), Superchunk approached Majesty Shredding the same way they approached their early records: McCaughan provided skeletal demos to his bandmates, who in turn fleshed out the songs during a brief period of rehearsal and recording.\n\nThis sense of purpose is enhanced by the presence of Scott Solter, an engineer and producer known for coaxing exceptional performances out of the artists he works with. Majesty Shredding is a powerful document of Superchunk as a band, augmented as needed with well-placed harmonies, keyboards, and guitar overdubs (and some backing vocals courtesy of the Mountain Goats’ John Darnielle). Each song seems perfectly suited to its respective treatment, as the band moves lithely from shout-along rave-ups like ‘Crossed Wires’ to melancholy slow burners like ‘Fractures in Plaster.’ As always, Superchunk strikes a unique and effortless balance between melody and force, craft and spontaneity, the energy of youth and the wisdom of experience. Majesty Shredding is Superchunk’s most thorough and thoughtful record, and it hits like a punch in the gut.\n\nOn songs like ‘My Gap Feels Weird,’ ‘Rosemarie,’ and ‘Digging for Something,’ McCaughan asks: How can we connect with our pasts and still move forward? Majesty Shredding offers an answer. During album closer ‘Everything at Once,’ McCaughan sings about how strongly we identify with songs about nothing in particular: ‘The feedback and the drums / The feeling noise becomes / Nothing and everything at once.’ We close our eyes and think about the kind of music that’s meant the most to us in our lives…and we realize that we’re listening to it right now.\n\nJim Wilbur - guitar and backing vocals\nJon Wurster - drums, backing vocals\nLaura Ballance - bass, backing vocals\nMac McCaughan - guitar, vocals\n\nThe Superchunk Rock Vessel plowed forth from 1993 to 1996. The band put out one more record for Matador (On the Mouth) and then opted to release its own records, through Merge. The album, Foolish brought stylistic shifts and critical acclaim. A second singles compilation (the first was 1992’s Tossing Seeds) came out in the summer of ‘95. It was titled Incidental Music and contained most of their harder-to-find numbers (imports, b-sides, comp. tracks). Boston was the setting for Superchunk’s next album session. 1995’s Here’s Where the Strings Come In was recorded at the city’s Fort Apache Studios and slated for a fall release. The band toured hard for Strings all over the world, scoring a minor hit with the “Hyper Enough” single and video.\nAfter a brief hiatus and another Australian tour the band released a limited-edition EP called The Laughter Guns. The band then started the writing process for what would become Indoor Living. Recording commenced in Bloomington, Indiana’s Echo Park Studios with Chapel Hillian John Plymale co-producing with the band. Superchunk stretched out a bit on Indoor Living, expanding their sound by adding some new instruments to the mix: piano, organ vibes and more. The album was by far their most adventurous and at the same time their most accessible to date.\n\nTo place their own indelible mark on the end of a decade, nay, the end of a century, Superchunk delivered Come Pick Me Up, their 7th full-length studio release for Chapel Hill’s favorite sons [and daughter]. It also served as part of the 10th anniversary for the band and their label, Merge Records.\n\nJim, John, Mac and Laura traveled to Chicago this time around for a recording session at Electrical Audio Studios with legendary abstract pop pioneer Jim O’Rourke. Set on continuing the musical journey that began on Indoor Living, Superchunk have continued the expansion and growth of their sound that started with Foolish, pushing themselves to new heights of creativity. O’Rourke was a perfect choice; incorporating strings and horns on some tracks and lending the expertise and studio savvy to help Superchunk create their most mature and enduring record to date. They’ve come a long way since those “Slack Motherfucker” days of working at the Kinko’s on Franklin Street in Chapel Hill.\n\nFor Here’s To Shutting Up, the band traveled to Atlanta, GA’s Zero Return Studios to record the basic tracks, bringing producer Brian Paulson with them. The finishing touches were added at Paulson’s own Uwharrie Ridge Studios in Chatham County NC, just down the road from Chapel Hill. On Here’s To Shutting Up, Paulson enjoys the distinction of being the first producer to work with Superchunk twice (the first time being 1994’s Foolish LP), and this familiarity helped lend to a comfort zone that allowed the band to stretch out their musical sensibilities, creating a gorgeous tapestry of sound that is as refreshing as it is astounding.\n\nHere’s To Shutting Up documents their ongoing maturation as both songwriters and musicians. Songs such as “Late-Century Dream,” “Phone Sex” and “Drool Collection” shimmer with intricate melodies and some of the most diverse instrumentation and stylistic innovations yet heard in the Superchunk canon. But the boys and a girl can still rock out with the best of them on tracks such as “Rainy Streets” and “Art Class.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/59/75-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1538650"},{"venue":"Neighborhood Theatre","event":"I PREVAIL - Rage On The Stage Tour [Opening Act: We Came As Romans, The Word Alive, Escape The Fate, Crank It Loud]","date":"11 01 17","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1540430-i-prevail-rage-on-stage-charlotte/","desc":"American post-hardcore band formed in 2013 in Southfield, MI, USA.\nThe band released their debut EP \"Heart Vs Mind\" in 2014, and gained popularity after posting a cover of Taylor Swift's \"Blank Space\" to YouTube in December 2014. The band released their debut album, \"Lifelines\" on October 21, 2016.\n\nCurrent members:\nBrian Burkheiser - clean vocals (2013–present)\nEric Vanlerberghe - unclean vocals (2013–present)\nSteve Menoian - lead guitar (2013–present)\nLee Runestad - drums (2013–present)\nDylan Bowman - rhythm guitar, backing vocals (2015–present)\nTony Camposeo - bass guitar (2015–present)\n\nFormer members:\nJordan Berger - rhythm guitar, backing vocals (2013–2015)","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/06/72-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1540430"},{"venue":"Neighborhood Theatre","event":"An Evening With CHRIS ROBINSON BROTHERHOOD *2 Sets*","date":"09 22 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1490489-evening-chris-robinson-charlotte/","desc":"The Chris Robinson Brotherhood is touring in support of its latest release, Phosphorescent Harvest. Praised by Rolling Stone as “at once quirky, trippy, soulful and downright magnetic,” it’s the band’s third long-playing album for Silver Arrow Records. Robinson declares: \"We've created a piece of rock 'n' roll here. People can look to us and rest assured the genre is alive and well. \n\nThe CRB (as they are affectionately known by fans) made an immediate impact upon their boldly unconventional debut in early 2011. They would play close to 50 shows over nine weeks in California before ever leaving the Golden State. In fact, they’d wait until 2012 to truly introduce themselves nationally with the release of two sprawling studio albums: Big Moon Ritual (June 2012) and The Magic Door (September 2012), which showcase a freewheeling improvisational chemistry, but with songwriting depth to back it up. The band—Robinson (Lead vocals, guitar), Neal Casal (guitar, vocals), Adam Macdougall (keys, vocals), Mark Dutton (bass, vocals) and Tony Leone (drums)—would further develop their identity as a self-defined “farm to table psychedelic rock band” over a 118-show stretch. Late 2013 saw the fruits of this labor forever captured by legendary tape priestess, Betty Cantor-Jackson (Grateful Dead), on the eight-sided limited-edition vinyl release Betty’s S.F. Blends Volume 1, which documented a glorious five night run the previous December at San Francisco’s famed Great American Music Hall. \n\nOnly momentarily content with their auspicious rise, the Brotherhood reconvened with producer Thom Monahan (Vetiver, Beachwood Sparks, Devendra Banhart) shortly thereafter to record yet another set of ten songs that would become the 2014 release, Phosphorescent Harvest. Where Robinson had been the primary instigator behind the 14 compositions that populated the band’s first two releases, this latest effort documents his burgeoning songwriting partnership with Neal Casal. It also finds The CRB refining its approach within the studio. The two previous recordings were for all intents and purposes cut live and released as tracked. For Phosphorescent Harvest, the band spent the better part of 2013 crafting a tried and true studio album. For many artists this would imply intentional neutering in the pursuit of commercial upside, but in Robinson and company's hands, it meant utilizing the studio to harness their full sonic vision. Indeed, their expansive sense of space and texture has never been so fully realized until now. Casal expands on the process: \"The approach was get to far out sonically, while retaining a certain focus on the central melody of each song. Psychedelia, sonic density, and expanded arrangements were the order of the day, but the songs are strong. This band is all about musical freedom. Boundary dissolving is our ideal. Boundary dissolving and a good ole’ Saturday night boogie.\" \n\nIn an age when so many put their beliefs in trends, the Chris Robinson Brotherhood is committed to something deeper. In Robinson’s words: \"We don't make music that can sell iPads. Our music will not sell you a Prius. I like that. Writing songs has always led me to good things in my life. The songwriting saved me through the dark times, and the songwriting makes it that much sweeter when it’s good. Real success can only come in pursuit of an authentic sound. We’re all very committed to this music, beyond money and egos. That’s a unique place to be.\"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/55/12/38-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1490489"},{"venue":"Neighborhood Theatre","event":"BONE THUGS-N-HARMONY [Opening Act: Hipgnostic]","date":"09 27 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1543785-bone-thugs-n-harmony-charlotte/","desc":"Bone Thugs-n-Harmony is one of the most well renowned hip-hop groups to come out of the early ‘90s. They started their career in Cleveland, Ohio, US and launched their career after Eazy-E signed them to Ruthless Records.\n\nThe group started performing around the Cleveland area in the early ‘90s under several names such as The Band-Aid Boys and B.O.N.E. Enterpri$e. The group was fairly large containing five members: Layzie Bone, Krayzie Bone, Bizzy Bone, Flesh-n-Bone, and Wish Bone. They released their first album “Faces of Death” in 1993 under the guidance of Krayzie Bone’s older brother, but the album did not gain them the success they were hoping to achieve. After the group released their debut album they were persistently seeking to find someone who could give them a record deal. After much searching they finally caught the eye of NWA’s Eazy-E who signed them to his label and convinced the group to change their name from B.O.N.E. Enterpri$e to Bone Thugs-n-Harmony.\n\nIn 1994 the group released their first EP “Creepin on ah Come Up” on Ruthless Records to commercial and critical success. The EP reached No. 12 on the Billboard 200 and No. 2 on Billboard’s Top R&B/Hip-Hop Albums chart. The EP contained the very popular singles “Thuggish Ruggish Bone” and “For tha Love of $”, which featured Eazy-E. The EP showed Bone Thugs-n-Harmony shifting styles from the hardcore and abrasive gangsta rap style to a more G-Funk style that was prevalent in West Coast hip-hop.\n\nThe year 1995 showed Bone Thugs-n-Harmony releasing their second album “E. 1999 Eternal”, which would become the group’s most popular album. The album has been certified 4x Platinum and reached the No. 1 slot on the Billboard 200 chart. The album was also a critical success having been nominated for a Grammy for Best Rap Album and The Source labeled it as one of the best rap albums of the ‘90s. The album contained the singles “1st of that Month”, “East 1999”, and “Tha Crossroads”. Bone Thugs-n-Harmony were also praised for their melodic approach to rapping as well as the soundscape of the album, which included infectious G-Funk beats and dark uses of synthesizers.\n\nAfter achieving mainstream success with their music career, the group started their own label called Mo Thugs Records that released albums for many Cleveland based artists. The group’s third album “The Art of War” was released in 1997 to commercial success and contained several unique collaborations, which included a song with Tupac Shakur labeled “Thug Luv”. The group’s fourth album “BTNHResurrection” also received commercial success, but it would be the last album that Flesh-n-Bone would appear on until their 2010 release “Uni5: The World’s Enemy”.\n\nIn the early 2000’s Bizzy Bone, Layzie Bone, and Krayzie Bone would take a break from the group and each release solo albums. For the group’s 2006 album “Thug Stories” the group was only down to three members, Krayzie Bone, Layzie Bone, and Wish Bone, but the album was well received and placed high on the Billboard charts. Their 2010 album “Uni5: The World’s Enemy” saw all original members of the group reunited again.\n\nOver the years the group has collaborated with some of the most celebrated performers in the business including Phil Collins, Mariah Carey, The Game, Akon, and will.i.am. The group has also worked with some of the most well-respected rappers including 2Pac, The Notorious B.I.G., and Big Pun. The group’s final album has plans for collaborations with Drake, Kendrick Lamar, and A$AP Mob. Their final album will only have one copy released, which will have a starting bid of $1 million dollars, and the album will be backed by a large world tour.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/69/39-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1543785"},{"venue":"Neighborhood Theatre","event":"BETWEEN THE BURIED AND ME - Colors 10 Year Anniversary Tour **SOLD OUT** [Opening Act: The Contortionist, Polyphia, Toothgrinder]","date":"10 21 17","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1489684-between-buried-me-colors-charlotte/","desc":"American progressive metal band from Raleigh, North Carolina founded in 2001.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/54/96/40-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1489684"},{"venue":"Neighborhood Theatre","event":"BETWEEN THE BURIED AND ME - Colors 10 Year Anniversary Tour [Opening Act: The Contortionist, Polyphia, Toothgrinder]","date":"10 22 17","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1517227-between-buried-me-colors-charlotte/","desc":"American progressive metal band from Raleigh, North Carolina founded in 2001.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/54/96/40-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1517227"},{"venue":"Neighborhood Theatre","event":"MAYHEM - 'de Mysteriis Dom Sathanas' Tour [Opening Act: Immolation, Black Anvil]","date":"11 28 17","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1540434-mayhem-de-mysteriis-dom-charlotte/","desc":"Highly influential black metal band from Ski/Oslo, Norway. Founded in 1984 by Øystein Aarseth, Manheim and Jørn Stubberud.\n\nNotorious for, among other things, the shotgun suicide of singer Per Yngve Ohlin, the murder of Aarseth by Varg Vikernes, and a string of church arsons for which Vikernes was convicted.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/06/77-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1540434"}]