[{"venue":"Neighborhood Theatre","event":"AOC FEST featuring Robert Glasper Experiment [Opening Act: Dynamo, Kenneth Whalum]","date":"10/07/2017","times":"Doors: 7:30 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1555272-aoc-fest-robert-glasper-charlotte/","desc":"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/65/66-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1555272"},{"venue":"Neighborhood Theatre","event":"I PREVAIL - Rage On The Stage Tour [Opening Act: We Came As Romans, The Word Alive, Escape The Fate, Crank It Loud]","date":"11/01/2017","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1540430-i-prevail-rage-on-stage-charlotte/","desc":"American post-hardcore band formed in 2013 in Southfield, MI, USA.\nThe band released their debut EP \"Heart Vs Mind\" in 2014, and gained popularity after posting a cover of Taylor Swift's \"Blank Space\" to YouTube in December 2014. The band released their debut album, \"Lifelines\" on October 21, 2016.\n\nCurrent members:\nBrian Burkheiser - clean vocals (2013–present)\nEric Vanlerberghe - unclean vocals (2013–present)\nSteve Menoian - lead guitar (2013–present)\nLee Runestad - drums (2013–present)\nDylan Bowman - rhythm guitar, backing vocals (2015–present)\nTony Camposeo - bass guitar (2015–present)\n\nFormer members:\nJordan Berger - rhythm guitar, backing vocals (2013–2015)","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/06/72-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1540430"},{"venue":"Neighborhood Theatre","event":"CONOR OBERST [Opening Act: The Felice Brothers]","date":"10/15/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1502259-conor-oberst-charlotte/","desc":"Conor Oberst joined his first band at the age of 13 and has been releasing music since 1993. Over the next two plus decades, he’s released cassette-only recordings, split 7-inches, and a dozen albums of uncommon insight, detail, and political awareness with his band Bright Eyes,  under his own name, as a member of Desaparecidos, as leader of the The Mystic Valley Band, and with the Monsters of Folk supergroup. \n\nIn Fall of 2015, and after more than a decade of living in New York City, Oberst returned to his hometown of Omaha, Nebraska, somewhat unexpectedly. Like John Lennon so famously said: “Life is what happens to you while you're busy making other plans.” After canceling a tour with Desaparecidos due to serious health issues, Oberst returned home to recuperate. The musician was unexpectedly back home at loose ends and faced with some long, cold, claustrophobic winter nights, with nothing really to do. Such conditions were the same as those that contributed to the very early songs he penned in his boyhood bedroom. This resulted in the anxious poetry, heightened self-awareness, and revealing confessionals that catalogued his doubts, demons, and nightmares. \n\n“It wasn’t premeditated at all. I don’t know if you know what Omaha is like in the winter, but it’s just paralyzing. You’re stranded in the house. Every night I was staying up late, making a point to play the new piano I had just bought and watching the snow fall outside the house. Everybody would be asleep and I would just go into this one room, make a fire, and play all night. In November I had a whole pick-up truck full of firewood delivered and I thought, ‘I’m never going to run out of it.’ Before I knew I had gone through half of the firewood and I had five songs. By February I had burned through it all, and I had 15 songs. I had just spent the whole winter making fires and playing music.”\n\nMaking and playing music has always been a healing balm for the sometimes troubled musician. And this time it especially seemed important. It was if he was writing himself back to sanity. Back to understanding what is really important and has meaning for him. And in the same kind of immediacy with which the songs were written, Oberst realized he needed to record them right away, in order to capture the kind of raw intensity and rough magic behind them. When Oberst wrote and recorded the songs, with just voice, piano, guitar and harmonica – he intended to ultimately record them with a full band. In the midst of putting together that band - upstate New York's The Felice Brothers plus the legendary drummer Jim Keltner (Neil Young, Jackson Browne, George Harrison, Bob Dylan, John Lennon, and many more) - the passionate responses Oberst was getting to those first solo recordings, from friends and colleagues, encouraged him to release the songs as-is, in their original sparse form, released in October 2016 as Ruminations. Pitchfork called it “a record like none other in Oberst’s catalog, stunning for how utterly alone he sounds,” and the UK’s Sunday Times called it, “The rawest album yet from the forever troubled one-time voice of a generation.  Political and very, very personal,” saying Oberst is “one of the best songwriters around.”\n\nMeanwhile, Oberst simultaneously moved ahead with his plans to record with the band, heading to the famed Shangri-la Studios in Malibu to record Salutations - co-produced with Keltner and engineered by long-time musical compadre Andy LeMaster. Guest contributions come courtesy of Jim James, Blake Mills, Maria Taylor, M Ward, Gillian Welch, Gus Seyffert, Pearl Charles, Nathaniel Walcott, and Jonathan Wilson.\n\nSalutations includes full band versions of the ten songs from Ruminations, plus seven additional songs, some from an additional session at Five Star Studios in Echo Park in fall 2016. Oberst says of the Salutations sessions: \"Jim (Keltner) was really the captain of the ship and the spiritual leader of the project. We leaned heavy on his fifty-plus years of musical insight to get us to where we needed to be. He brought such depth and dignity to the proceedings that made everyone else involved rise to the occasion. It was a true stroke of luck that he got involved when he did.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/99/68-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1502259"},{"venue":"Neighborhood Theatre","event":"COLTER WALL + TYLER CHILDERS","date":"09/20/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1534579-colter-wall-tyler-childers-charlotte/","desc":"Colter Wall is a young Saskatchewan born songwriter and performing musician. Steeped in Old Timey material and traditional Americana, Wall's sound is comprised of resonate and raw baritone vocals, Folk and Bluegrass style guitar and banjo picking, steady kick-drum stomping, and visually provoking, story telling lyrics. Wall Draws influence from legends of the past such as Hank Williams, Robert Johnson, Bob Dylan, Johnny Cash, Townes Van Zandt, and The Band, as well as more modern Americana pioneers including Shovels and Rope, Jack White, Ray Lamontagne, and Shakey Graves. Despite only recently beginning his musical career, Colter Wall has been seen in the company of Saskatchewan's infamous gritty bluegrass trailblazers,The Dead South. Wall has had the opportunity to open for The Dead South on several occasions with more show's upcoming. In addition to racking up memorable live shows across the province, Wall is planning on releasing an EP in the summer of 2015 and has been busy recording at Regina's own Studio One. From dive bars to fundraiser galas, Colter Wall has a history of leaving audiences in shock at the maturity of his voice as well as his songwriting.Like many great Southern storytellers, singer-songwriter Tyler Childers has fallen in love with a place. The people, landmarks and legendary moments from his childhood home of Lawrence County, Kentucky, populate the 10 songs in his formidable debut, Purgatory, an album that's simultaneously modern and as ancient as the Appalachian Mountains in which events unfold.\n\nThe album, co-produced by Grammy Award winners Sturgill Simpson and David Ferguson, is a semiautobiographical sketch of Childers' growth from wayward youth to happily married man, told in the tradition of a Southern gothic novel with a classic noir antihero who may just be irredeemable. Purgatory is a chiaroscuro painting with darkness framing light in high relief. There's catharsis and redemption. Sin and temptation. Murder and deceit. Demons and angels. Moonshine and cocaine. So much moonshine and cocaine. All played out on the large, colorful canvas of Eastern Kentucky.\n\nChilders had been searching for a certain sound for his debut album for years as he honed his craft, and was finding it elusive when his friend, drummer Miles Miller, introduced him to Simpson, the Grammy Award-winning musician and fellow Kentuckian. Childers sent Simpson a group of his songs, then went to visit him in Nashville.\n\n\"And he said, 'There's this sound. I know what you're trying to get at, the mountain sound,'\" Childers recalled. \"'So I asked, 'What are you doing?'\"\n\nIntrigued, Simpson enlisted the aid of Ferguson, the Grammy Award winning sound engineer. They assembled a band that included multi-instrumentalists Stuart Duncan, Michael J. Henderson and Russ Pahl, bassist Michael Bub and Miller on drums, of course, and helped Childers make a debut album of consequence that announces an authentic new voice.\n\n\"I was writing an album about being in the mountains,\" Childers said. \"I wanted it to have that gritty mountain sound. But at the same time, I wanted a more modern version of it that a younger generation can listen to -- the people I grew up with, something I'd want to listen to.\"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/41/85-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1534579"},{"venue":"Neighborhood Theatre","event":"PERPETUAL GROOVE","date":"12/29/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1553312-perpetual-groove-charlotte/","desc":"Rising out of the low country of Savannah, GA in 2001, Perpetual Groove has grown quickly into a formidable international touring organization. Now based in Athens, GA, the band continues to ride an unending wave of momentum buoyed by an enthusiastic fan base and international critical acclaim. Fans of Perpetual Groove (or PGroove, as the fans like to call them) are known to follow the band from state to state, night to night, to experience their euphoric live show that features an ever changing set-list. Perpetual Groove’s music has evolved into a genre-bending, highly original sound that touches upon jazz-rock, neo-psychedelia, R&B, trance electronica, progressive rock, and anthemic arena rock. Their large catalog of original music offers something for everyone, but the band is also known for their eclectic range of covers; including everything from Michael Jackson’s “Thriller” to Rage Against The Machine’s “Bulls On Parade”. The addition of an intense, retina burning, intelligent light show creates an atmosphere unlike any other, assuring fans they’ll get a highly polished, yet different show each night.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/09/03/49-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1553312"},{"venue":"Neighborhood Theatre","event":"An Evening With CHRIS ROBINSON BROTHERHOOD *2 Sets*","date":"09/22/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1490489-evening-chris-robinson-charlotte/","desc":"The Chris Robinson Brotherhood is touring in support of its latest release, Phosphorescent Harvest. Praised by Rolling Stone as “at once quirky, trippy, soulful and downright magnetic,” it’s the band’s third long-playing album for Silver Arrow Records. Robinson declares: \"We've created a piece of rock 'n' roll here. People can look to us and rest assured the genre is alive and well. \n\nThe CRB (as they are affectionately known by fans) made an immediate impact upon their boldly unconventional debut in early 2011. They would play close to 50 shows over nine weeks in California before ever leaving the Golden State. In fact, they’d wait until 2012 to truly introduce themselves nationally with the release of two sprawling studio albums: Big Moon Ritual (June 2012) and The Magic Door (September 2012), which showcase a freewheeling improvisational chemistry, but with songwriting depth to back it up. The band—Robinson (Lead vocals, guitar), Neal Casal (guitar, vocals), Adam Macdougall (keys, vocals), Mark Dutton (bass, vocals) and Tony Leone (drums)—would further develop their identity as a self-defined “farm to table psychedelic rock band” over a 118-show stretch. Late 2013 saw the fruits of this labor forever captured by legendary tape priestess, Betty Cantor-Jackson (Grateful Dead), on the eight-sided limited-edition vinyl release Betty’s S.F. Blends Volume 1, which documented a glorious five night run the previous December at San Francisco’s famed Great American Music Hall. \n\nOnly momentarily content with their auspicious rise, the Brotherhood reconvened with producer Thom Monahan (Vetiver, Beachwood Sparks, Devendra Banhart) shortly thereafter to record yet another set of ten songs that would become the 2014 release, Phosphorescent Harvest. Where Robinson had been the primary instigator behind the 14 compositions that populated the band’s first two releases, this latest effort documents his burgeoning songwriting partnership with Neal Casal. It also finds The CRB refining its approach within the studio. The two previous recordings were for all intents and purposes cut live and released as tracked. For Phosphorescent Harvest, the band spent the better part of 2013 crafting a tried and true studio album. For many artists this would imply intentional neutering in the pursuit of commercial upside, but in Robinson and company's hands, it meant utilizing the studio to harness their full sonic vision. Indeed, their expansive sense of space and texture has never been so fully realized until now. Casal expands on the process: \"The approach was get to far out sonically, while retaining a certain focus on the central melody of each song. Psychedelia, sonic density, and expanded arrangements were the order of the day, but the songs are strong. This band is all about musical freedom. Boundary dissolving is our ideal. Boundary dissolving and a good ole’ Saturday night boogie.\" \n\nIn an age when so many put their beliefs in trends, the Chris Robinson Brotherhood is committed to something deeper. In Robinson’s words: \"We don't make music that can sell iPads. Our music will not sell you a Prius. I like that. Writing songs has always led me to good things in my life. The songwriting saved me through the dark times, and the songwriting makes it that much sweeter when it’s good. Real success can only come in pursuit of an authentic sound. We’re all very committed to this music, beyond money and egos. That’s a unique place to be.\"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/55/12/38-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1490489"},{"venue":"Neighborhood Theatre","event":"DIGITOUR: GOODTIMES [Opening Act: Tyler Brown, Bryce Hall, Jackson Krecioch, Mikey Barone, Justin Blake]","date":"10/05/2017","times":"Doors: 5:30 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1530669-digitour-goodtimes-charlotte/","desc":"DigiTour Media is a touring music and social media festival production company, known for producing the world's first social media tour.\n\nDigiTour is a next level, interactive, variety show - expect comedy, theatrical sketches, games, music, and a one of a kind live experience!","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/92/91-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1530669"},{"venue":"Neighborhood Theatre","event":"GOTH PROM [Opening Act: Dollar Signs, Mall Goth, Walter Etc., Dead Bars, Sext Message]","date":"10/31/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1553610-goth-prom-charlotte/","desc":"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/36/32-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1553610"},{"venue":"Neighborhood Theatre","event":"DOUBLE DOOR INN ANNIVERSARY REUNION PARTY [Opening Act: Lenny Federal Band, Crisis, The Stragglers]","date":"12/17/2017","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1553140-double-door-inn-anniversary-charlotte/","desc":"For over 43 years, the Double Door Inn was more than an old house on Charlottetowne Avenue. It was recognized as one of the oldest blues music venues in the United States, bringing in musicians of all genres to Charlotte, NC. It was the place that you went to hang out on Friday afternoon, or Saturday night. To meet old friends, and make new ones. What had once been the house built by the Wearn family, one of the prominent families in Charlotte during the early 20th centuries, become the home of the Charlotte music scene, and the place where owner Nick Karres oversaw countless nights of music and memories.\n\nWhile we cannot bring it back, this show is a homecoming for the many that had the Double Door Inn pass through them, just as much as we passed through it. On the week that the venue would have celebrated its 44th anniversary, we bring together some of the musicians that made the Double Door their home. Lenny Federal Band, Crisis, and The Stragglers. We also will screen Live At The Double Door Inn, the documentary about the venue’s history and final days. We also welcome back Nick Karres and his family, who have been part of our own extended families for many years.\n\nGather, return, and let the music play on.\n-Daniel Coston","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/21/62-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1553140"},{"venue":"Neighborhood Theatre","event":"HAVE MERCY [Opening Act: Boston Manor, Can't Swim, A Will Away]","date":"10/08/2017","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1537899-have-mercy-charlotte/","desc":"in the case of Baltimore's Have Mercy, what wins out-and what ultimately astounds-is raw, unfiltered passion. The band's debut LP, The Earth Pushed Back, was one of the most honest records of 2013-an album that fans of punk and emo from Brand New to Tigers Jaw to Taking Back Sunday simply couldn't afford to miss out on. \n\nProduced by Paul Leavitt (All Time Low, The Dangerous Summer, many more), A Place Of Our Own is a refined, more muscular version of what they did well on The Earth Pushed Back - as if they trimmed the fat on some aspects of their sound while showing major growth across the board. It's an organic, sometimes subtle and sometimes very noticeable type of growth. Everyone simply sounds better from an instrumental perspective, and Swindle's gritty vocals have become only more defining this go-round. \n\nSince forming in 2011, Swindle feels the band truly has \"grown up as musicians and people and cannot wait for everyone to hear A Place Of Our Own.\"","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/85/95-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1537899"},{"venue":"Neighborhood Theatre","event":"PASSAFIRE","date":"11/16/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1554054-passafire-charlotte/","desc":"“It’s all in our minds / Planted over time / Grew into a vine / That became intertwined” – from “All In Our Minds”On Passafire’s sixth studio release, Longshot, the Savannah, GA based rock outfit gives a testimony to following dreams, inspired by people, places, and experiences Passafire has shared since forming as a band. The group’s four members continue chasing their passion despite being told many times that “Making it as a musician is a long-shot,” a piece of advice that inspired this album and its title. Longshot takes its listeners through a full spectrum of emotions, telling stories of heartbreak, new beginnings, overcoming personal struggles, finding truths, discovering new places, and getting older, all weaved into Passafire’s genre-defying mix of reggae, hard rock, hip hop, and anything else that turns the group on musically.\n\nPassafire was formed in Savannah, GA, in 2003 by Ted Bowne and Nick Kubley, and have built a strong reputation within the U.S. reggae scene through relentless touring with fellow band members Mike DeGuzman and Will Kubley. Bowne doesn’t mind the grueling schedule and adds, “Touring is the best way to keep the buzz about the band going. What keeps it fun and exciting is the people we meet and places we get to see. We are in a new city every day so there’s always something to go see or do.” They continue to be a larger part of the U.S. reggae scene, even though musically they are often far apart from many of their peers in the genre, with a growing emphasis on alternative and progressive rock elements within their songs.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/44/42-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1554054"},{"venue":"Neighborhood Theatre","event":"OTEIL & FRIENDS - Fall Tour 2017","date":"11/04/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1539542-oteil-friends-fall-tour-charlotte/","desc":"OTEIL BURBRIDGE\nJAY LANE\nJOHN KADLECIK\nALFREDA GERALD\nMELVIN SEALS\nERIC KRASNO\nWEDDIE BRAIMAH\n\nTwo-time Grammy winning bassist Oteil Burbridge has been in the music business touring and recording for over three decades. His first step into the national spotlight came in 1991 when he became a founding member of the Aquarium Rescue Unit featuring Col. Bruce Hampton, a cult classic that has stood the test of time. That led to his membership in the classic rock group The Allman Brothers Band. Since 1997, his work with the band has earned him two Grammy nominations for best rock instrumental, in 2003 and in 2004. Over the years, Oteil has shared the stage with rock and blues legends such as Eric Clapton, Carlos Santana, Levon Helm, Taj Mahal, Buddy Guy, Pinetop Perkins, Hubert Sumlin, Billy Gibbons, Chuck Leavell, Bob Weir, Phil Lesh, Johnny Winter, Bonnie Raitt, Sheryl Crow and Trey Anastasio. In 2012, Oteil received a Grammy Lifetime Achievement Award for his 15 year contribution to the Allman Brothers Band as the longest running bassist in the band’s history.\n\nWhile touring and recording with the Allman Brothers over the years, Oteil still found time to collaborate with many other musicians. He formed his solo group, Oteil and the Peacemakers in 1998. From 1998 until 2007, the group toured extensively and released three albums. In 2001, Oteil joined Phish’s keyboardist Page McConnell and The Funky Meters’ drummer Russell Batiste to form Vida Blue. He also founded an improv based trio with Grateful Dead drummer Bill Kreutzmann and Max Creek guitarist Scott Murawski in 2008.\n\nOteil reunited on stage with his brother Kofi after ten years of touring separately when Derek Trucks and Susan Tedeschi formed the Tedeschi Trucks Band in late 2010, featuring the Burbridge brothers in the rhythm section. The 11-piece super group released their first record, Revelator, in 2011 which won a Grammy in February 2012. The Tedeschi Trucks Band played Eric Clapton’s iconic Crossroads Guitar Festival in 2011. Oteil’s original composition “Love Has Something Else to Say” was including in the DVD release and on their Grammy-winning debut album. The Tedeschi Trucks Band released their second album (and first live album) in 2012, titled “Everybody’s Talkin”.\n\nOver the years, Oteil has also recorded and shared the stage with jazz and jazz-rock fusion legends Herbie Hancock, Roy Haynes, Randy Brecker, John Scofield, Jerry Goodman, Bob Moses, Lenny White, Steve Smith, Bela Fleck, Jimmy Herring, Howard Levi, Victor Wooten and Branford Marsalis.\n\nGrateful Dead members Bob Weir, Bill Kreutzmann and Mickey Hart joined forces with John Mayer in 2015 to form “Dead & Company”, with Oteil on bass and Jeff Chimenti on keys. The band toured the US in the fall of 2015 and finished up the year with two shows at San Francisco’s Bill Graham Civic Auditorium and two shows at the Forum in Los Angeles for New Years Eve. Dead & Company’s 2016 summer tour featured a headlining spot at Bonnaroo Music Festival and stadium shows at Citi Field and Fenway Park. Dead & Company is set to tour the US in June 2017. \n\nOteil is also currently working on his fourth solo record, “Water In The Desert” in his home studio, Hidden Spirit Studios. He has assembled an all-star group of musicians for this record, including brother Kofi on keyboards and flute, Little John Roberts and Sean O’Rourke on drums, vocalists Alfreda Gerald and Mark Rivers, and producer David Ryan Harris. The record is expected to be released in 2017.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/86/82-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1539542"},{"venue":"Neighborhood Theatre","event":"JADE CICADA [Opening Act: Esseks]","date":"11/24/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1552587-jade-cicada-charlotte/","desc":"Jade is a material thought by the ancient Chinese to be crystalized moonlight that has fallen to earth to spread wisdom and peace. Cicadas symbolize rebirth, metamorphosis, and illumination, and with their dying breath sing with such power that their chorus of song is among the loudest in nature. Jade Cicada’s music is a reflection of these ideas, and a constant homage to those who have inspired him.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/18/36-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1552587"},{"venue":"Neighborhood Theatre","event":"DONNA THE BUFFALO","date":"01/27/2018","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1539540-donna-buffalo-charlotte/","desc":"One of the most dynamic and determined bands continuously touring America for since 1989, Donna the Buffalo has created a community environment at their shows through their distinctive, groove-heavy, and danceable music. Donna the Buffalo is a band for the people that is accessible, positive, and memorable.\n\nWith roots in old time fiddle music that evolved into a soulful electric American mix infused with elements of cajun/ zydeco, rock, folk, reggae, and country, Donna’s music often contains social and moral responsibility as core beliefs, and they are just simply fun to get out and celebrate life with.\n\nDonna the Buffalo drew its original inspiration from a cherished part of the American heritage: the old-time music festivals of the south that drew entire towns and counties together. Not only was it playing music at these events, it was the vibe and the togetherness that bonded the people that attended.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/87/15-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1539540"},{"venue":"Neighborhood Theatre","event":"MAYHEM - 'de Mysteriis Dom Sathanas' Tour [Opening Act: Immolation, Black Anvil]","date":"11/28/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1540434-mayhem-de-mysteriis-dom-charlotte/","desc":"Highly influential black metal band from Ski/Oslo, Norway. Founded in 1984 by Øystein Aarseth, Manheim and Jørn Stubberud.\n\nNotorious for, among other things, the shotgun suicide of singer Per Yngve Ohlin, the murder of Aarseth by Varg Vikernes, and a string of church arsons for which Vikernes was convicted.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/06/77-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1540434"},{"venue":"Neighborhood Theatre","event":"BETWEEN THE BURIED AND ME - Colors 10 Year Anniversary Tour [Opening Act: The Contortionist, Polyphia, Toothgrinder]","date":"10/22/2017","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1517227-between-buried-me-colors-charlotte/","desc":"American progressive metal band from Raleigh, North Carolina founded in 2001.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/54/96/40-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1517227"},{"venue":"Neighborhood Theatre","event":"THE DUSTBOWL REVIVAL","date":"11/15/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1538129-dustbowl-revival-charlotte/","desc":"The Dustbowl Revival is an Americana and Soul band with eight full-time members who mash the sounds of New Orleans funk, bluegrass, soul, pre-war blues, and roots music, into a genre-hopping, time-bending dance party that coaxes new fire out of familiar coal.  The band was founded in 2008 in the bohemian enclave of Venice Beach, California.\n\nDustbowl just recorded their fourth studio album with Grammy Award winning producer (Old Crow Medicine Show, Dropkick Murphy’s) and Flogging Molly founding member Ted Hutt, to come out on Signature Sounds this summer. While the band launched with an old-time style and deeper bluegrass roots (a fateful Craigslist ad got it all started), they recently departed toward a more modern soul sound, still with their mixture of New Orleans swing, Americana, a little blues, and roots-rock. The soul-dipped first single of their new collaboration, came out on a 45 with a music video in the end of 2016, with a premiere via Relix Magazine.\n\nOver the last five years Dustbowl has become known for their free-flowing and joyous live shows, combining their funk rhythm and brass section with a fast-picking string band section – opening for bands as diverse as Lake Street Dive, Trombone Shorty and The Preservation Hall Jazz Band, touring China as a guest of the state department and headlining festivals like Delfest, Floydfest, Hardly Strictly Bluegrass, and recently Bergenfest (Norway) and Tonder Festival (Denmark). The band received a big wave of attention with their music video that featured famous actor Dick Van Dyke for “Never Had to Go”, which garnered over 10 million cumulative views.\n\nA new album drops this summer and Dustbowl is ready to bring their newest sound – the place where funk and folk meet – to a bigger audience.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/56/67-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1538129"},{"venue":"Neighborhood Theatre","event":"JOHN MARK MCMILLAN presents the 'Mercury & Lightning Tour' [Opening Act: The Brilliance, LaPeer]","date":"11/18/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1523798-john-mark-mcmillan-mercury-charlotte/","desc":"JOHN MARK MCMILLAN is something of an anomaly: an artist and Platinum-selling songwriter bending genres and defying categorization by carving out his own unique and independent path. With an ear for melody and a poet’s eye for metaphor, no topic has been off-limits. While each of his albums over the past decade have continued to explore new territory, it’s McMillan’s ability to give lyric and language to the human experience that many consider his greatest gift. Mercury & Lightning, the latest offering from McMillan, reminds us why we love great songwriters; The great ones find a way to put new words to private musings and desperate feelings until the songs themselves begin to live in our bones.\n\nThough the robust 14-song album doesn’t release until Sept 1, the iTunes pre-order launches July 21 with four instant grat tracks including the title track “Mercury & Lightning,” “Wilderlove,” “No Country,” and “Enemy, love.” The vibe and tone from each track will mesmerize but it’s McMillan’s voice that draws you in and makes you feel as though you’ve pulled up a chair to one of those conversations you want to stick around for. The entire album was recorded just outside of Portland, OR at Feng Sway Studios over 18 months with close friend Gabriel Wilson and long time bandmate Jesse Proctor. Their collaboration produced the kind of record that your kid usually discovers before you do - something progressive yet accessible. Borrowing from their childhood influences, McMillan, Wilson and Proctor bring elements of 80’s rock and 90’s R&B together, somehow making the record feel both modern and unexpected.\n\nThe album title was pulled from Roman mythology. “Mercury is the god of financial gain, commerce, communication, travelers, boundaries, luck, trickery and thieves”, says McMillan. “If something is hard to catch, understand or lock down, it's known to be ‘mercurial’ or ‘like Mercury.’ The story of the new record begins with a conversation about all the things we run after, give our lives to - even die for - that often seem so mercurial and mysterious.” And John Mark would know; This being his 7th studio album, each new record seems to reveal a man chasing a new set of questions we should have been asking ourselves all along. On the heels of releasing his single “No Country” the week before the presidential election, John Mark said, “There was a point when I was afraid to finish this song. I abandoned it multiple times asking myself, ‘How many people really want to hear a white guy singing about being marginalized?’ Sure, I know how it feels to be lonely and misunderstood, but I’ve certainly never been discriminated against. I’ve never been asked and certainly not forced to vacate the luxuries and safety of my middle class suburban situation. So, what am I even singing about? Refugees? Sure. Racism? Yes. Immigration? Sure. Politics? Maybe. Relationships? Aging? Yes and yes. But ultimately I think that the song is summed up in one line: ‘Do you see me?’ It’s the cry of all of us - to be known.”\n\nMcMillan is no stranger to success with nearly half a million monthly listeners on Spotify and 40 million Spotify streams, but he won’t let those things define him. John Mark says he’s learned a lot about himself since his previous studio album Borderland, which held a Top 15 spot on the iTunes Albums chart and No. 41 on Billboard’s Top 200. When talking about his life and career McMillan says, “I’ve found that there’s a profound restlessness in the gap between the ideals of youth and the realities of adulthood - even when, especially when, you get what you wanted.”\n\nIt’s this level of honesty and wrestling with where he is during this season of his career and life that compelled McMillan to open up about his struggle with anxiety. “I try to control my world and since that is supremely not possible,” says McMillan, “I get anxiety. I promised myself when I got married that I wouldn't miss a moment with my exquisite china-doll girl, but...I get anxiety. Then we had kids and I swore I wouldn’t let go of a precious second of their lives. They’re such wild birds, and their raucous life and energy bring me outrageous amounts of joy, but also...anxiety. My attempts to control the universe only creates enemies. Enemies with the world, enemies with the ones I love, and I find myself at odds with God and with myself - in trying so hard to have it all the way I want it, I become my own worst enemy. ‘Enemy, love.’, like much of the new record, is about growing up - especially the ‘letting go’ part of growing up. There are just things I can’t know, I can’t hold, and I can’t control. Not to be irresponsible or dismissive, but I’m realizing when I ‘let go’ of my ideals and ego, I also become much better at holding onto what I actually have.”\n\nIn 2015, McMillan, who has made a career of rejecting easy categorization and challenging expectations, co-founded the independent record label Lionhawk Records with his manager Josh Lujan Loveless. Mercury & Lightning stands to be the third album release from Lionhawk Records with additional releases in the works.\n\nOver the past year, John Mark joined NEEDTOBREATHE’s Tour De Compadres with Mat Kearney and Welshly Arms and co-headlined The Revelators Tour with Josh Garrels. This year McMillan plans to hit the road again on a three-month US headlining tour kicking off in September in support of the new album.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/95/63-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1523798"},{"venue":"Neighborhood Theatre","event":"RECKLESS KELLY [Opening Act: The Trongone Band]","date":"11/03/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1543656-reckless-kelly-charlotte/","desc":"Understanding the virtuosity of Reckless Kelly requires the perspective of where the band has been. Cody and Willy Braun grew up in the White Cloud Mountains of Idaho. They moved to Bend, Oregon, and then migrated to that great musical fountainhead, Austin, Texas.\n\nThe band’s co-founders and frontmen toured the country as part of their father’s band, Muzzie Braun and the Boys, as children. They performed on The Tonight Show twice. Their father taught his four sons a professional ethic – integrity, persistence, hard work and professionalism – honed over three generations. They overcame hardships, struggled for recognition, and learned the lessons of the trial and error that defined them.\n\nIn one sense, it’s remarkable in the way of any musician, athlete, or businessperson who bucks the odds.\n\nIn another, though, it’s utterly natural that Reckless Kelly, born in the dreams of the two Braun brothers and their heritage but nurtured in the bumpy road of maturity, became the very essence of Americana music in all its far-flung glory.\n\n“We came along in that second wave of the movement,” Cody Braun says. “Son Volt’s album Trace had a major effect on us. People like Joe Ely, Ray Kennedy and Robert Earl Keen were always big supporters. Our goal was to make music that had a country vibe but a solid rock edge.”\n\nIn the end, all the recipe required was to just add water. Water facilitates life. It enriches the soul.\n\nAs Music Row magazine proclaimed, “In my perfect world, this is what country radio would sound like.”\n\n“This” is Reckless Kelly. \n\nThe heartland gave the band authenticity. Musical lives honed its skill. Adversity instilled its persistence. Moving to Austin gave it wings to fly.\n\nAs kids, the Brauns – Cody, Willy, Micky and Gary – shared a stage with the likes of Johnny Cash, Glen Campbell and Merle Haggard. Micky and Gary Braun now helm their own band, Micky and the Motorcars. In Bend, Cody and Willy added drummer Jay Nazz, who brought with him his own unique experience.\n\n“I had grown up in the Northeast, performing at clubs and weddings with my dad and brother from the age of 13,” Nazz recalls, “so, when I met Willy and Cody, we already had that in common. Both of our dads were musicians with a very similar kind of performing discipline. That helped us bond immediately.”\n\n￼The band took its name from the legend of Ned Kelly, the Australian highwayman, and the three moved to Austin in the autumn of 1996, where they carved a niche of their own. Early on, Keen, a Texas legend himself, took them under his wing and became their first manager. They listened, watched and interacted with the creative dynamos of the outlaw country scene – Townes Van Zandt, Steve Earle, Billy Joe Shaver, Guy Clark and others – and joined them in a redefinition of what contemporary country music had become. Theirs was gritty, hard-edged, uncompromising and convincing. They turned country music real again.\n\nWilly Braun wrote half the songs of Millican, 1998’s self-released debut, in an abandoned school bus, where he had lived for six months in Bend. The effect of that album was to emblazon Reckless Kelly with a reputation as a band of no-nonsense insurgents that could raise the rafters while still retaining a heart and soul of honesty, soul and conviction.\n\nThey evolved, adding David Abetya, a graduate of the Berklee School of Music, on lead guitar in 2000. Kansas-bred bassist Joe Miller — who had grown up on a family farm before becoming a broadcaster at his college radio station and migrating to Austin – signed on 2012.\n\nReckless Kelly’s string of critically acclaimed albums – Under the Table and Above the Sun (2003), Wicked Twisted Road (2005), Bulletproof (2008), Somewhere in Time (2010), Grammy-nominated Good Luck & True Love (2011) and Grammy-winning Long Night Moon (2013) – set a standard of reliable excellence and commitment to an instinctive vision of Americana. No band exemplifies the broad genre better.\n\nIndependent? Oh, yeah. Doggedly so. Nothing demonstrates it more than the band’s path through a succession of prestigious record labels – Sugar Hill and Yep Roc, among them – en route to a label, No Big Deal, of their own.\n\nFor two decades, the band has toured coast to coast relentlessly. It has demonstrated its longevity in a world where trendy newcomers are proclaimed the Next Big Thing by spinning a couple pop hits. They disappear from the radar, doomed by the very fad that invented them. Not unlike the pioneers who preceded them on the western frontier where the Brauns were raised, they have forged their survival without compromise, combining hard work with a resolve that success is only satisfying when achieved by their own standards and definition.\n\nThe group’s new album, Sunset Motel, is, like all its predecessors, distinctive in its own way while true to form. Self-produced and recorded in Austin’s renowned Arlyn Studios (where Millican was made two decades ago) and mixed by Jim Scott (Rolling Stones, Dixie Chicks, Tom Petty, Sting, Roger Daltrey, Crowded House, et al.), it reflects Reckless Kelly’s attention to craft and continuity.\n\n​￼Twenty years since its founding, Reckless Kelly continues to fight for wider recognition, secure in the knowledge that fans, critics and contemporaries will continue to sing its praises.\n\nThe songs hit one emotional peak after another: the infectious “Volcano,” the urgent “One More One Last Time,” the desperate desire that comes full circle in “How Can You Love Him (You Don’t Even Like Him)” and the bittersweet title track. With steady guitar drive and a series of insistent choruses, they all ring with power and conviction that make Sunset Motel a breathtaking listening experience.\n\n“Willy wrote 30 or 40 songs for the new album and we cut about half of them,” Cody says. “We ended up using 13 of them, but there were still some good ones left on the cutting-room floor.”\n\nCody, Willy and Nazz have been constants since the beginning. Abeyta and Miller add their own wrinkles to a signature sound that remains intact. The populist following grows, but the band has also moved on to play in performing arts centers and listening rooms that provide more focused encounters.\n\n“We’re at the point where we’re not content to be categorized as simply a party band anymore,” Willy says. “We would like folks to really hear these songs, to be able to hear the lyrics and appreciate the musicianship that goes into the arrangements. Yes, we still want our audiences to have a good time, but we also want to show that this is a real band with a cohesive attitude and a muscular backbone, as well. We don’t want to be pigeonholed as simply a Texas-based, beer-drinking, rowdy bunch of party boys. There’s a lot more to it than that.”\n\n“This is a really good place to be,” Cody adds. “We’ve built a solid fan base, which gives us a nice safety net. At the same time, we can take things at a more leisurely pace because we can control our own destiny.”\n\nGreat bands know good music. They make it the way they like, confident that what they love, what excites them, will also gain traction with thousands and thousands, perhaps even millions, of passionate fans.\n\nReckless Kelly is, by the best possible definition, a great band.\n\nFreedom to pursue its own destiny has always been at the center of the band’s ambitions. Their fate is as much in their own hands as is reasonably possible.\n\n“We’ve toured extensively over the course of our career,” Cody says. “We’ve traveled front and back, up and down, across this country. Happily, we’re at a point where we’re not killing ourselves to pay the bills.”\n\nThat point liberates them to be true to their background, their heritage and, most importantly, themselves.\n\n￼“We’ve always been hands-on in terms of our marketing and our delivery,” Willy says. “The labels always gave us the freedom we asked for, but an A&R person doesn’t always know what’s best for the band.”\n\nThe fierce self-reliance and independent spirit keeps Reckless Kelly happy, appreciative and charitable. Their annual festival, The Braun Brothers Reunion, in Challis, Idaho, has been ongoing for 37 years now. They reunite with their brothers, Gary and Micky (and the Motorcars). The Brauns run it without major sponsors or outside promoters.\n\nThe band also hosts the yearly Reckless Kelly Celebrity Softball Jam to raise money for Austin-area youth charities, putting $300,000 in those coffers over the past seven years.\n\n“It’s a great way to give back,” Cody says. “It’s great to be able to share our success in such a positive way.”\n\nCollectively, they’ve played over 3,000 shows and traveled over 1,500,000 miles to 49 states.\n\nReckless Kelly is a great band with an apt name. The outlaw’s spirit pervades the ambiance. They are rugged individualists who dedicate themselves to advancing the state of their art.\n\nThey’re good guys, too. Their hearts dwell in the right places, and those are where the music follows.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/50/53/74-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1543656"},{"venue":"Neighborhood Theatre","event":"JUMP, LITTLE CHILDREN [Opening Act: Stop Light Observations, She Returns From War]","date":"10/20/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1518919-jump-little-children-charlotte/","desc":"JUMP BIO / WHERE ARE THEY NOW?\n\nThe band came together in their current lineup in 1994. Based out of Charleston, SC they toured regionally, nationally and internationally releasing 4 studio albums (The Licorice Tea Demos - 1995, Magazine - 1998, Vertigo - 2001, Between the Dim & the Dark - 2004), 2 EPs (Buzz - 1997, Between the Glow & the Light - 2005) 1 compilation of early material (The Early Years, Volume 1 - 2001) and a live double-album of their final performances (Live at the Dock Street Theatre - 2006). Known for their eclectic mix of musical influences from ethereal chamber pop to guitar driven alt-rock along with high-energy live shows, they built a grass-roots following of devoted fans across the country. After over a decade of touring and recording they announced an indefinite hiatus in 2005. Since then the members have focused their energy on pursuing new and exciting projects:\n\nJay Clifford\nJay released two solo records (Driving Blind - 2007, Silver Tomb for the Kingfisher - 2012) and founded his own studio, Hello Telescope, where he has produced records for artists such as Heather Nova and William Fitzsimmons. Jay has also collaborated with the Colorado Symphony orchestrating for artists like Ingrid Michaelson, Amos Lee and Ariel Pink for their Red Rocks concert series. \n\nWard Williams\nWard moved to New York City and has performed with various artists (Sara Bareilles, Alicia Witt, Vienna Teng, Brandi Carlisle among others).  \n\nMatthew and Evan Bivins\nThe Bivins Brothers' first post-Jump project was Cabaret Kiki, a neo-cabaret variety show with music. Kiki featured some of Charleston’s finest musicians (Bill Carson, Cary Ann Hearst, Nathan Koci, Ash Hopkins) along with dancers from Charleston Ballet Theater and many other talented writers, technicians and collaborators. \n\nThe Bivins then moved to Chicago, IL. Matt has been performing mostly as a stage actor with The House Theatre, City Lit Theater, Strawdog Theatre, Barter Theater of Virginia, and the Bughouse Theater.\n\nEvan has composed music for the Giordano Dance Company and performed and recorded with various artists (Duncan Sheik, Cary Ann Hearst, Rachel Ries, Mar Caribe, Grit & the Double Knit, Andy Wagner).\n\nJonathan Gray\nJohnny toured with various artists (Howie Day, William Fitzsimmons, Slow Runner, Cordovas, Post Cobra, Bill Carson, Josh Hoge, Crowfield) and has been teaching music to students of all ages at Hungry Monk in Charleston.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/06/55-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1518919"},{"venue":"Neighborhood Theatre","event":"THE LONE BELLOW [Opening Act: THE WILD REEDS]","date":"11/07/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1506240-lone-bellow-charlotte/","desc":"It’s been six years since The Lone Bellow was first formed by Zach Williams, multi-instrumentalist Kanene Donehey Pipkin and guitarist Brian Elmquist. But one only needs to get the lead singer and guitarist speaking to their songwriting process to witness firsthand just how passionate he remains about its teeming creativity. “It’s a beautiful process,” the effusive singer says of the almost epiphany-like manner in which the band typically translates its vivid ideas to melodies and lyrics. “You’re trying to figure out exactly what it is you’re trying to say. And then, ‘Bam! Lightning strikes, everybody’s in the room, and it’s like the heavens open. Suddenly you’re able to write a song.”\n \nThe Lone Bellow, which also now includes Jason Pipkin on keys/bass, has long nurtured a deep and highly personal connection with their music. But with Walk Into A Storm, their third studio album, due on September 15 via Descendant Records/ Sony Music Masterworks, the band turned inward like never before. “We covered such a broad range of emotion on the album,” Elmquist says of the raw, intimate and undeniably soulful Dave Cobb-produced LP recorded in Nashville’s famed RCA Studio A. The 10-track album, Elmquist says, is centered on “the human condition and how you’re trying to connect with it,” and with stunning tracks including “Is It Ever Gonna Be Easy?” and “Long Way To Go,” it features some of the band’s most poignant material to date.\n \nWhen creating the follow-up to 2014’s cherished Then Came The Morning, the band confronted — and ultimately overcame — a host of personal obstacles: not only did all the members and their respective families work through a relocation from New York City to Nashville, but on the day they were to begin recording the album Elmquist entered a rehab facility for issues stemming from alcohol abuse. “There’s a thousand different ways this could have gone down but it’s the way it did,” says Elmquist, says the tumultuous experience helped “put what we’re doing in perspective.” “I got to see the love and friendship we have for each other in action. I’m thankful.”\n \n“Our band was the receiver of a lot of grace and kindness from the music community,” Williams adds, citing peers and industry folks offering words of encouragement as well as the non-profit MusicCares greatly aiding in the costs of the guitarist’s treatment.\n \nElmquist’s situation presented a logistical challenge for the band — they now had nine days to record instead of the pre-planned 20. But as Pipkin notes, the sacrifice “paled in comparison to what we have with each other. Without our friendships we don’t have anything,” she says. “That’s the reason we do this. To forge ahead without taking care of each other doesn’t work. We wouldn’t be able to do what we do.”\n \n \nWorking with the notoriously no-nonsense Cobb (Chris Stapleton, Sturgill Simpson, Jason Isbell), was a richly rewarding process. It was also one that helped the band kick out the jams in short order. “There’s no real bells and whistles,” Elmquist recalls of Cobb’s no-frills recording process. “You go practice a song, play it, record it and put it on a record.”\n \nThe results are stunning: from the orchestral, uplifting “May You Be Well,” to “Long Way To Go,” a beatific piano-anchored ballad Elmquist wrote while in rehab; and “Between The Lines,” a harmony-drenched sing-along Williams says acts as both a letter to Elmquist and an exploration of the push-pull of drawing art from pain.\n \n“There’s this lie that the only good and worthy art that can be made has to come from tragedy and darkness,” Williams offers. “And I get it. But it doesn’t only have to come from that. It can also come from joy and gratitude.”\n \nAnd that’s exactly what The Lone Bellow is full of as they look to the future. The band kicks off an extensive tour on September 21st with Central Park’s Summerstage supporting The Head and the Heart. And as they crisscross North America they’ll have a new member in tow. “‘How early is too early to teach a child how to tune guitars?’” Pipkin, whose newborn son will be joining them on the road, asks with a laugh. “It’s going to be really exciting and different.”\n \nWilliams seems nothing short of in awe of where life has taken him and his band. The process that led to Storm, the forthcoming tour, the deepening of bonds with his band mates -- it all adds up to The Lone Bellow “becoming even more like family,” he says. “I just love being able to have that opportunity with these friends.\n \nThe singer pauses, and with a supreme sense of contentment in his voice, notes proudly of his band mates: “They’re pretty good musicians. But they’re truly amazing people.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/41/94-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1506240"},{"venue":"Neighborhood Theatre","event":"CAMPFIRE CARAVAN featuring Mipso, The Brothers Comatose & The Lil Smokies","date":"11/14/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1534612-campfire-caravan-mipso-charlotte/","desc":"Chapel Hill’s indie Americana quartet Mipso – Jacob Sharp (mandolin, vocals), Wood Robinson (bass, vocals), Joseph Terrell (guitar, vocals), and Libby Rodenbough (fiddle, vocals) – is influenced by the contradiction of its progressive home and the surrounding rural southern landscapes. Currently celebrating the release of its fourth album, Coming Down the Mountain (April 7, 2017), Mipso ventures further than ever from its string-band pedigree to discover a broader Americana where classic folk-rock and modern alt-country sounds mingle easily with Appalachian tradition. Adding pedal steel, drums, banjo, and keyboards to the intimate four-part harmonies and powerful acoustic meld, Mipso’s music is lush and forward moving, with lyrics that sear and salve in turn. Hailed as “hewing surprisingly close to gospel and folk while still sounding modern and secular” (Acoustic Guitar) and recently recognized by Rolling Stone as a favorite 2016 festival performance, Mipso brings a distinctly unique sound – full of wistful beauty, hopeful undercurrents, and panoramic soundscapes.\n \nMipso’s third album release, Old Time Reverie (2015), shot up the Billboard charts, landing at No. 1 on the Billboard Bluegrass Chart and in the Top 25 of the Billboard Heatseekers Chart. The album was named among the Best Records of the Year by The Guardian for the band’s “aptitude for stunning harmonies” and for its “lush and moving songs.” Mipso’s earlier albums were long, long, gone (2012) and Dark Holler Pop (2013).Whether traveling to gigs on horseback or by tour bus, Americana mavens The Brothers Comatose forge their own path with raucous West Coast renderings of traditional bluegrass, country and rock ‘n’ roll music. The five-piece string band is anything but a traditional acoustic outfit with their fierce musicianship and rowdy live shows reminiscent of stadium rock concerts. In fall 2017, “Campfire Caravan” featuring The Brothers Comatose, Mipso, and The Lil Smokies hosts three of today’s foremost emerging indie Americana bands as they trek across the United States to more than 30 cities. “Campfire Caravan” honors the musicians’ early days playing music, when they’d perform for friends and family in basements, living rooms, and around campfires. \n\n“Campfire Caravan” celebrates the American tradition of gathering communities around music.\n\nFollowing three critically acclaimed full-length studio albums (Songs From The Stoop, Respect The Van, City Painted Gold), the five-piece string band disrupts the traditional album cycle and focuses their 2017/2018 release schedule on a series of strategically\nreleased songs. On Sept. 8, 2017, The Brothers Comatose releases a sun-soaked new single “Don’t Make Me Get Up And Go” produced by indie-rock legend John Vanderslice. Channeling harmony vanguards The Beach Boys, “Don’t Make Me Get Up And Go” is a nod to the delicate dance between two friends and trusting fate to either bring them romantically together or not. With lyrics written by the band’s tour manager Joe Pacini, lead singer Ben Morrison lends his crooning baritone to the fast-paced, feel good song.\n\n“Going into the studio with Vanderslice was all about capturing the moment on analog tape,” says Ben. “We set out to record in a way we’ve never previously attempted. We did it live with all of us playing in the same room as if we were performing on stage.\nVanderslice really understood the sonic landscape we were going for. He’s really a super producer, being a musician who has cut a lot of records of his own and produced albums by many great artists.”\n\nThe Brothers Comatose entered Vanderslice’s Tiny Telephone (San Francisco) studio with drafts of “Don’t Make Me Get Up And Go.” After working out the verses and chorus in the studio, bassist Gio Benedetti came up with the three-part harmony bridge.\n\nVanderslice had the trio of Ben, his brother Alex Morrison, and Gio, head into the studio’s echo chamber with its five-second delay, and the boys did what they do best. They sang their hearts out, and the result is sublime.\n\nThe Brothers Comatose is comprised of brothers Ben Morrison (guitar, vocals) and Alex Morrison (banjo, vocals), Gio Benedetti (bass, vocals), Philip Brezina (violin), and Ryan Avellone (mandolin). When they’re not headlining The Fillmore for a sold-out\nshow or appearing at Hardly Strictly Bluegrass Festival, the band is out on the road performing across America, Canada, Australia, and hosting their very own music festival, Comatopia. In 2018, The Brothers Comatose will travel to Asia for a month of cultural music exchange and education with American Music Abroad, a program directed by the State Department.With their roots submerged in the thick buttery mud of traditional bluegrass, The Lil Smokies have sonically blossomed into a leading player in the progressive acoustic sphere, creating a new and wholly unique, melody driven sound of their own. The quintet, from Missoula, MT, has been hard at work, writing, touring and playing to an ever-growing fan base for the past 6 years. The fruits of their labor recently culminating with wins at the 2016 International Bluegrass Music Association (IBMA) Momentum Award for Best Band and at the 2015 Telluride Bluegrass festival band competition. In 2013 the band also won The Northwest String Summit Band Competition. With a unique blend of traditional bluegrass, newgrass, innumerable unique originals, sheer raw energy, and exquisite musicianship, The Lil Smokies weave seamlessly through genres, leaving behind melodies you’ll be singing to yourself for days and a jaw you’ll have to pick up off the floor.\n \nThe Lil Smokies have no problem captivating large audiences. Sharing the stage with heavyweights like Steve Martin and the Steep Canyon Rangers, The Nitty Gritty Dirt Band, Keller Williams, Greensky Bluegrass, The Emmit-Nershi Band, Yonder Mountain String Band, The Travellin’ McCourys, Sam Bush Band, Fruition, Infamous Stringdusters, Bradford Lee Folk and The Bluegrass Playboys, and dozens of others. The Lil Smokies have become festival favorites coast to coast with highlights including Delfest (MD), Pagosa Folk N’ Bluegrass (CO), ROMP Fest (KY), Hangtown Halloween (CA), Telluride Bluegrass Festival (CO), Roseberry Music Festival (ID), Northwest String Summit (OR), Targhee Bluegrass Festival (WY), River City Roots (MT) and more! This five-piece bluegrass ensemble features Andy Dunnigan (dobro), Scott Parker (upright bass), Matt Cornette (banjo), Jake Simpson (fiddle) and Matt Rieger (guitar).","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/02/34-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1534612"},{"venue":"Neighborhood Theatre","event":"BANDITOS [Opening Act: Amigo]","date":"10/11/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1506121-banditos-charlotte/","desc":"After spending much of the last two years on the road, relentlessly showcasing their critically acclaimed 2015 self-titled debut album, the six bandmates of Banditos regrouped in late 2016 at Plum Creek Sound Studios in Dripping Springs, TX and democratically poured out sonic influences and emotionally charged personal experiences for their new album Visionland.\n\nProduced by Israel Nash and Ted Young, the Birmingham/Nashville-based group’s second full-length has one foot firmly planted in reality as the other tip-toes in and out of mental complexities, self-perception and altered-state illusions. The results are revealing, exhilarating and profound.\n\nThe album-titled track reveals these defining, cohesive thematic intricacies. “Visionland” is named after the defunct $60 million theme park that was built in the late ‘90s near some of the band members’ childhood homes in Bessemer, Alabama. The park was shut down after only five years and the schizophrenic glimmer of hope it offered local residents connects to a greater overlying optimism for life present at the album’s core, an eerily relevant theme in contemporary complex times. Jeff Salter’s sweeping guitar strums swell at the song’s intro, lifting through the murky haze into the warm and sunny clarity of a duet between singer Mary Beth Richardson and singer/guitarist Corey Parsons.\n\n“Strange Heart” rides to new 13th Floor Elevators psychedelic heights, with Richardson’s scorching, raw, show-stopping voice echoing Merry Clayton’s chilling performance on The Stones’ “Gimme Shelter.” Later in the album, singer/banjo player Steve Pierce channels the ebullient folk of electric Dylan with his free & easy flow on “Fun All Night.” The band also brought in the outside artistic talents of storied keys player Earl Poole Ball, upon a chance interaction they had after seeing him play with Ramsay Midwood at Sam’s Town Point in Austin, TX. Ball has performed and collaborated with The Byrds, Johnny Cash, Buck Owens, Gram Parsons, Merle Haggard, and many other greats.\n\nThere is a shared mindset throughout; a persevering glint of what could be, a distorted possibility, struck by a frigid gust of reality. Like some sort of modern day, Southern-born The Band, some songs were written over years by a single member (the surfy jam “Lonely Boy,” which was written by singer/guitarist Parsons in response to being tour weary), others by a combination of the players (the punk-garage soul Stooges-meets-Velvet Underground churner “Fine Fine Day” was penned when Parsons and Pierce drank massive amounts of vodka one day in Opelika, Alabama) and the dynamics show for it. There’s a phantasm of vintage ‘60s Etta James soul (plus burning-hot background singers) on “Healin’ Slow” and, later, the hopping country blues of “DDT.” Topics and styles range this way on Visionland - the heavy and emotional to the light and simplistic - but the Banditos always sound like themselves and always drive the nail deep into the groove.\n\nThe members of Banditos first met playing in various punk and rock ‘n’ roll projects around Birmingham at D.I.Y., all-ages venues. In 2010, Parsons and Pierce began busking around town and were soon asked to perform at their favorite local bar. Without a full band, they invited friends Randy Wade (drums), Salter (guitar), and Richardson to join them. Danny Vines (bass) joined the band later.\n\nThe group has been praised by NPR (“Three vocalists, a wicked guitarist...a banjo, an upright bass and a hot-footed drummer guarantee that every song they play is stuffed with crazy rhythms and melodic energy.”), Rolling Stone (“Equal parts alt-country twang and garage rock bang...recalling everything from ZZ Top’s greasy boogie to the Alabama Shakes’ coed soul”), and Garden & Gun (“These six keyed-up twentysomethings mix a hodgepodge of sounds. Sometimes it’s barroom country backed by a rogue kazoo, and other times it’s a chicken-picking version of slow-burning soul behind the Janis Joplin–esque wail of Mary Beth Richardson”). They have performed across the world supporting acts like St. Paul and the Broken Bones, Blackberry Smoke, and Old 97’s, and notably at prominent events like Newport Folk Festival, Hangout Fest, and Rachael Ray’s Feedback.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/67/09/73-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1506121"},{"venue":"Neighborhood Theatre","event":"BEN SOLLEE & KENTUCKY NATIVE","date":"09/08/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1520585-ben-sollee-kentucky-native-charlotte/","desc":"Ten years ago Kentucky native Ben Sollee came to prominence singing Sam Cooke while playing the cello. The NPR sensation was not a backwoods novelty. Sollee's spare, exultant interpretation of “A Change is Gonna Come” announced the arrival of a relentlessly curious musical soul for whom change constantly comes.\n\nIn the decade following Sollee has recorded roughly an album a year (and nearly that many EPs), in a daunting variety of settings. He has played with trance bluesman Otis Taylor, with banjo virtuosos Abigail Washburn and Bela Fleck (in the Sparrow Quartet, with Casey Driessen), and collaborated with Jim James of My Morning Jacket, with DJs, acoustic musicians, visual artists, software specialists and environmentalists. He has composed ballets and music for films and for stage. He has helped raise his son and support his family with an ambitious tour schedule. He has cycled 5,000 miles by bike, towing his cello “Kay” behind him as part of the “Ditch The Van” tours.\n\nHe has relentlessly made and studied and thought about art and the environment. And life, and how to make the world around him better.\n\nSollee describes his newest release, Ben Sollee and Kentucky Native (the name describing both the ensemble and the album) as a bluegrass record, fully aware that his is not the traditional view. “Bluegrass music is immigrant music,” he says, offering his expansive definition across the kitchen table. “It's the music of Irish and Scottish musicians bringing their fiddle tunes; it is gospel music; it is African music; it is gypsy jazz; it is rock 'n' roll. It is all these things. What makes it unique and of Kentucky is that it was distilled by the people who lived here in Kentucky, and turned into something else.”\n\nTurned into songs that ache and sing and soar.\n\nSollee convened his new ensemble in a cabin deep within the Bernheim Arboretum & Research Forest, south of Louisville. “We cooked for each other and we drank bourbon with each other and we wrote this music together. So it's kind of in and of a place.”\n\nThe band once again includes Sollee's long-time friend and collaborator (see: their 2016 release, Infowars) Jordon Ellis on percussion. “He's playing the quietest percussion you could ever imagine,” Sollee says, “but it still sounds really tight and huge. That was kind of inspired by the Tinariwen records.”\n\nThe rest of the Kentucky Natives are new to Sollee. Violin and fiddle are courtesy Julian Pinelli, a recent Berkeley graduate. (“Gosh, he's a big old tall lanky feller, and real quiet, but he plays the fiddle just crazy slinky and beautiful. He can also perk up and rock that classical technique as well.”) Banjo is handled by Bennett Sullivan, fresh off a stint on Broadway in Steve Martin's “Bright Star.” (“In my opinion, he's one of the great young banjo players, from the standpoint of his ability to play bebop jazz or slip into really classic Earl Scruggs-style picking.”) Bass duties were split between Jonathan Estes and Josh Hari, with Jona Smith on backing vocals.\n\n“I wanted to make a record that was just humans, sitting in a room, playing instruments of wood and metal,” Sollee says. “That's all it is. There's no over-dubs. Sorry, that's not true. I overdubbed a couple of my vocals. It is just what we played in the living room sitting around microphones. And oftentime we'd\n\nstart in on an idea, and then before we could move to our microphones, the engineer, Alex [Krispin], would just place the mics around us. And that was part of his process, too. He really captured the spontaneity of creation.”\n\nThe songs on Kentucky Native also beautifully capture Sollee's evolving approach to the issues which sometimes frame his work. “I used to be very message forward in my music,” he says. “Over time, you go out and play shows and talk to people from all different walks of life and you stay with them in their houses and you have food with them. After a while, if you're listening, it's hard to maintain any type of stringent devout belief that this is right and this is wrong. And so in that messiness I thought, hmm, maybe my message shouldn't be about issues, it should be about people.”\n\n“This new record focuses much more maybe simply. It focuses on the idea that humans are all trying to figure it out, and they're all struggling in different ways. We have songs about working people, truck drivers travelling around trying to figure out the pace of life and how fix the future. Realizing that there is no fixing the future, it's just a path that we're all on. And you've got songs about tugboats and their operators, songs about well-worn men and two-tone gals. I think it's much more compelling to focus in on a human, this two-tone gal, who is struggling with the disease that is addiction and taking a little John Priney humor and sprinkling it over the top.”\n\nThe second track, “Presence,” is as close to political as Kentucky Native gets. “It opens with me laying at the bottom of a pool, which is one of my favorite things to do because, as a musician, quiet is something that I rarely come by,” Sollee says. “That's a really relaxing place to be, because you can't control anything, and it's quiet. But you can't hold your breath all the time. You just can't stay there. Then [the song] launches out into the world and eventually we meet this character — the future — who you look to for answers. But then you realize, shit, they're blind. So all you've got is the presence of where you are.”\n\nAt the center of Kentucky Native rests the exquisitely simple “Pieces of You,” an homage to Lexington artist Louis Bickett, who has spent his adult life collecting and tagging the ephemera of existence. The work is called, simply, “The Archive.” “It is a collection of objects — things,” Sollee explains. “Books, teddy bears, dirt from places he's visited, jars of water and trash from different places, the underwear of old lovers, everything. And it's all carefully cataloged and displayed in his home. It's really overwhelming to go visit, because it's basically all these touchpoints of living on earth.”\n\nBickett was diagnosed with ALS during the summer of 2016, which led Sollee to return to “this little kernel of a song that I had sketched out on the road, this 'Pieces of You' song, that I had sketched out at the Cathedral of Junk in South Austin, Texas.”\n\nThe insatiable curiosity of an inveterate wanderer, of a close observer. Take the new song, “Mechanical Advantage,” built from simply watching a young woman cross the street. Only the song itself is rather more complex. “It's just super-duper fun to sing because it's in this Mexican huapango groove,” Sollee says, singing a bit by way of explanation, “this music of Central Mexico that I love so much. It's very different, groove-wise, than anything that we play in America, even though it feels very fiddly, and very Appalachian to me. And it should. It's kind of mountain string music.”\n\nAnd then he talks about Lauryn Hill, Paul Simon, and Nina Simone, “this continual path to try to get to where some of my favorite artists are.”\n\nWhich is why Ben Sollee is serious about his interpretation of bluegrass. “What does bluegrass music sound like today if we continue to include cultures that live here? I'm trying to continue the actual act of what bluegrass music was and is, rather than maintaining a tradition. Adding a node to the tradition.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/28/73-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1520585"},{"venue":"Neighborhood Theatre","event":"TIME SAWYER","date":"11/11/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1553120-time-sawyer-charlotte/","desc":"Time Sawyer is interested in “real people and real songs” and that’s just what the listener finds in their music – a sense of realness. Time Sawyer blends a grassroots feel with heart-felt lyrics to put on an entertaining show. From introspective ballads to high-energy crowd-pleasers, Time Sawyer’s songs land in that rootsy sweet spot where folk, alt-country, and rock gather for a good time.\n\nThe folk rock band’s name reflects the pull between the past and the future. The character Tom Sawyer evokes the rural background and love of home that lead vocalist/guitarist Sam Tayloe and vocalist/banjo player Houston Norris, share. Time is a muse for songwriting; it’s the thread that runs through life, bringing new experiences and giving us a sense of urgency, while still connecting us with our past.\n\nTime Sawyer has performed on the stages of some of the Southeast’s most iconic festivals, including Merlefest, Floydfest, Bristol Rhythm and Roots Reunion, Rhythm n’ Blooms, Carolina in the Fall and IBMA’s Bluegrass First Class. They’ve shared bills with Langhorne Slim, Phil Cook, Steep Canyon Rangers, The Wood Brothers, Joe Pug, Holy Ghost Tent Revival, and many more. \n\nThe band’s original members, including guitarist Kurt Layell and drummer Clay Stirewalt, along with Tayloe and Norris, started performing and recording together while they were all students at University of North Carolina at Charlotte. They went on to record five albums together, each demonstrating growth, with more skillful instrumentation and more sophisticated arrangement, all while retaining the honesty and directness that has been a hallmark of their music from the start.\n\nToday Time Sawyer is Sam Tayloe and Houston Norris, who are joined by some of the region’s most talented instrumentalists, allowing the band the flexibility to perform as an acoustic duo, a six-piece band, or anything in between.\n\nThe memorable lyrics and strong melodies result in songs that will stay in your head long after the music stops. Time Sawyer continues to develop a loyal and growing fan base. Whether they’re playing in an intimate listening room or a large outdoor festival, their goal is to forge a face-to-face connection with the audience so that they become friends who happen to be fans.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/21/58-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1553120"},{"venue":"Neighborhood Theatre","event":"RUNAWAY GIN - A TRIBUTE TO PHISH","date":"11/10/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1528001-runaway-gin-tribute-phish-charlotte/","desc":"With over 245 shows performed since their inception in 2014, Runaway Gin is the World's Most Active Phish Tribute Band. On July 4th, 2015, after the second show of the Grateful Dead GD50 run, Runaway Gin sold out the Hard Rock Cafe in Chicago and catapulting them from a Southeastern regional act onto the National scene.\n\nThe members of Runaway Gin are long time Phish fans who have united with the goal of creating musical moments inspired by Phish. The band's song list is constantly growing and their improvisational and communication skills are constantly developing independently and together. Like Phish, Runaway Gin will never play the same show or jam the same way twice making every show a unique experience and every moment pure artistic creation.\n\nANDY GREENBERG - GUITAR, VOCALS\n\nOriginally from Florence, SC, Andy began playing piano at the age of 5, receiving classical instruction and earning top ratings in the National Piano Guild. At the age of 12 he learned his first chord on the guitar and taught himself to play by ear. Andy started listening to Phish while at summer camp. The first song he heard was \"Sparkle\" and it reminded him of one of his favorite bands at that time: They Might Be Giants. He proceeded to dive head first into the album Rift and soon Phish's whole catalog often stopping to figure out songs on both piano and guitar to satisfy his vehement musical curiosity.  Eventually Phish would ride to the top of Andy's list of favorite bands a spot reserved for the likes of the Beatles and Led Zeppelin.\n\nThroughout High School Andy played guitar in the West Florence Jazz Knights, and founded his first Rock and Jazz bands at the age of 14. While a Jazz and Classical guitar student at Tulane University in New Orleans, LA Andy co-founded Dimorphodon (an original funk-rock-jam project) as well as Mr. Hand and the Spicolis (an 80's Tribute Band). In 2005 Andy moved to Charleston, SC and co-founded many groups such as the Solar Circus, the Fifth of Four, the Thrillers (a Tribute to Micheal Jackson), the Buddhist Prodigies (a Tribute to Phish), Mr. Holland's Oats (a Tribute to Hall and Oates), Beck to the Future (a Tribute to Beck) and played with Dave Seitz and King Street Band for many years. Over the years Andy has shared the stage with and collaborated with many bands and musicians including: Tom Marshall, Pink Talking Fish, Phix, A Live One, Elise Testone, Garaj Mahal, Machine Funk, the Motet, Psychedelic Breakfast, Atlas Road Crew, Dan Caro, Derrick Freeman, Stockton Helbing, Dr. Jimbo Walsh, Mark Bryant, Rodrick Cliche (D'Angelo), Josh Roberts and the Hinges, and many more.\n\nAndy's first Phish show was:\n\nSaturday, 11/18/1995 -North Charleston Coliseum, North Charleston, SC\n\nSet 1: Dinner and a Movie > Bouncing Around the Room > Reba, Lawn Boy, Punch You In the Eye > Slave to the Traffic Light, I'm Blue, I'm Lonesome[1], Sample in a Jar\nSet 2: AC/DC Bag > Sparkle > Free, I'm So Tired, You Enjoy Myself, Contact > Big Black Furry Creature from Mars, Acoustic Army, Big Black Furry Creature from Mars, Cavern\nEncore: Bill Bailey, Won't You Please Come Home?[2]\n\n[1] Acoustic.\n[2] Dr. Jack McConnell on vocals.\n\nTeases:\n· Brick House jam in You Enjoy Myself\nSince 1995 Andy has been to well over 100 shows. What Andy has learned from playing Phish : always listen first and foremost - relax and surrender to the flow. There's always a bigger Phish!\n\nBOBBY HOGG - BASS, VOCALS\n\nBobby first discovered Phish as a tween in the mid 90's when he stumbled across a tape of 4/16/92 Anaconda Theater in his big sister's music collection. This exotic music was rather foreign to his underdeveloped ear, and seemed absurdly quirky at first taste. Upon playing the tape for his little brother, the two decided that they did in fact enjoy the sounds emanating from their tape deck, and were eager for more. It is safe to say that over the next few years Bobby suffered irreversible ear damage whilst donning his headphones and cranking his Sony Walkman to full volume, rocking out to the music of Phish late into the night. www.bobbyhoggmusic.com\n\nBobby's first show was:\n\n12/30/1996 - FleetCenter, Boston, MA\nSet 1: Ya Mar, The Sloth, Llama, Gumbo, Reba[1], Talk[2], Funky Bitch[3], Theme From the Bottom > Good Times Bad Times\nSet 2: Timber (Jerry) > Uncle Pen, AC/DC Bag, Guyute, Tweezer -> Lifeboy > Scent of a Mule[4], Slave to the Traffic Light\nEncore: Possum\n\n[1] No whistling.\n[2] Trey on acoustic guitar.\n[3] P.A. cut out.\n[4] Page/Mike Mule Duel and Steven Wright ringing a desk bell three times.\n\nSince that show Bobby has seen Phish around 50 times, and is eagerly anticipating many more shows to come!\n\nJOHN FITZGERALD - KEYBOARDS, VOCALS\n\nJohn began his musical career at the age of fifteen playing shows in local Jersey Shore venues as a solo artist and with a variety of musical acts. He went on to earn his Bachelor's of Music from James Madison University. John moved to Charleston SC and found himself a part of the nationally known and highly respected Charleston music community. “I started working with a number of touring bands and recording projects. I played everything from Grateful Dead tributes (Cosmic Charlie), Funk (The Secrets), and even some Bluegrass (Acoustic Syndicate).\n\nJohn focuses on the continual development of the craft and pursuit of his musical vision. “Creating music is the catalyst for conjuring emotion. It is paramount. Music has the ability to tweak emotions and take a listener to other realms. Connecting emotionally via music is what it is all about.”\n\nJohn got a Harpua his first show!\n\n06/23/1995 - Waterloo Village, Stanhope, NJ\nSet 1: Simple > Chalk Dust Torture, Prince Caspian, Reba[1], Ginseng Sullivan > Free > Taste, You Enjoy Myself\nSet 2: Runaway Jim -> The Lizards, The Wedge, Run Like an Antelope, Harpua[2] -> Jam[3] -> Llama[3], Good Times Bad Times[3]\nEncore: A Day in the Life\n\n[1] No whistling.\n[2] Unfinished; with verse of Abba's Waterloo.\n[3] John Popper on harmonica.\n\nTeases:\n· Waterloo verse in Harpua\n\nJOHN POPE - DRUMS, VOCALS\n\nJohn Pope is an American drummer from Charleston, South Carolina. He began playing drums at age 9, taking lessons from a local music shop and listening to drummers like Dave Grohl and Chad Smith for inspiration. Around the age of 13, he became interested in improvisational music and was drawn to the likes of Phish, John Scofield, and Medeski Martin & Wood, among others. John attended his first Phish show at age 14 in Greensboro, NC, where phish closed with an epic First Tube > YEM:\n\n\n3/1/2003 -Greensboro Colosseum, Greensboro, NC\nSet 1: Chalk Dust Torture, The Moma Dance, Foam, Lawn Boy, Character Zero > Divided Sky, Mountains in the Mist, Waves > Sample in a Jar\nSet 2: Rock and Roll > Wilson > Piper > Also Sprach Zarathustra > Wolfman's Brother -> Boogie On Reggae Woman, Wading in the Velvet Sea > Run Like an Antelope, Carolina\nEncore: First Tube > You Enjoy Myself -> Proud Mary[1]\n[1] a cappella.\n\nTeases:\n· Oye Como Va and Another One Bites the Dust teases in Piper\n· Oye Como Va and Daniel Saw the Stone teases in You Enjoy Myself\n\nThroughout high school and college, Pope studied jazz on his own time, largely self-taught. At age 19, he started playing in bars in Charleston, SC. By age 22, Pope was playing in multiple touring bands, most notably Old You, a Charleston-based psychedelic rock / jazz group.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/36/98/07-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1528001"},{"venue":"Neighborhood Theatre","event":"LOS LOBOS [Opening Act: Sam Lewis]","date":"10/19/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1520565-los-lobos-charlotte/","desc":"“We’re a Mexican American band, and no word describes America like immigrant. Most of us are children of immigrants, so it’s perhaps natural that the songs we create celebrate America in this way.” So says Louie Perez, the “poet laureate” and primary wordsmith of Los Lobos, when describing the songs on the band’s new album, Gates of Gold. \n\nThe stories on Gates of Gold are snapshots of experiences that Perez and his band mates have had, based on where they are emotionally and how they respond to evolving life circumstances. “We live out loud most of the time and share our life this way, but then there are more intrinsic things that happen, and our songs are part of the way we react to them.  We sit down and basically tell people what has happened. We certainly didn’t start this project with aspirations to create the musical equivalent to great American literary works.”\n\nAfter celebrating their 40th anniversary with the cleverly titled 2013 live album Disconnected In New York City, the hard working, constantly touring band – David Hidalgo, Louie Perez, Cesar Rosas, Conrad Lozano and Steve Berlin – leaps headfirst into their fifth decade with an invitation to join them as they open fresh and exciting new Gates of Gold, their first full length studio album since 2010’s Tin Can Trust (a Grammy nominee for Best Americana Album) and second with Savoy/429 Records. \n\nThe dynamic songwriting, deeply poetic lyrics, thoughtful romantic and spiritual themes and eclectic blend of styles on the 11 track collection has resulted in an American saga in the rich literary tradition of legendary authors John Steinbeck and William Faulkner.  Yet true to form, these typically humble musical wolves started in on the project without any grand vision or musical roadmap. Over 30 years after Los Lobos’ major label breakthrough How Will The Wolf Survive? - their 1984 album that ranks #30 on Rolling Stones list of the 100 greatest albums of the 1980s – their main challenge when they get off the road and head back into the studio is, as Berlin says, “trying not to do stuff we’ve already done. To a certain extent, we are always drawing from the same multi-faceted paint box, and we sound like what we sound like. We’re proud of what we feel is an honest body of work. We just want to keep finding new ways to say things.”\n\nIn the band’s early recording days - those years just before and after “La Bamba,” their worldwide crossover hit from the 1987 film which reached #1 on the U.S. and UK singles chart - they prepared for album recording sessions with top producers like T-Bone Burnett   with pre-production that included multiple rehearsals and “outlining” what the project was going to be. The more spontaneous approach to writing and recording that they took on their 1992 Mitchell Froom co-produced set Kiko still exists today; Rosas says, “When I listen to our catalog, doing things more spontaneously in the studio has led to some of our best work.” Unlike many bands that write, gather and catalog material between studio releases, Los Lobos prefers to create their magic on the fly when they decide it’s time to record. Perez says, “We never come in with a cache of 20 songs. Our thing is to write as we’re recording. It’s like starting with a blank canvass every time.”\n\nThe journey to Gates of Gold began with Hidalgo bringing in a batch of ideas, outlines and chord progressions with no lyrics. As he and Perez began fleshing things out, developing grooves, melodies and lyrical themes, Hidalgo, his son, drummer David, Jr. and bassist Lozano began tracking those tunes. The collection opens with the reflective, mid-tempo  rocker “Made To Break Your Heart,” featuring female vocalist Syd Straw, whose vibe was partially inspired by Hidalgo’s love for Manassas, the early 70s blues-country-rock band created by Stephen Stills. The moody, atmospheric rocker “When We Were Free,” whose lyrics of what Berlin calls “beautiful melancholy memories” are underscored with the increasing drama of booming drums and distorted electric guitars. Filled with hypnotic sound effects and cool vocal and guitar distortion (created via an eight track analog Cascam cassette recorder!), the soulful, reflective “There I Go” touches on the universal search for what Perez calls “something meaningful, though we’re not always sure what it is.”\n\nFurther Hidalgo/Perez collaborations include “Too Small Heart,” a raw and raucous nod to both Los Lobos garage band roots and the wild abandon of Jimi Hendrix; the easy grooving folk-rocker “Song of the Sun,” which taps into the elements of life (water, fire, earth) and creation myths while touching on the way we choose to live in the present; the slow burning blues/rocker “Magdalena,” inspired by the Biblical Mary Magdalene and visions of flowing robes; and the folk-influenced, image rich rocker title track “Gates of Gold,” whose lyrical abstractions allow for multiple earthly and spiritual interpretations.\n\nPerez says, “When I first started listening to the original demo Dave had, the music spoke to me of rural America. The impression the lyrics give could refer to the afterlife, i.e. the “pearly gates,” but I also was thinking about the immigrant experience, the promise of a new life as one travels across borders, all the thoughts a person making that daring move might have connected to the dream of what America is. Our parents all wondered what lay beyond those gates. On a personal level, it’s a reflection of where my band mates and I are in our lives. We’re all over 60 now and looking towards the horizon at our own mortality. We think often about what we’ve contributed and what’s left. I don’t know who the protagonist of the song is, but he’s looking at those gates from a distance because what lies beyond is a mystery.” \n\nAs Hidalgo and Perez began collaborating on their songs, Rosas, as per his trademark “lone wolf” songwriting approach, took his basic tracks to his home studio to complete the handful of tunes that flesh out the set. The singer, guitarist and mandolin player’s pieces include the raucous and bluesy, garage band fired jam “Mis-Treater Boogie Blues,” the swampy folk-rock blues lament “I Believed You So” and the swaying, sensual Latin Cumbia-styled “Poquito Para Aqui.” The sole cover on Gates of Gold is the other Spanish language tune, “La Tumba,” an accordion laced folk piece connected to the Mexican Norteno tradition (related to polka and corrodes) whose theme, says Perez, is very dark, “about following your lover to the tomb.” It’s very familiar to fans as a frequent staple of Los Lobos’ live performances.\n\nBack in 2003, when Los Lobos was celebrating the 30th Anniversary of their humble beginnings as a garage band in East L.A., Rolling Stone summed up their distinctive, diverse, freewheeling fusion of rock, blues, soul and Mexican folk music: “This is what happens when five guys create a magical sound, then stick together…to see how far it can take them.”  Originally called Los Lobos del Este (de Los Angeles), a play on a popular norteno band called Los Lobos del Norte, the group originally came together from three separate units. Lead vocalist/guitarist Hidalgo, whose arsenal includes accordion, percussion, bass, keyboards, melodic, drums, violin and banjo, met Perez at Garfield High in East LA and started a garage band. Rosas, who had his own group, and Lozano launched a power trio. “But we all hung out because we were friends and making music was just the natural progression of things,” says Perez, the band’s drummer. “Like if you hang around a barbershop long enough, you’re going to get a haircut.”\n\nBerlin is Los Lobos’ saxophonist, flutist and harmonica player who met the band while still with seminal L.A. rockers The Blasters. He joined the group after performing on and co-producing (with T-Bone Burnett) their breakthrough 1983 EP …And A Time To Dance. Los Lobos were already East L.A. neighborhood legends, Sunset Strip regulars and a Grammy winning band (Best Mexican American/Tejano Music Performance) by the time they recorded How Will the Wolf Survive? Although the album’s name and title song were inspired by a National Geographic article about real life wolves in the wild, the band saw obvious parallels with their struggle to gain mainstream rock success while maintaining their Mexican roots.\n\nPerez, once called their powerhouse mix of rock, Tex-Mex, country, folk, R&B, blues and traditional Spanish and Mexican music “the soundtrack of the barrio.” Three decades, two more Grammys, the global success of “La Bamba” and thousands of rollicking performances across the globe later, Los Lobos is surviving quite well -- and still jamming with the same raw intensity as they had when they began in that garage in 1973. They don’t get in the studio as often as they did a few decades ago – Tin Can Trust came four years after their previous album of all originals, The Town and the City – but when they do, the results are every bit as culturally rich, musically rocking and lyrically provocative as they were back in the day.\n\n“It’s not always the easiest thing finding time away from our touring schedule and families to find time to make an album,” says Berlin, “but recording Gates of Gold, I have to say it’s great to be back in the proverbial saddle again. It reminds us of the fun we have had making new music over the years, and it’s nice to have the opportunity to create something of value.”\n\nPerez adds, “I find that the most interesting part of songwriting and tracking a new album is the differential between the way a song sounds to you at 2 a.m. and the way it may hit you when it’s 11 a.m. and it reaches the light of day. We may love it just as much or we may realize we can do better. It’s always a process of discovering more about ourselves and the music we love to make. It’s not always easy getting started again, but I love that moment in the process when the songs start to take on their own life and we can let the kid, so to speak, run out onto the street and start figuring things out for himself. The way songs reveal themselves to us during these periods of writing and recording is my favorite part of the Los Lobos recording experience.”\n\nLouie Perez - Drums, Guitars, Percussion, Vocals \nSteve Berlin - Saxophone, Percussion, Flute, Midsax, Harmonica, Melodica \nCesar Rosas - Vocals, Guitar, Mandolin \nConrad Lozano - Bass, Guitarron, Vocals \nDavid Hidalgo - Vocals, Guitar, Accordion, Percussion, Bass, Keyboards, Melodica, Drums, Violin, Banjo \nEnrique \"Bugs\" Gonzalez - Drums/Percussion","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/28/83-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1520565"},{"venue":"Neighborhood Theatre","event":"BETWEEN THE BURIED AND ME - Colors 10 Year Anniversary Tour **SOLD OUT** [Opening Act: The Contortionist, Polyphia, Toothgrinder]","date":"10/21/2017","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1489684-between-buried-me-colors-charlotte/","desc":"American progressive metal band from Raleigh, North Carolina founded in 2001.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/54/96/40-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1489684"},{"venue":"Neighborhood Theatre","event":"PURGATORY 75: INFERNO - 15th Anniversary Celebration","date":"10/14/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1525891-purgatory-75-inferno-15th-charlotte/","desc":"PURGATORY IS BACK !\n\nCharlotte’s longest running theme event is celebrating 15 years of unbuckling the Bible Belt, Purgatory 75: Inferno brings you the most wicked infernal pleasures and devilish delights ever! Descend with us into the debauchery of the damned as we bring the hottest party this side of Hell back to celebrate our return by drinking,dancing and exploring the kink side of the underworld! \n\nFEATURING MUSIC BY:\n- DJ TRISKYL (Purgatory Resident, Atlanta, GA)\n- DJ DREES (Asheville NC, Augusta GA)\n\nWITH PERFORMANCES BY:\n- KAROL HELMS - Innovative pole artist, teacher and champion\n\nUSPDF Pro Miss Sexy 2010 USPDF East Coast Champion 2009 http://www.PolePraxis.com/ https://www.youtube.com/watch?v=U120b4eXAh4&feature=youtu.be \n\n- ICARIA & LUNA RHEA - Sexy power duo Icaria & Luna Rheapush the boundaries of aerial entertainment art. Together they operate Circus Innovations, the groundbreaking and innovative circus arts collective that combines the tantalizing danger of aerial circus performance with the dark and sensual world of kink entertainment . Whether flying by rope chain or something beyond your imagination this duo will blow your fucking mind ! http://facebook.com/circusinnovations\n\n\n- ARCANE ARTS - Masters of Sideshow, Fire, Flow, Dance, Sultry and Macabre. \n\n- WOLFLING & STEVHAN HAND - Cabaret destructo/electro performance with fetish and macabre leanings. “It’s thunderdome x 10 like whoa”\n\n- KAROLINA VON - Stunning and sensual aerial silk artist specializing in the seductive side of performance flight - https://www.facebook.com/KarolinaVon/ \n\n- JORDAN GARCIA - Awe inspiring circus feats of strength and body mobility in a sensual display of erotic movement.\n\nFULL VENDOR MARKETPLACE FEATURING:\n-Sunless Creations: http://www.stores.ebay.com/sunless-creations \n-Pleasure Bound Leather : http://www.facebook.com/pages/Pleasurebound-Leather/158344684180947 \n-Dead Ed's Alternative Clothing http://www.facebook.com/deadeds/ \n\nINTERACTIVE BDSM PERFORMANCES FEATURING: St Andrew's Crosses Soft-Play Station Piercing Play Flogging Medical Torture Electro Stimulation Hot Wax play and more! \n***FULLY-INTERACTIVE KINK DEMOS AND SIDE STAGE PERFORMANCES BY*** \n- Dr Spankenstein - Shepherd Shivalia - House of Payne - Wolf’s Den - https://www.facebook.com/Wolfsdenpr... \n\n***ALSO FEATURING*** \n- The Beautiful Purgatory Go-Go Dancers bring their evil, enticing, and sultry moves to the stage!\n\n*** 21+ ONLY - VALID ID REQUIRED *** \n\n\nJOIN IN THE CONVERSATION AND SHARE YOUR PHOTOS VIA SOCIAL MEDIA by using the hash-tag: #PurgatoryCLT Facebook: @SingleCellProductions Twitter: @SingleCellProd Instagram @ officialsinglecellproductions \n\nFOR TICKETS & MORE INFO PLEASE VISIT: http://www.SingleCell.us \nSPONSORED IN-PART BY: - A Stranger Concept Productions - Film and multi media production studio.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/61/38/48-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1525891"},{"venue":"Neighborhood Theatre","event":"WYE OAK [Opening Act: Luke Temple]","date":"09/28/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1516597-wye-oak-charlotte/","desc":"Wye Oak announce shows and limited-edition rarities 7-inch in September\n\nAt the end of September, Wye Oak will embark on a special tour. The band describes what the audience can expect at these performances:\n \nWe’re so excited to set out on a brief run of smaller, more intimate shows this fall, where we’ll be trying out a bunch of brand-new material for the first time, taking questions from the audience, and just generally exposing y’all to our legendary brand of TMI-style stage banter. Come for a sneak peek at what’s next for us, or just to say hi. \n\nAlso, on September 22, Merge will release “Spiral” b/w “Wave Is Not the Water”, a limited-edition 7-inch on red vinyl. Pre-order your copy now! Jenn and Andy told us a little about each track, both of which were originally released in partnership with Adult Swim:\n\n“Spiral” popped up around 2012, at a time before we began work on Shriek. We were just starting to experiment with synthetic and more pop-oriented sounds, and also got assistance on the marimba from our friend Rod Hamilton, with whom Jenn was sharing a loft at the Copycat in Baltimore at the time. \n\n“Wave Is Not the Water” was created in the early months of 2017, without either of us ever setting foot in the same space. Andy was touring as the drummer for Lambchop and volleying the recording back and forth with Jenn via email, as seems to be the current state of things. \n\nPre-order “Spiral” b/w “Wave Is Not the Water” now, and don’t miss these very special evenings with Wye Oak!","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/59/57/97-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1516597"},{"venue":"Neighborhood Theatre","event":"CASPA [Opening Act: Truth, ConRank, Zen Selekta, Makak]","date":"10/28/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1542971-caspa-charlotte/","desc":"UK bass pioneer, DJ, label owner, ex-pro basketball player, straight talking dubstep champion, dopest ghost: Caspa can be introduced in many ways. But the best is through his beats. His decade-deep discography has dented dances since dubstep's earliest chapters. Over three studio albums, four mix compilations, 30+ singles and many high-profile remixes including Depeche Mode, The Prodigy, Deadmau5, Kaskade, Swedish House Mafia, Grand Puba, Ludacris, Miike Snow and TC, his precision heavyweight productions have been released on eminent labels such as Digital Soundboy and Tempa as well as his own influential imprints DubPolice and Subsoldiers. Both iconic dubstep brands that have played a major role in the worldwide dubstep phenomenon and boasted the earliest work of some of the scene's most respected creative artists like L-Wiz, Subscape, The Others, Emalkay and Caspa's partner in grime Rusko. \n\nDJ-wise he's just as renowned: West London to Cape Town via USA, Australia, India and beyond, Caspa demonstrates how uncompromised club dynamics can work from some of the world's most iconic festival stages (Glastonbury, Sonar, EDC Vegas, Dour Festival) to some of the world's most respected club institutions such as Fabric whose mix CD series featured his and Rusko's era-defining, generation-inspiring 'Fabriclive 37' album. \n\nFast forward: Caspa continues to innovate at the heart of UK bass culture. From 2014's lean, molten back-to-basics '500' concept to 2017's sub-stacked 'Vibrations' series by way of his and Rusko's rule-wrecking slew of genre-burning EPs and well into the future, Caspa continues to push the music he lives his life for in many ways. But the best has yet to come.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/55/14-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1542971"},{"venue":"Neighborhood Theatre","event":"PROTOMARTYR [Opening Act: Flasher]","date":"10/25/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1520602-protomartyr-charlotte/","desc":"Protomartyr – Relatives In Descent \n\nAfter a year of extensive touring in support of 2015’s The Agent Intellect, Protomartyr returned to their practice space in a former optician's office in Southwest Detroit. Guitarist Greg Ahee—inspired by The Raincoats' Odyshape, Mica Levi's orchestral compositions, and Protomartyr's recent collaboration with post-punk legends The Pop Group, for Rough Trade's 40th anniversary—began writing new music that artfully expanded on everything they’d recorded up until that point. The result is Relatives in Descent, their fourth full-length and Domino debut. Though not a concept album, it presents twelve variations on a theme: the unknowable nature of truth, and the existential dread that often accompanies that unknowing. This, at a moment when disinformation and garbled newspeak have become a daily reality.\n\n“I used to think that truth was something that existed, that there were certain shared truths, like beauty,” says singer Joe Casey. “Now that’s being eroded. People have never been more skeptical, and there’s no shared reality. Maybe there never was.”\n\nRelatives in Descent offers new layers and new insights, without sanding any of the edges born from their days as a Detroit bar band. Ahee’s guitar still crackles and spits electricity. Casey's voice continues to shift naturally between dead-eyed croon and fevered bark. Drummer Alex Leonard and bassist Scott Davidson remain sharp and propulsive, a rhythm section that’s as agile as it is adventurous. But this is also Protomartyr at their most impressive. After months of rehearsal, the band decamped to Los Angeles, California for two weeks in March of 2017, to record at 64Sound in Highland Park. Co-produced and recorded with Sonny DiPerri (Animal Collective, Dirty Projectors), who helped capture the band’s long-simmering vision for something more complex, but no less visceral, Relatives in Descent also features contributions from violinist Tyler Karmen and additional synths by Cheveu’s Olivier Demeaux. \n\nIt all begins with \"A Private Understanding,” pegged as the album's opening statement the second it was finished, and a wellspring from which the following eleven songs flow. At once beautiful and brutal, it mutates from drum-led oddity to unlikely anthem, with some of Casey’s most potent lyrical work at its center: “Sorrow's the wind blowing through/Truth is hiding in the wire.” He’d originally approached the writing on this album as an opportunity to move away from the anger and personal despair that defined much of Protomartyr’s previous three albums. But a lot has happened in the past two years. Disturbed by happenings both local (the ongoing, man-made tragedy of the Flint water crisis) and national (just about everything), Casey drew influence from the songwriting of Ben Wallers, the recently translated stories of Irish writer Máirtín Ó Cadhain, and Robert Burton’s The Anatomy of Melancholy, a sprawling, 17th century masterwork that provided both solace and confirmation. \n\nOne can hear these influences throughout, be it in the wary reportage of “Here Is The Thing” or the uncanny menace of \"Windsor Hum\", the shining city of \"Don't Go To Anacita” or the triptych of delusions both \"good\" and \"bad\" that is \"Up The Tower\", \"Night-Blooming Cereus\", and \"Male Plague\". In the end, Relatives in Descent offers a small light in the darkness, while never denying that we are all just standing in the dark.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/28/35-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1520602"},{"venue":"Neighborhood Theatre","event":"GAELIC STORM","date":"11/17/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1506084-gaelic-storm-charlotte/","desc":"After nearly two decades and more than 3,000 live shows, Gaelic Storm — the chart-topping, multi-national Celtic band — is looking sharper than ever with their latest release, Matching Sweaters. The new album mixes traditional Irish music with modern influences, creating a sound that's as wide-ranging as the band's own audience.\n\nFrom bluegrass fans and country cowboys to Deadheads, rock & rollers and Celtic fanatics, Gaelic Storm has built one of the most diverse fan bases in modern music. Matching Sweaters helps explain the broad appeal. Rooted in the songwriting of founding members Patrick Murphy and Steve Twigger, the album moves from drinking songs (\"Another Stupid Drinking Song\") to energetic instrumentals (\"The Narwhaling Cheesehead\") to rootsy pop/rockers (\"Whiskeyed Up and Womaned Out\"), gluing everything together with the spark and spirit of a band that's spent close to 20 years on the road.\n\n\"We're a touring band,\" says percussionist Ryan Lacey, who joined the lineup in 2003. \"That's how this band works. Matching Sweaters is one of the most complete albums we've done so far, because it taps into every facet of our live show.\"\n\nThose live shows date all the way back to the mid-1990s, when Gaelic Storm kicked off its career as a pub band in Santa Monica, California. By the end of the decade, the musicians had appeared in the blockbuster film \"Titanic\" (where they performed \"Irish Party in Third Class\") and laid the groundwork for a career that would eventually find them topping the Billboard World Chart five times, making appearances at mainstream music festivals such as Summerfest, Telluride and The Rock Boat Cruise, and regularly headlining the largest Irish Festivals across the country, all the while gaining a reputation as a genre-bending Irish band whose songs mix Celtic traditions with something new and unexpected. Now, with the band's 20th anniversary on the horizon, they're putting even more emphasis on those newer directions.\n\n\"We'll push the envelope, then reel it back in, then push it again,\" says Murphy. \"There's a lot of variety here, and that's why we can play country festivals, bluegrass festivals and rock festivals, and still fit in perfectly with each one. We wanted Matching Sweaters to reflect that range, so people could buy the CD and hear everything we're able to do in concert.\"\n\nWhen it came time to write Matching Sweaters' 12 songs, Murphy and Twigger teamed up with longtime friend and co-writer Steve Wehmeyer. Together, the three found inspiration in everything from old Irish newspapers (\"The Rustling Goat Gang,\" whose details were gleaned from an article about a vanishing goat herd from Waterford) to bits of conversation overheard in local pubs (\"Paddy's Rubber Arm\").\n\nIn addition to writing new songs, the musicians have continued to play new markets every year, taking the chance to stretch their boundaries — and widen their audience — whenever possible. It helps keep them on their toes.\n\n\"Playing for a new crowd is great,\" says Twigger. \"It takes you back to those early days, where you've got something to prove. We could just do Irish festivals, but why not play a crossover show where 90% of the audience doesn't know you, and you have to make them know you? That's what makes your band good.\"\n\nMatching Sweaters follows in that hard-working tradition, dishing up all the ingredients fans have come to expect from Gaelic Storm — the drinking songs, sea shanties, furiously-strummed instrumentals and sing-along melodies — while spiking the mix with newer flavors. Eat it up, but make sure to save some room! There's plenty more where this came from.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/57/73/11-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1506084"},{"venue":"Neighborhood Theatre","event":"BEATS ANTIQUE [Opening Act: Asadi]","date":"10/04/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1533525-beats-antique-charlotte/","desc":"It’s impossible to describe Beats Antique using just a single genre. One listen to their forthcoming album, Shadowbox (released on their own Beats Antique Records imprint), and their unique hybrid of sound makes perfect sense; their ability to blend so many different kinds of music in to an incredibly vibrant, distinctive and peerless album is what this band has been doing for the past ten years.\n\nSidecar Tommy, David Satori and Zoe Jakes make up Beats Antique, who is releasing their 10th album on October 5th to commemorate their tenth year as a band. They’ve mounted a larger-than-life cross-country tour that will take their vision to theaters across America. “Shadowbox is both the title of our new album, the theme of our tour, and our new store front in Berkeley CA. We decided to bring it all together on this release.“\n\nMostly recorded at their studio in Oakland (which has been around since the 50s), the Bay Area band also recorded in Russia and Israel. “We were lucky to record in both Moscow and Tel Aviv, because we had shows there and wanted to connect with the local artists. We had amazing sessions in both locations; In Moscow we recorded on the outskirts of the city in a wild Industrial complex. We ended up going through strange corridors into this plush bamboo-floored-Hare-Krishna-owned recording studio with state of the art gear. When we were in Tel Aviv, we gave a call to a local legend Yossi Fine and he helped us get time at Pluto Studios, which is one of the best in the city. We recorded with Talya Solan and her amazing group of musicians. We used elements of the Tel Aviv session to create our track “Bdna Salam,” which is raising money for Syrian refugees.” Along with Talya other features on Shadowbox include Lafa Taylor, Alam Khan, Tatiana Kalmykova, brasshouse trio Too Many Zooz (who are touring with Beats Antique), Preservation Hall Jazz Band, Dana Elle, Madoline Tasquin and Medium Troy Orchestra.\n\nShadowbox is a retrospective of sorts, with Beats Antique pulling from all of their previous work as almost a homage to the first ten years of their career. “This will be our first full album produced in Beats Antique’s recording studio/dance performance space. We feel like Shadowbox touches on all our styles from down-temp Middle Eastern influences to cinematic orchestral arrangements. The songwriting process is also different for every song. Sometimes David will come in with a melody and Sidecar will add the bass and beats, and vise versa. One thing that always makes the songwriting process unique is that Zoe creates and arranges music based around stories she wants to tell though dance, so sometimes the performance aspect influences the creation of the music.”\n\nIn June, the group premiered the first single, “Killer Bee,” featuring Lafa Taylor, on Billboard.com. The track is “about standing up to prejudices. Just because someone calls you a killer bee, doesn’t mean you need to kill. We want people to define themselves and not be defined by what people think they should be.” In addition to being a ‘killer’ track, with a compelling music video directed by Kyrian Bobeerian, Beats Antique donated a percentage of the proceeds from their July 1st show at Red Rocks Amphitheatre to The Honeybee Conservancy, a non-profit dedicated to raising awareness about the importance of bees.\n\nAn enthusiastic touring band, a new album also means a new tour, and since Beats Antique is all about the ‘concept,’ Shadowbox (the album and the idea) is another opportunity for them to get the creative juices flowing for the live shows. The band plan to use shadows, light, Indonesian shadow puppetry, custom-created lanterns, dance, story telling, crowd participation and more to make sure this is an unforgettable visual spectacle for their audience.\n\nShadowbox, an album that is an amalgamation of the history of Beats Antique, merged with a tour that will both tease and excite the senses, shows off what this band does best – transform, innovate and revolutionize what you think you know about music.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/62/78/13-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1533525"},{"venue":"Neighborhood Theatre","event":"BONE THUGS-N-HARMONY [Opening Act: Hipgnostic]","date":"09/27/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1543785-bone-thugs-n-harmony-charlotte/","desc":"Bone Thugs-n-Harmony is one of the most well renowned hip-hop groups to come out of the early ‘90s. They started their career in Cleveland, Ohio, US and launched their career after Eazy-E signed them to Ruthless Records.\n\nThe group started performing around the Cleveland area in the early ‘90s under several names such as The Band-Aid Boys and B.O.N.E. Enterpri$e. The group was fairly large containing five members: Layzie Bone, Krayzie Bone, Bizzy Bone, Flesh-n-Bone, and Wish Bone. They released their first album “Faces of Death” in 1993 under the guidance of Krayzie Bone’s older brother, but the album did not gain them the success they were hoping to achieve. After the group released their debut album they were persistently seeking to find someone who could give them a record deal. After much searching they finally caught the eye of NWA’s Eazy-E who signed them to his label and convinced the group to change their name from B.O.N.E. Enterpri$e to Bone Thugs-n-Harmony.\n\nIn 1994 the group released their first EP “Creepin on ah Come Up” on Ruthless Records to commercial and critical success. The EP reached No. 12 on the Billboard 200 and No. 2 on Billboard’s Top R&B/Hip-Hop Albums chart. The EP contained the very popular singles “Thuggish Ruggish Bone” and “For tha Love of $”, which featured Eazy-E. The EP showed Bone Thugs-n-Harmony shifting styles from the hardcore and abrasive gangsta rap style to a more G-Funk style that was prevalent in West Coast hip-hop.\n\nThe year 1995 showed Bone Thugs-n-Harmony releasing their second album “E. 1999 Eternal”, which would become the group’s most popular album. The album has been certified 4x Platinum and reached the No. 1 slot on the Billboard 200 chart. The album was also a critical success having been nominated for a Grammy for Best Rap Album and The Source labeled it as one of the best rap albums of the ‘90s. The album contained the singles “1st of that Month”, “East 1999”, and “Tha Crossroads”. Bone Thugs-n-Harmony were also praised for their melodic approach to rapping as well as the soundscape of the album, which included infectious G-Funk beats and dark uses of synthesizers.\n\nAfter achieving mainstream success with their music career, the group started their own label called Mo Thugs Records that released albums for many Cleveland based artists. The group’s third album “The Art of War” was released in 1997 to commercial success and contained several unique collaborations, which included a song with Tupac Shakur labeled “Thug Luv”. The group’s fourth album “BTNHResurrection” also received commercial success, but it would be the last album that Flesh-n-Bone would appear on until their 2010 release “Uni5: The World’s Enemy”.\n\nIn the early 2000’s Bizzy Bone, Layzie Bone, and Krayzie Bone would take a break from the group and each release solo albums. For the group’s 2006 album “Thug Stories” the group was only down to three members, Krayzie Bone, Layzie Bone, and Wish Bone, but the album was well received and placed high on the Billboard charts. Their 2010 album “Uni5: The World’s Enemy” saw all original members of the group reunited again.\n\nOver the years the group has collaborated with some of the most celebrated performers in the business including Phil Collins, Mariah Carey, The Game, Akon, and will.i.am. The group has also worked with some of the most well-respected rappers including 2Pac, The Notorious B.I.G., and Big Pun. The group’s final album has plans for collaborations with Drake, Kendrick Lamar, and A$AP Mob. Their final album will only have one copy released, which will have a starting bid of $1 million dollars, and the album will be backed by a large world tour.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/69/39-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1543785"},{"venue":"Neighborhood Theatre","event":"MIKE GORDON","date":"09/23/2017","times":"Doors: 7:30 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1520634-mike-gordon-charlotte/","desc":"Phish bassist Mike Gordon returns to the road with his band this fall. Unlike previous projects, the goal was to put together a band that would be in it for the long haul. Guitarist and longtime collaborator Scott Murawski and Mike searched the nooks and crannies of this land for players to complete the outfit. Scott can rip guitar to no end, and he belts out with the kind of voice that at once sounds like your best friend and like the deep backwoods soul and grit of a true American hobo hero, too cool to talk in normal small-talk. \n\nThe band also includes organ and synth-master Robert Walter (from The Greyboy Allstars), sharp-shooter John Kimock on drums and percussion/n'goni/programmer Craig Myers. Mike jumps up and down a lot with this band. Maybe too much, but: a lot. There is a lot of smiling. And frowning, but more the latter. The band's new repertoire will be augmented by secret synesthetic mad scientist gadgetry on and around the stage.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/67/63-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1520634"},{"venue":"Neighborhood Theatre","event":"ERIC GALES","date":"12/01/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1554197-eric-gales-charlotte/","desc":"Eric Gales grew up in a musical family with four brothers, two of them who learned to play the guitar upside down and left handed in the same fashion that Eric does. Eric’s brother Eugene Gales played bass in the Eric Gales Band and his brother Little Jimmy King had a thriving career as a blues artist himself before his untimely death in 2002.\n\nEric released his first record in 1991 at the young age of 16 for Elektra Records to an amazing response from the media and music fans around the globe. Guitar World Magazine Reader’s Poll named Eric “Best New Talent,” in 1991. After recording a second record for Elektra, all three brothers teamed up in 1996 as The Gales Brothers to record Left Hand Brand, which was recorded for the House of Blues label. Through the years, it would not be unusual to look out in the audience and see the likes of Carlos Santana, Mick Jagger, Keith Richards, B. B. King, and Eric Clapton looking on in amazement. Word was spreading about Eric as he was taking his God-given talents and working his crowds into a frenzy each night while on stage.\n\nThe new Millennium presented new opportunities for Eric as he was signed to Nightbird Records an affiliation of the Hendrix family and distributed through MCA/Universal. Under this deal, Eric recorded the critically acclaimed record That’s What I Am in 2001 and hit the road, mesmerizing fans around the world with his uncanny connection to his guitar. In 2006 Eric recorded the critically acclaimed CD Crystal Vision for Blues Bureau and set the stage for his incredible Blues Bureau follow-up, The Psychedelic Underground in 2007. Eric followed that up in 2008 with The Story of my Life and in 2010 hit a new stride altogether with the incredibly successful album Relentless. That album combined with his latest studio album Transformation released in 2011 set the stage for his Double Live CD/DVD, Eric Gales LIVE released in October of 2012. The Eric Gales Trio recorded and released Ghost Notes, Gales’ first all instrumental recording, for Shrapnel Records in 2013. All Music Review says Ghost Notes “crackles with energy, a sturdy mix of blues, rock, and straight-out funk fusion, and Gales’ playing is joyous and elegant by turns, making this arguably his best album yet.” His latest effort, A Night on the Sunset Strip is a live record, just released on Cleopatra Records, in stores NOW.\n\nAs both an African-American left-handed guitarist of extraordinary ability and an expressive vocalist, it is natural for people to compare Eric to Hendrix but Eric has developed a unique hybrid blues/rock sound that also draws upon influences as diverse as Albert King and Eric Johnson. With a unique blend of rock, funk and blues styles, Eric Gales stands head and shoulders among other guitarists in his genre and is out to blow your mind and expand your musical horizons!\n\nThe road can be tough on musicians, and has certainly treated Eric no differently than others. Over the years he has had his ups and downs and battled some of his own demons. As 2016 comes to an end and 2017 comes into play, Eric is clean and sober and his clarity and focus to be the very best he can be is at an all time high! He is fully focused on his music, his wife and his sobriety. There has never been a better time to see Eric Gales LIVE!!!","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/35/24/73-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1554197"},{"venue":"Neighborhood Theatre","event":"PENNY & SPARROW - Wendigo Tour [Opening Act: Lowland Hum]","date":"09/13/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1493064-penny-sparrow-wendigo-tour-charlotte/","desc":"Penny & Sparrow is American singer-songwriter duo of Andy Baxter and Kyle Jahnke out of Austin, Texas. Formed in 2011 after living as roommates at the University of Texas, the duo began their musical endeavor as a hobby and creative outlet. Their first tune, “Creature” was recorded in a small apartment behind an orphanage with one microphone and a laptop. “If you listen closely, you can hear kids screaming and laughing in the background of each song,” says Baxter. “After just one song, we knew writing and recording was something we didn’t want to stop doing.” Through the years, Penny & Sparrow has steadily grown both in discography and audience.\n\nWhile the instrumentation in each of the three released albums (Creature (2011), Tenboom (2013), Struggle Pretty (2014)) may differ, Penny & Sparrow has garnered a reputation of blending sincere lyrics with haunting melodies and harmonies in every song. The raw and emotive quality of their songs has been known to push crowds to near silence for an entire set.\n\nThough most of their recordings are layered with strings and percussion, many fans are surprised to find that Andy and Kyle normally tour with no added instruments – simply two microphones and a guitar. Though there are no added gimmicks on stage, Penny & Sparrow regularly silence crowds not far after the first note is sung. “We like playing as a duo because it’s how each song was first written,” states Baxter.\n\n“Struggle Pretty”, released Spring 2014, is the latest album by Penny & Sparrow. The album was written and recorded inside the East Austin house that Andy and Kyle, along with their wives, lived in together. “Struggle Pretty” is vast with instrumentation and creativity, while still staying true to the harmony-centric roots found in “Creature” and “Tenboom.” Kyle and Andy teamed up with producer Chris Jacobie for the album, who helped capture the spirit and sound of the duo. From the somber “to haunt, to startle,” to the sweeping “Bread and Bleeding,” each song has its own voice within the album. The team began the recording process in September 2013, and finished late February 2014.\n\n“We wanted to record this album in the house we lived in for a lot of reasons,” explains Jahnke. This house is special to both of our families, and we wanted this record to embody that. We want to have our friends come and record during the day and then drink bourbon with us after. Along with that, this house has a very unique sound that we wanted to highlight.” The duo wanted to create a sense of community and camaraderie around the house and music. To involve family and friends both creatively and relationally. The result of the work put in for “Struggle Pretty” was a sincere, inspiring, and exciting twelve-song album.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/55/57/22-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1493064"},{"venue":"Neighborhood Theatre","event":"RHIANNON GIDDENS - Freedom Highway Tour","date":"09/30/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1504914-rhiannon-giddens-freedom-charlotte/","desc":"It was near the close of the first half of the T Bone Burnett–curated, September 2013 Another Day, Another Time concert at New York City’s Town Hall—a celebration of the early ’60s folk revival that had inspired the Coen brothers’ film Inside Llewyn Davis—when an extraordinary star-is-born moment occurred and singer Rhiannon Giddens, best known as a member of the Grammy–winning Carolina Chocolate Drops, indisputably stole the show. Performing Odetta’s “Water Boy” with, as the New York Times later put it, “the fervor of a spiritual, the yips of a folk holler, and the sultry insinuation of the blues,” Giddens brought the celebrity-studded audience to its feet.\n\nShe followed that up with an amazing, tongue-twisting medley in Gaelic that garnered a second standing ovation. Giddens was the talk of the lobby during intermission and at the exclusive party afterwards. “Who on Earth was that,” people excitedly said to each other, “and where can we go to hear more?” Backstage, the savvy Burnett already knew the answer and was immediately moved to ask if he could produce a record with her. The stunning result of their collaboration, Tomorrow Is My Turn, which deftly incorporates folk, jazz, gospel and the blues, will be Giddens’ solo debut record in early 2015.\n\n“It was clear the first time I heard her at rehearsal that Rhiannon is next in a long line of singers that includes Marian Anderson, Ethel Waters, Rosetta Tharp, Odetta, Mahalia Jackson, and Nina Simone,” Burnett says. “We need that person in our culture. She is, in fact, that person in our culture.”\n\nGiddens’ buzz-generating Town Hall performance has luckily been preserved in a double-disc live recording, to be released on Nonesuch Records (also in early 2015) and in a documentary that aired on Showtime last winter.\n\nA mere two days after that star turn, Giddens was impressing the cast and crew on the set of Showtime’s Nurse Jackie, playing a Brooklyn square-dance caller in a scene that would be among the most memorable of the last season. The role harkened back to Giddens’ own entry into the world of old-time music.\n\nEnrolled at Oberlin Conservatory, studying opera, Giddens began to do contra-dance calling on the weekends. At first a playful musical detour, it prefigured the unique course her career would take.\n\nReviving, interpreting, and recasting traditional material from a variety of sources has been central to Giddens’ career, especially in her groundbreaking work with the Carolina Chocolate Drops (CCDs), who also routinely bring sold-out concert audiences to their feet. With their two Nonesuch albums, Genuine Negro Jig (2010, Grammy winner) and Leaving Eden (2012) the CCDs have shared the role African-American performers and songwriters played in U.S. folk-music history, while making recordings that are vital, contemporary, and exuberant.\n\nIconic choreographer Twyla Tharp was so entranced by their work that she created Cornbread Duet, a dance piece set to a suite of songs by Carolina Chocolate Drops that had its world premiere at the Brooklyn Academy of Music.\n\nGiddens’ journey, in a larger sense, began in the Piedmont region of North Carolina, where she was raised—an area with a rich legacy of old-time music, black and white, that Giddens would explore in depth after college. She met her original CCDs band-mates at 2005’s Black Banjo Gathering in Boone, NC, and got schooled in the Piedmont’s traditional music by Joe Thompson, an elderly African-American fiddle player who passed on to Giddens and her cohorts many of the songs that would comprise their early repertoire.\n\nGiddens is an American original—an artist with an unforgettable voice who culls the music of our collective past to point the way to the future, one in which her name will surely be well-known from the moment she steps on a stage.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/57/49/45-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1504914"},{"venue":"Neighborhood Theatre","event":"MANDOLIN ORANGE","date":"10/12/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1493699-mandolin-orange-charlotte/","desc":"Lean in to Mandolin Orange’s new album, “Blindfaller,” and it’s bound to happen. You’ll suddenly pick up on the power and devastation lurking in its quietude, the doom hiding beneath its unvarnished beauty. You’ll hear the way it magnifies the intimacy at the heart of the North Carolina duo’s music, as if they created their own musical language as they recorded it.\n  \nDue Sept. 30 on Yep Roc Records, “Blindfaller” builds on the acclaim of Mandolin Orange’s breakthrough debut on the label, 2013’s “This Side of Jordan,” and its follow-up, last year’s “Such Jubilee.”Since then they’ve steadily picked up speed and fans they’ve earned from long stretches on the road, including appearances at Newport Folk Festival, Austin City Limits Fest, and Telluride Bluegrass. It’s been an auspicious journey for a pair who casually met at a bluegrass jam session in 2009.\n \n“When we finished ‘Such Jubilee,’ I started writing these songs with a different goal in mind. I thought about how I would write songs for somebody else to record,” Marlin explains. “I ended up with a bunch of songs like that, but we chose ones that I still felt personally connected to.”\n \nHoled up at the Rubber Room studio in Chapel Hill, N.C., with a full band this time around, they laid down the tracks in a week between touring. They’ve always been keen on the notion that drawn-out recording sessions don’t necessarily yield better results. A good song, and just one good take, will always shine through any studio sorcery.\n \nThe passage of time, and the regret that often accompanies it, courses through these songs. “When did all the good times turn to hard lines on my face/ And lead me so far from my place right by your side?” Marlin ruminates on “My Blinded Heart.”\n \nIn fact, there’s heartache by the numbers on “Blindfaller.” If you didn’t know better, you’d swear “Picking Up Pieces” is a tearjerker George Jones or Willie Nelson sang back in the early 1970s. It’s a Mandolin Orange original, of course, and also a poignant reminder of the economy and grace with which Marlin imbues his songs – say what’s important and scrap the rest.\n \nA country dirge with soulful washes of pedal steel and mandolin, “Wildfire” details the the lingering, present-day devastation of slavery and the Civil War, with Marlin’s voice locking into close harmonies with Frantz on the chorus. “Take This Heart of Gold” opens with perhaps the best classic-country line you’ll hear all year: “Take this heart of gold and melt it down.” (Marlin admits it was inspired by a Tom Waits lyric he misheard.)\n \nBut there’s also room for detours. Straight out of a honky tonk, “Hard Travelin’” lets the band shift into overdrive. A freewheeling ode to life on the road, it had been kicking around for a while but never fit on previous releases.\n \nAs for the album title, it’s meant to evoke a sense of wonder, of contemplation. A “faller” is someone who fells trees, and in this case that person is blind to his/her own actions and those of the world. The spectral cover photo, by Scott McCormick, is open to interpretation, too: Either those trees are engulfed in flames or sunlight is pouring through them. It’s up to you.\n \n“We wanted different vibes and different intuitions on these tracks,” Marlin says, “and I feel like we really captured that.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/55/64/34-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1493699"},{"venue":"Neighborhood Theatre","event":"TRAPT","date":"09/12/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1549352-trapt-charlotte/","desc":"Trapt have worked for well over a decade to reach this point. Their 2002 self-titled debut surpassed sales of 2 million units, and its lead-off single “Headstrong” was ranked the #1 alternative song and #8 rock song by Billboard. They were a featured act on Rock Band and Tap Tap Revenge 2, and they also fueled countless WWE specials. In addition, they’ve shared the stage with heavy hitters such as Mötley Crüe, Nickelback, Hinder, Chevelle, and many more. Most recently, No Apologies entered the Billboard Top 200 at number 25 in 2010.\n\nStill, Reborn is the next level for Trapt. Brown concludes, “Everything is new again. It’s an incredible feeling. Our fans have stuck with us since the beginning, and we really made a record for them. If the music makes them feel empowered and ready to take on their challenges, then we’ve done something right. I hope it inspires confidence and pushes them to stand up against fear or judgment. We’re proof that you should never give up.”\n\nTrapt's 6th album DNA and song “Passenger” embodies the more progressive side of TRAPT’s brand of hard rock.  The latest album DNA is shaping up to be a landmark album for TRAPT. It surpasses anything the band has done before and subsequent singles will show the true power that this band possesses. Get ready for DNA, it’s going to change everything.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/65/64/05-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1549352"},{"venue":"Neighborhood Theatre","event":"ROADCASE ROYALE: NANCY WILSON OF HEART AND LIV WARFIELD","date":"10/01/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1531543-roadcase-royale-nancy-wilson-charlotte/","desc":"Fronted by Liv Warfield of Prince’s New Power Generation and Nancy Wilson, co-founder of Heart, ROADCASE ROYALE has a rich background in rock and R&B. Warfield, Wilson, and their bandmates bring their decades of experience from the upper echelon of the music industry to ROADCASE ROYALE, along with a renewed sense of direction and drive. Joining Wilson and Warfield are Warfield’s lead guitarist Ryan Waters and Heart veterans Dan Rothchild (bass), Ben Smith (Drums) and Chris Joyner (Keys). Each of these members shines in ROADCASE ROYALE, with their various sensibilities creating the group’s sensitive, passionate, and driving rock and R&B sound.\n\nLiv Warfield, a former track star at Notre Dame, was initially noticed by Prince after the release of her debut album “Embrace Me” and a YouTube video of her singing “Gimme Shelter.” She worked closely with Prince as a member of New Power Generation and he was the executive producer of her second solo album. Nancy Wilson, a guitar virtuoso since the age of 10, is celebrated as one of the seminal musicians in rock history, as a leader of the Rock And Roll Hall of Fame-inducted Heart. Ryan Waters has worked as lead guitarist and musical director for Liv Warfield’s solo work since 2012, and previously worked with artists such as Sade, Cee Lo Green, and India Arie. Ben Smith, Dan Rothchild, and Chris Joyner carry with them an impressive musical pedigree – Rothchild is the son of Doors producer Paul Rothchild and has worked with Stevie Nicks, Fiona Apple and Beck, while Joyner has worked with numerous musicians including Ray LaMontagne, Jason Mraz and Sheryl Crow. Smith has performed with Mike Inez and Mike McCready and has been working with Heart since the 1990s.\n\nNancy Wilson – Vocals and Guitar\n\nNancy Wilson is celebrated as one of the seminal musicians in the history of Rock n' Roll. A guitar virtuoso from the age of 10, Nancy, and her sister Ann, led the multi-platinum rock group, Heart. Together they have gone on to sell 35 million records. Nancy is revered as an ingenious guitar player and a gifted vocalist. As a songwriter, Nancy has co-written a collection of indelible songs that have earned their way into the classic rock canon including, \"Magic Man,\" \"Crazy on You,\" \"Barracuda,\" and \"Straight On.\"\n\nDuring an era when females in rock n' roll were scarce, Nancy helped carve out a place for women to front a band and dominate a rock stage. Her icon status was cemented when Heart was inducted into the Rock n' Roll Hall of Fame in 2013. That same year, she and her sister received a star on the Hollywood Walk of Fame. The Wilson sisters celebrated another career milestone in 2013 when they performed Led Zeppelin's \"Stairway To Heaven\" at the Kennedy Center Honors. Their note-perfect performance was met with rowdy cheers and a standing ovation in the staid hall and brought members of Led Zeppelin to tears.\nNancy has also built a successful career as a film composer. Her composing credits include scores for the following films:\n\n•\t2005 Elizabethtown\n•\t2001 Vanilla Sky\n•\t2000 Almost Famous\n•\t1995 Jerry Maguire (main theme)\n•\t1989 Say Anything\n\nIn 2017, Nancy stands at the starting line of exciting new co-writing/performance opportunities with her powerhouse band ROADCASE ROYALE, revitalized, as she pushes forward into a fresh artistic world.   \n\nLIV WARFIELD – VOCALS\n\nLiv Warfield burst out of the Portland OR music scene in 2006 as “Portland’s most soulful singer” (Portland Monthly.) Her debut album “Embrace Me” caught the ear of the music industry, and soon legendary music icon Prince discovered Liv’s powerful singing and mighty stage presence after watching a YouTube video of her singing “Gimme Shelter.”  He invited her to join his vocal backing group the New Power Generation. Liv credits Prince with mentoring her, guiding and coaxing stronger performances from her both in the studio and on stage. He executive produced her second album “The Unexpected” and wrote the title track. \n\nLiv has also performed alongside Al Green, B.B. King, The Dave Matthews Band and The Roots and slayed on numerous TV shows such as The View, David Letterman and Jimmy Fallon. Rosie O’Donnell commented, “Liv Warfield, Holy Crap! Unreal. A voice you can’t imagine!” \n\nA little known fact about Liv is that she was a gymnast and track star at Notre Dame.  And now she is bringing that same blue-ribbon drive and focus to ROADCASE ROYALE. Her songwriting, her voice, her emotional approach to interpreting a song are unbeatable.\n\nRYAN WATERS - GUITAR\n\nRyan Waters’ long list of accomplishments as a musician and performer directly reflects his desire to create music with integrity without regard for convention and genre. Ryan joined Sade in 2000 as lead guitarist in their legendary live band and has since performed for millions of fans all over the world. He has also collaborated with many other top names in music, including CeeLo Green, India Arie, while continuing to write, produce and record original material. In 2012, began working with vocalist/songwriter, Liv Warfield as her lead guitarist and musical director. Together, they wrote and co-produced her critically-acclaimed album “The Unexpected,” executive produced by Prince. \n\nBEN SMITH - drums\n\nBen began performing with Ann and Nancy Wilson in 1994, with their band Lovemongers. He has had the honor to work live and in the studio with the Wilson sisters and Heart ever since. Ben has also performed and/or recorded with a host of other legendary musicians including: Taj Mahal, Cyndi Lauper, Peter Frampton, jazz artists Nancy Wilson, Ernestine Anderson and Phoebe Snow. His film-based recording work includes the Cameron Crowe films (and soundtracks) \"Almost Famous,” “Vanilla Sky,” and “Elizabethtown.”  Ben is known as the “first call” session drummer in his hometown of Seattle and has an active career as a top producer in town.\n\nCHRIS JOYNER  - Keyboards\n\nLos Angeles native, Chris Joyner has a reputation as one of the music industry’s go-to pianists and keyboardists. He has recorded and toured with some of the biggest names in the industry, including Jason Mraz, Sara Bareilles, Tom Morello, Ray LaMontagne, Amos Lee, Ben Harper and Sheryl Crow. In 2015, Joyner released his well-received, sophomore solo record, “Domino,” which incorporates his primary influences like Dr. John, Stevie Wonder and The Beatles. Since 2014, Chris has toured extensively with Heart, supporting and enhancing their classic songs with his funky and soulful keyboard chops.\n\nDAN ROTHCHILD - Bass\n\nDan Rothchild carries an impressive music pedigree. Son of maverick producer Paul Rothchild (Doors, Janis Joplin, Bonnie Raitt, etc), he has forged a career of his own playing bass in studios and live for artists including Heart, Beck, Sheryl Crow, Fiona Apple, Stevie Nicks, Shakira, Melissa Etheridge, Carole King, Aimee Mann, and many others.  Along with Ben Smith, he has formed one of the most-admired live rhythm sections in current-day rock n roll. Dan enjoys album production as well, and produced Better Than Ezra's platinum-selling album \"Deluxe” and Heart’s latest full-length, “Beautiful Broken.”","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/62/40/93-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1531543"},{"venue":"Neighborhood Theatre","event":"OH WONDER - Ultralife Tour [Opening Act: Jaymes Young]","date":"10/06/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1498896-oh-wonder-ultralife-tour-charlotte/","desc":"English alternative pop duo, based in London. They rose to fame through Soundcloud, in which they had decided to post an original song every month, beginning on 1 September 2014. Each song was written, recorded, produced and mixed by the duo in their home studio in South-East London. These monthly installations culminated a year later in the release of their self-titled album, which also included two unreleased songs.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/44/04-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1498896"},{"venue":"Neighborhood Theatre","event":"JOYNER LUCAS: The 508 Tour","date":"10/10/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1534979-joyner-lucas-508-tour-charlotte/","desc":"t has been suggested that it doesn't matter where you're from, but where you're at. Hip-Hop has proven that both locations matter equally. However, every once in a while you get an artist like Joyner Lucas that is more concerned about where they are going. \n\nBorn and raised in Worcester, Massachusetts, Lucas grew up in a biracial household, but he found the true color of life watching his father make music. \n\n\"I developed a sense of feeling and healing from watching him,\" he says of his father, who was a local soul music producer. \"Eventually, I started bobbing my head and freestyling and he told me to start writing that stuff down.\" \n\nHis talent developed quickly as he wrote his first song at age 9 and completed his first album just one year later. By the time he entered high school, education had already taken a backseat to his musical aspirations. After spending most of his time writing lyrics instead of essays, Lucas graduated and wasted no time dropping his 2011 debut 'Listen To Me' under his former moniker Future Joyner. The project garnered positive feedback which motivated Lucas to chase his dreams \n\n\"My music is purity,\" says Lucas. \"I try to have a bit of everything. I can't please everybody, but I try to with my music. I am a musical guy, so I couldn't pigeon hole myself even if I tried.\" \n\nLucas' latest offering 'Along Came Joyner' proves this. The conceptual album revolves around a story about a man from another planet who gets kicked out of home by his mother, lands on earth and begins a quest to find his human father. A story that isn't too far off from Lucas' real-life experiences.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/63/52/57-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1534979"},{"venue":"Neighborhood Theatre","event":"THE SLANTS","date":"09/18/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1523800-slants-charlotte/","desc":"Nestled in Portland, Oregon's predominately white and hipster culture is all-Asian American dance rock band, The Slants. Rather than adopting the usual departure points of Portland's music scene - alt-folk rock, shoegazer music, indie pop - The Slants took their influence from grabbing onto the corners of foundational 80s synth-pop music and blending it with modern dance rock sensibilities. They call this amalgamation of contagious, energetic, and danceable music \"Chinatown Dance Rock.\"\n\nFor their third full-length release, The Yellow Album, the band continued in the vein of creating an album charged with energy and shaped by an intensity gained only from frequent touring. It is the sound of a band who understands its roots but isn't afraid to branch out musically. The result is a rounded album that explores the dichotomy between darker undertones and the thrills of new love.\n\nThe Yellow Album could be a natural progression from either 2010's Pageantry or their 2007 debut Slanted Eyes, Slanted Hearts. Musically, it draws from the wider synthesizer driven palette of the first album while retaining the harder hitting rock sounds of the second. The lyrics explore the personal lives and experiences of the members of the band.\n\nFrontman Aron Moxley's life began with abandonment. He explains, \"I was one of the babies born in Saigon during the Vietnam War. I'll never know my real birthday, let alone find out who my mother is or know if she's still alive.\" The song \"Adopted\" illustrates Moxley confronting these feelings, which have plagued him for so long. \"This album is more transparent, more sincere. It came from a faulty, but true short love story that ended in numbness fueled by booze and tears. But, ultimately back to a rescue of my own heart.\"\n\nThe idea of redemption from all-consuming pain is also reflected in other songs, including \"Misery\" and \"Been Through Hell.\" Moxley states, \"I like to write songs that are deeply personal, that mean something to me. I think they're more real and they're things that other people can relate to as well. Things got as bad as I thought they could ever get, I hit rock bottom. But I kept moving on.\"\n\nDuring the past two years, The Slants had to balance a rigorous international touring schedule, a lineup change, writing songs for the album, keeping personal relationships from falling apart, fundraising for the tsunami relief effort in Japan, and a fight with the United States Patent and Trademark Office that made headlines across both legal blogs and Asian culture outlets.\n\n\"We were pulled into an unexpected struggle,\" explains founder and bassist Simon Young. \"A touring band has enough to worry about, let alone an international disaster involving friends and family or dealing with a legal battle against the United States government.\"\n\nThe trademark battle was sparked by a government attorney's claim that the band's name was disparaging to Asians. \"It was like banging our head against the wall, trying to convince someone that we were not offensive to ourselves, that the community was in overwhelming support of our band.\"\n\nDespite the frustration, Young used the opportunity to bring an entire community together in order to defeat the poorly written, antiquated laws that were affecting numerous minority groups. The title track \"Yellow\" reflects the constriction experienced by the band.\n\nThe album title itself was birthed in a more playful approach to the idea of ethnic pride. \"We've actually been sitting on the idea for a few years,\" says Moxley. \"The Beatles had The White Album, Metallica and Jay Z had The Black Album, so we wanted to have The Yellow Album.\" The juxtaposition of a tongue-in-cheek album title and some deeply serious songs reflect a band who can still embrace tragedy with a punk rock swagger.\n\nWith The Yellow Album The Slants continue to combine their 80s music heritage, floor-filling dance beats, and cultural experiences that provide the backbone for every note. The result is a collection of undeniably catchy songs that will make you want to dance. However, this album will also resonate with you, providing so much more than an enticing chorus. The Slants manage to combine heart and musicality, a combination that is becoming increasingly rare. The Slants have arrived and are ready to induct you into the Slants Army. It's time for you to listen.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/94/87-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1523800"},{"venue":"Neighborhood Theatre","event":"THE MOUNTAIN GOATS [Opening Act: The Hot At Nights]","date":"09/05/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1500023-mountain-goats-charlotte/","desc":"John called me about playing with the Mountain Goats in 2001.\n\nNot for the first time, mind you. I’d signed on for a couple European tours in 1996, playing bass; the first had gone swimmingly and led to a second, which didn’t. Still, a foundation had been laid: John and I, already close friends, had developed over the course of those tours a musical chemistry strong enough that, even five years later, we were still bummed that the only people who got to see it were a handful of indifferent Bavarian villagers. “Do you want to do some recording?” John asked. Yeah, I said. We should totally do some recording.\n\nIt turned out to be a fateful conversation. Not more than a week or two later, the venerable London indie 4AD got in touch, and we found ourselves suddenly charged with making an album. In a studio. With a producer. \n\nWe spent an intense week at Dave Fridmann’s Tarbox Road, with Glasgow’s Tony Doogan at the board. There was some give and take. I loved the Mountain Goats, but I’d heard ten years’ worth of boombox Mountain Goats albums and wanted to swing for the fences. John was game while insisting that certain defining orthodoxies be preserved. We met in the middle and were both pretty ecstatic with the result: we felt like we’d gone out on a limb, but in a way that stayed true to the spirit of the project. And then Tallahassee came out and we got to read a bunch of articles about our new lo-fi album.\n\nIndefatigable in our efforts to escape the legacy of the Mountain Goats’ home-recorded past, over the course of the eight albums that followed we would exploit the production and engineering skills of meticulous sonic architects like John Vanderslice and Scott Solter, become even more of a band with the addition of Superchunk’s Jon Wurster on drums in 2007, and flesh out our songs with string and horn arrangements bordering on the Bacharachian. \n\nWith Matt Douglas fully on board as woodwinds-and-kitchen-sink guy, we’re now a four-piece, and to record this album, our fourth for Merge and the one to which you’re presumably about to listen, we went to Blackbird Studio in Nashville, as top-shelf a facility as any on the planet. They have the board Aja was recorded on. When Jon asked about snares, he was told, “We have 200 of them.” We had sixteen people from the Nashville Symphony Chorus skip out on a Mahler rehearsal to come in and sing on a song. Sixteen!\n\nThe theme this time around is goth, a subject closer to my heart perhaps than that of any Mountain Goats album previous. And while John writes the songs, as he always has, it feels more than ever like he’s speaking for all of us in the band, erstwhile goths (raises hand) or otherwise, for these are songs that approach an identity most often associated with youth from a perspective that is inescapably adult. Anyone old enough to have had the experience of finding oneself at sea in a cultural landscape that’s suddenly indecipherable will empathize with Pat Travers showing up to a Bauhaus show looking to jam, for example. \n\nBut underneath the outward humor, there is evident throughout a real tenderness toward, and solidarity with, our former fellow travelers—the friends whose bands never made it out of Fender’s Ballroom, the Gene Loves Jezebels of the world—the ones whose gothic paths were overtaken by the realities of life, or of its opposite. It’s something we talk about a lot, how fortunate and grateful we are to share this work, a career that’s become something more rewarding and fulfilling than I think any of us could have imagined. We all know how easily it could’ve gone the other way, and indeed for a long time did. \n\nMaybe that’s why John entrusted me with writing the coda to his song about a guy fed up with his major label bosses and contemplating packing it in. You know, the one I sang at the fancy recording studio, into a microphone worth more than I made in a year for most of my life. \n\nOkay, I’m wasting my time, I know. And it’s fine—as far as inevitable fates go, I can think of far worse. Please, enjoy Goths, the new album by those preeminent legends of lo-fi, the Mountain Goats!\n\n—Peter Hughes\nFebruary, 2017\nCharlotte","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/63/99-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1500023"},{"venue":"Neighborhood Theatre","event":"XEB (ex Original Members Perform Debut Album \"Third Eye Blind\") [Opening Act: Stocklyn, Patrick Barry]","date":"09/24/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1523802-xeb-ex-original-members-charlotte/","desc":"XEB (aka X Eye Blind) brings together ex original members of Third Eye Blind. Kevin Cadogan, Tony Fredianelli and Arion Salazar's contributions span 17 years of the band’s history. Cadogan, who was a signatory to Third Eye Blind's Elektra record deal, performed lead guitar and composed the music to 10 of the 14 songs on 3eb’s 1997 Self Titled debut album which sold 6x platinum. Cadogan also composed the music to 6 songs on 3eb’s 2x platinum selling sophomore album 'Blue' including the fan favorite \"Wounded\". Cadogan has been hailed as a Master Innovator by Guitar Player Magazine and toured from ’96-’99 performing his co-authored radio hits \"How's It Going To Be\", \"Graduate\", and \"Losing A Whole Year\".\n\nIn San Francisco 1993/94, they wrote and performed under the name Third Eye Blind until Fredianelli exited the band that same year, but not before contributing musical production elements to songs on the debut such as \"Motorcycle Drive By\" and the hit \"Semi Charmed Life\". Fredianelli later contributed his signature backing vocals and guitar, ushering in a new sound for Third Eye Blind that carried through the fourth album. Fredianelli composed the music to many songs on the certified gold album 'Out Of The Vain'. His co-authored radio hits include “Blinded”, “Non-Dairy Creamer” and 2009’s “Bonfire” from the #1 selling album 'Ursa Major'.\n\nGrammy nominated Bassist and composer Arion Salazar co-wrote many songs (credited and un-credited) throughout the band’s career including the hit “Never Let You Go” along with other fan favorites spanning the bands career. Salazar is credited as a producer on Third Eye Blind's 'Blue' and 'Out Of The Vein' albums and is known for his signature use of double/effected bass tracking and vintage keyboards.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/60/94/96-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1523802"},{"venue":"Neighborhood Theatre","event":"KILL THE NOISE [Opening Act: shlump, Yuki, Azira]","date":"09/15/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1543533-kill-noise-charlotte/","desc":"Covering the EDM spectrum from electro house to dubstep, Kill the Noise is one of the projects from Rochester, New York-based producer Jake Stanczak. After finding dancefloor success under the name Ewun, Stanczak launched the spacier and more dubstep-oriented Kill the Noise in 2008 with the album Kill Kill Kill. Successful remixes of the hit Estelle and Kanye West track \"American Boy\" followed, while 2010 found him working with Jon Gooch on the Feed Me's Big Adventure EP, which was released by Deadmau5's label Mau5trap. In 2011 he partnered with Skrillex and co-produced two tracks for Korn's dubstep-oriented album The Path of Totality. A year later, focus switched to Kill the Noise's front-facing career, with both the Roots Remixed and Black Magic EPs dropping in 2012. In 2014 he collaborated with Skrillex and Fatman Scoop on the hit track \"Recess,\" and in 2015 he released the album Occult Classic, with guests like Dillon Francis and AWOLNATION. ~ David Jeffries, Rovi","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/67/36-og.png?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1543533"},{"venue":"Neighborhood Theatre","event":"PINK FLOYD LASER SPECTACULAR","date":"09/21/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1531548-pink-floyd-laser-spectacular-charlotte/","desc":"After 30+ years of touring, Paramount's Laser Spectacular has become a cult classic, presenting the music of Pink Floyd like you've never seen it before. Presented for the first time in 1986, producer Steve Monistere has established the Laser Spectacular as the longest running, touring theater show in history! Driven by cutting edge effects, Full Color Lasers, Hi-Def Multi-Screen Video Projection, Concert Quality Sound and Lighting Effects, your senses are confronted with an array of visual displays, choreographed to the soundtrack of the 2.5-hour show.\n\nViewed through specially designed 3-D glasses, the audience is drawn into this magical production, often singing along with the re-mastered sound track. The show has become a favorite with progressive rock fans of all ages. At most shows, parents are seen rocking out with their teenagers, as the Laser Spectacular brings together two generations of Pink Floyd music fans.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/01/95/96/37-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1531548"},{"venue":"Neighborhood Theatre","event":"HEATHER McDONALD","date":"09/16/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1521112-heather-mcdonald-charlotte/","desc":"Heather McDonald is one of the most in-demand and multi-faceted comedians today, who not only juggles a career as a nationally touring stand-up, actress, and accomplished writer, but is also a devoted wife and mother…when the rest of her family isn’t driving her up the wall.\n\nCurrently, Heather can be heard weekly on her sensational new podcast “Juicy Scoop” on PodcastOne.  Every week, Heather holds nothing back and gets the most surprising, scandalous, and intimate scoops from her celebrity guests. Heather has a hilarious way of delving into celebrity gossip, fancying herself a tabloid detective where if she can’t find the truth she’ll make it up herself.\nAs a stand-up comedian, McDonald continues to perform for enthusiastic fans all over the country. She opened for all 4 of Chelsea Handler’s sold out tours throughout the country from Carnegie Hall to Arenas up to 10,000.\n\nIn 2016 she just debuted her first Showtime special ‘I Don’t Mean To Brag,’ which achieved record ratings on the network and is currently streaming on Netflix. She gained a throng of loyal fans as a staff writer and for her regular roundtable appearances on E!’s top rated show ‘Chelsea Lately’. She also starred in After Lately, a mockumentary series on E! for 3 successful seasons. \n\nAs an author, Heather’s debut book (released June 2010), You’ll Never Blue Ball in this Town Again, spent seven weeks on the New York Times best-seller list, and climbed to the #1 position on Amazon’s “Bestsellers in Entertainment” list. McDonald released her follow up to Blue Balls in February 2013 titled MY INAPPROPRIATE LIFE: Some Material Not Suitable for Small Children, Nuns, or Mature Adults which also became a national bestseller. My Inappropriate Life is an irreverent account of McDonald’s attempts to balance fame with family time, all while doing it her way. Heather’s writing has also been featured in Redbook Magazine, Reader’s Digest, The Hollywood Reporter and she has contributed to New York Magazine’s Vulture.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/59/60/34-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1521112"},{"venue":"Neighborhood Theatre","event":"Horton’s Holiday Hayride with REVEREND HORTON HEAT & JUNIOR BROWN with special guests The Blasters & Big Sandy [Opening Act: The Aqualads, The Belmont Playboys]","date":"12/02/2017","times":"Doors: 6:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1543820-horton-s-holiday-hayride-charlotte/","desc":"￼Loaded guns, space heaters, and big skies. Welcome to the lethal littered landscape of Jim Heath’s imagination. True to his high evan- gelical calling, Jim is a Revelator, both revealing & reinterpreting the country-blues-rock roots of American music. He’s a time-travelling space-cowboy on a endless interstellar musical tour, and we are all the richer & “psychobillier” for getting to tag along.\n\nSeeing REVEREND HORTON HEAT live is a transformative experience. Flames come off the guitars. Heat singes your skin. There’s nothing like the primal tribal rock & roll transfiguration of a Reverend Horton Heat show. Jim becomes a slicked-back 1950′s rock & roll shaman channeling Screamin’ Jay Hawkins through Buddy Holly, while Jimbo incinerates the Stand-Up Bass. And then there are the “Heatettes”. Those foxy rockabilly chicks dressed in poodle-skirts and cowboy boots slamming the night away. It’s like being magically transported into a Teen Exploitation picture from the 1950′s that’s currently taking place in the future.\n\nListening to the REVEREND HORTON HEAT is tantamount to injecting pure musical nitrous into the hot-rod engine of your heart. The Reverend’s commandants are simple.\n\nROCK HARD,\nDRIVE FAST,\nAND LIVE TRUE.\n\nAnd no band on this, or any other, planet rocks harder, drives faster, or lives truer than the Reverend Horton Heat. These “itinerant preachers” actually practice what they preach. They live their lives by the Gospel of Rock & Roll.\n\nFrom the High-Octane Spaghetti-Western Wall of Sound in “Big Sky” — to the dark driving frenetic paranoia of “400 Bucks” – to the brain-melting Western Psychedelic Garage purity of “Psychobilly\nFreakout” — The Rev’s music is the perfect soundtrack to the Drive-In Movie of your life.\n\nJim Heath & Jimbo Wallace have chewed up more road than the Google Maps drivers. For twenty-five Psychobilly years, they have blazed an indelible, unforgettable, and meteoric trail across the globe with their unique blend of musical virtuosity, legendary showmanship, and mythic imagery.\n\n“Okay it’s time for me to put this loaded gun down, jump in my Five- Oh Ford, and nurture my pig on the outskirts of Houston. I’ll be bringing my love whip. See y’all later.” - Carty Talkington Writer/Director\n\nRev your engines and catch the sermon on the road as it’s preached by everybody’s favorite Reverend. Don’t forget to keep an eye out for the 11th studio album from REVEREND HORTON HEAT, boldly titled Rev, due out January 21st.JUNIOR BROWN \"THE AMERICAN ORIGINAL\"\n\nBorn in 1952 in Cottonwood, Arizona, Junior Brown showed an affinity for music at an early age. Discovering a guitar in his grandparent's attic at age seven, he spent the next several years woodshedding with records and the radio. Junior was also able to tap into music he couldn't hear at home which older, college aged kids were listening to. This was possible as a result of his father's employment at a nearby campus in 1958. Armed with this broad spectrum of source material, he had developed some formidable chops by the end of his teen years.\nBrown's passion for Country and Western music had intensified by the late 1960's. With many prominent figures as his inspiration, he spent his nights further sharpening his musical skills in small clubs across the southwest. \"I played more nights in honkytonks during the 70's and 80's than most musicians will see in a lifetimeI did so many years of that, night after night, four sets a night, 15 minute breaks; I mean after that, you gotta get good or get out.\" Brown still prefers to refer to his favorite music as \"Country and Western\" as it was called when he began his career. More recently, however, with the exception of Classical, Modern Jazz and Rap, he has shown himself to be equally adept at virtually all styles of American music, leading many to dub him America's most versatile musician. A listen to his catalog of recordings reveals a virtuosity in Country, Western Swing, Hawaiian, Rock and Roll, (Hard Rock, Surf, etc.), Blues, Trad. Jazz, (Swing), Pop, Bluegrass, and even Mariachi.\n\nJunior knew he could play and sing almost anything, but he had yet to explore his potential as a songwriter. \"I realized no one was going to walk into a club and discover meso I started hanging out with some songwriters who I'd played some gigs with, and they showed me how to support myself by writing and publishing.\" With his songwriting coming together by the mid 80's, Brown upgraded his gear in a way that no artist had ever done. Struggling through each show with the back and forth switch between the six string guitar and its steel counterpart, he had a dream one night about the two instruments mysteriously melting into one. The result was Brown's unique invention, the \"Guit-Steel\", a double-necked guitar combining standard guitar with steel guitar, allowing him to switch instruments quickly in mid-song while singing. There are other Guit-Steel players now, but Junior was the first, and for many years the one and only. For this and other reasons, he is truly an American original.\n\nIn the early 90's Brown and his band (including wife, Tanya Rae) relocated to the fertile Austin, Texas music scene and landed a weekly gig at the Continental Club. His unique and entertaining combination of singing, songwriting, instrumental skills and producing led to a seven record deal with Curb Records that began with \"Twelve Shades of Brown\" in 1993. He later released two albums on the Telarc label.From early days growing up in the southeast Los Angeles suburb of Downey, California under the tutelage of T-Bone Walker and Big Joe Turner to their emergence as central figures in the eclectic LA punk/rock scene of the early ‘80s to their current status as internationally-renowned influences in their own right, the Blasters have spent their lives exploring and expressing the deep and diverse musical legacy that is best described by the title of their first album: American Music.\n\nA performance by today’s Blasters––vocalist-guitarist Phil Alvin, drummer Bill Bateman, bassist John Bazz, and guitarist Keith Wyatt––reflects influences that range from George Jones and Carl Perkins to Howlin’ Wolf, James Brown and Bo Diddley. The band’s 1980 debut album American Music (Rollin’ Rock) was a powerful collection of fresh, distinctive performances that shattered the artificial boundaries between blues, rockabilly, country, R&B and rock & roll. The next three albums for Slash/Warner Bros. (The Blasters, Non-Fiction, and Hard Line) increasingly featured the unique songwriting voice of original guitarist Dave Alvin as the band’s lineup expanded to include pianist Gene Taylor plus saxophonists Steve Berlin and New Orleans legend Lee Allen (“the man who put a saxophone in rock & roll”). As the Blasters’ fame grew, they began to draw accolades from artists as diverse as Bruce Springsteen, Eric Clapton and Queen, and in turn the band encouraged and supported still up-and-coming LA musical peers such as Dwight Yoakum and Los Lobos\n\nIn 1986, Dave Alvin left the band to pursue a solo career, and over the next decade a series of renowned guitarists including Billy Zoom, Michael “Hollywood Fats” Mann, Greg “Smokey” Hormel, and James Intveld filled the position. Phil Alvin simultaneously expanded his own musical efforts with the release of two acclaimed solo albums, Unsung Stories (Slash/Warner) in 1986 and County Fair 2000 (Hightone) in 1994.\n\nIn 1996, current guitarist Keith Wyatt joined the lineup and the Blasters continued touring steadily in the US and Europe before returning to the studio in 2004 to record 4-11-44 (Rainman). After the departure of drummer Jerry Angel, the band reunited with original member Bill Bateman and subsequently released their 2012 CD Fun on Saturday Night (Rip Cat).  Meanwhile, the Blasters’ catalog was renewed with reissues of American Music along with two Slash/Warner compilations (Testament and The Blasters Collection) and the live recordings Trouble Bound and Going Home Live (Shout Factory).\n\nBlasters shows have been described as “a cross between Creedence and the Clash,” with a display of passion and energy only deepened by decades of experience. For all of the ways in which the world has changed in the past few decades, one thing is still guaranteed: the Blasters play American Music.Over the last three decades, Big Sandy and his Fly-Rite Boys have kept up a constant cycle of traveling back and forth across the lower 48, then hopping across the pond to Europe and beyond. They bring with them a brand of American music that has earned them an induction into the Rockabilly Hall of Fame, several national television appearances, guest spots on The Grand Ole Opry, and a slew of adoring fans.\n\n\"I truly love being out on the road, and I feel blessed to have the opportunity to sing my songs all over the world,\" said Sandy. \"But when I'm away from the U.S. for too long, it's like I need a recharge... like I need a solid dose of everything Americana. Give me a Chuck Berry song while rolling down the interstate, or a truck stop conversation with a waitress who once danced with Lefty Frizzell, and I'm good for another three thousand miles.\"\n\n\nTwenty-five years, fourteen albums & hundreds of thousands of miles. What a dream it’s been.\n\nWhen I first got together for a garage rehearsal with a group of musician friends in the spring of 1988 in Anaheim, California, I never dreamed that I would someday be celebrating the silver anniversary of the rocking little band that formed that afternoon.. Yet here I am, looking back over a wild ride that has taken us around the world countless times, that has put us in front of national television audiences, and - most importantly - that has given me the opportunity to play the music that I grew up having such a passion for - Rockabilly, Rock & Roll, Honky-Tonk, Rhythm & Blues, Soul, Doo-Wop... and now with the release of our new all-acoustic album “What A Dream It’s Been”, even a touch of Jamaican Rocksteady. Putting together the new record for Cow Island Music has brought back a flood of memories; we went through our entire catalogue of LP’s, picked out some of our favorite original numbers, and gave them fresh new arrangements, rhythms, and instrumentations. In many ways , it was our way of looking back at everything that has led us to where we are now, while looking forward towards new musical horizons.\nHappy 25th Anniversary, Fly-Rite Boys! Here’s to 25 more!\ncheers,\nBig Sandy","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/72/63-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1543820"},{"venue":"Neighborhood Theatre","event":"THE MANTRAS","date":"11/25/2017","times":"Doors: 8:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1554086-mantras-charlotte/","desc":"The Mantras, a five piece jam machine born of Greensboro, NC have been conquering crowds and melting minds all over the country progressively for over a decade. The band’s music can be described with all types of varying rock and roll terminology, but is absolutely best defined by each listener’s ear and, equally important, their experience.\n\nSince the inception of The Mantras in the mid 2000's, the band has been touring the country and building a catalog of 4 studio albums and over 100 original songs. Performing an entirely different set of music each night is an integral part of the band’s direction and mission as well as the ability to truly improvise in between orchestrated pieces. With eclectic influences of sounds from around the globe, The Mantras create a musical escapade during each performance, giving every ounce of emotion to their craft of expression and communication through music.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/66/45/75-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1554086"},{"venue":"Neighborhood Theatre","event":"TOMMY CASTRO & THE PAINKILLERS: Stompin’ Ground Record Release Tour [Opening Act: Pam Taylor]","date":"10/17/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1533024-tommy-castro-painkillers-charlotte/","desc":"\"An inspired blend of high-energy blues, R&B and roadhouse rock…soulful, celebratory vocals and exquisite, stellar guitar” —Blues Revue\"\n\nSwaggering, razor-wire gospel-tinged soul, simmering deep blues and hard-grooving house rockers\" –AllMusic.com\n\n\"Gritty, funky, rocking and original\" –Boston Globe \n\nBlazing soul-blues rocker Tommy Castro’s musical roots run deep. As he unleashes his high-energy music to fans all over the world, Castro is inspired by the sounds he absorbed while coming of age on the rough and tumble side of San Jose, California. During the late 1960s and early 1970s, this was Castro’s home turf—his stomping ground. It was a place where the street-tough Mexican Americans and the counter-culture hippies came together to drink, smoke, laugh, party and listen to tunes—the hippies with their blues and rock, the Mexicans with their soul music. Mixing the blues-rock he loved and the soul music he heard blasting out from the lowriders cruising the streets, along with the socially conscious message songs of the day, Tommy’s own sound was born. He honed his guitar playing to a razor’s edge on the city’s competitive bar scene, where he learned how to capture an audience with his intensely passionate vocals, stellar musicianship and dynamic performances. Almost every major rock and soul act, from Ike & Tina Turner to Janis Joplin to Elvin Bishop to Taj Mahal, toured through the area, and Castro was at almost every show. He saw John Lee Hooker, Albert King and Buddy Guy & Junior Wells at the same local blues bar, JJ’s, where he often jammed, dreaming of one day busting out.\n\nOver the course of his career, Tommy Castro’s San Jose DNA has always inspired his music, whether he’s squeezing out the deepest blues or the funkiest soul grooves. He and The Painkillers—bassist Randy McDonald, keyboardist Michael Emerson and drummer Bowen Brown—have played hundreds of shows to thousands of music lovers, always leaving his audiences screaming for more. All of his albums are filled with original blues, soul and West Coast rock, each song showing a slightly different side of Castro’s multifaceted musical personality. Billboard says the band plays “irresistible contemporary blues-rock” with “street-level grit and soul.” \n\nOn his new album, Stompin’ Ground, Tommy Castro opens windows into both his past and his always-evolving musical future. Produced by Castro and guitar wunderkind Kid Andersen and recorded at Andersen’s soon-to-be legendary Greaseland Studio in San Jose, Stompin’ Ground finds Castro letting loose on a set of 12 tracks featuring six originals and new versions of songs he learned and played as a young up-and-comer. He is simultaneously looking back with autobiographical originals and cover songs that inspired him, while forging a forward trail with modern lyrics atop blistering blues-rock. With The Painkillers firing on all cylinders behind him, Castro lays it all on the line from the opening notes of Nonchalant to the final, introspective Live Every Day. From the autobiographical My Old Neighborhood to the socially aware Enough Is Enough and Fear is The Enemy to versions of Elvin Bishop’s Rock Bottom and Taj Majal’s Further On Down The Road (two of his favorite songs from his earliest heroes), Stompin’ Ground is pure musical pleasure. “As soon as we started cutting,” Castro says, “we knew we were onto something.”\n\nIn addition to the The Painkillers, Castro’s friends Charlie Musselwhite (harp and vocals on Live Every Day), Mike Zito (guitar and vocals on Rock Bottom), Danielle Nicole (vocals on Soul Shake) and Los Lobos’ David Hidalgo (guitar and vocals on Them Changes) add their talents to Stompin’ Ground. “I heard each one of my friends’ contributions to these songs in my head as I was working on them. Happily, when I reached out and actually asked, everyone said yes.”\n\nBorn in San Jose, California in 1955, Tommy Castro first picked up a guitar at age 10. He fell under the spell of Eric Clapton, Elvin Bishop, Taj Mahal, Mike Bloomfield and other blues-rockers. As he got older, Castro discovered the bedrock blues of Muddy Waters, B.B. King, Freddie King, Buddy Guy, Elmore James and the deep-rooted soul of singers like Ray Charles, Wilson Pickett and James Brown. By his teenage years, he was regularly heading to San Francisco to see his favorite artists at legendary venues like The Fillmore West and Winterland. He began playing in a variety of Bay Area blues and soul bands in his early 20s, making a name for himself as a hotter than hot live artist. In 1985 he became lead singer and guitarist for the locally popular blues band NiteCry, and began gigging regularly throughout Northern California.\n\nCastro joined Warner Brothers’ artists The Dynatones in the late 1980s, gigging all over the country. He formed the first Tommy Castro Band in 1991, releasing his debut album in 1996 on Blind Pig. He hit the road hard, picking up new followers everywhere he went. In the mid-1990s The Tommy Castro Band served as the house band for three seasons on NBC Television’s Comedy Showcase (airing right after Saturday Night Live), bringing him in front of millions of viewers every week. During the 1990s and into the 2000s, Castro released a series of critically acclaimed CDs for Blind Pig, Telarc and 33rd Street Records, as well as one on his own Heart And Soul label. \n\nCastro joined Alligator Records in 2009, releasing Hard Believer to massive acclaim. He won four of his six career Blues Music Awards including the coveted B.B. King Entertainer Of The Year Award (the very highest award a blues performer can receive). His song Hard Believer took first place in the blues category of the International Songwriting Competition. His next release, 2011’s Tommy Castro Presents The Legendary Rhythm & Blues Revue–Live!, was a boisterous and searing collection of highlights from a series of live performances anchored by Castro and an all-star collection of blues giants, including Rick Estrin, Michael “Iron Man” Burks and Joe Louis Walker. His relentless road-dog approach—gig after gig, night after night—has won him loyal, lifelong fans everywhere he plays. The Washington Post says Castro is “phenomenal and funky” with “soulful vocals and inspired blues-rock guitar.” \n\nCastro formed The Painkillers in 2012, creating a lean, mean four-piece lineup, capable of delivering soul-shaking, muscular music. The band released The Devil You Know in 2014 and Method To My Madness in 2015, with critics shouting praise and admirers cheering his every move. Castro had stripped his music down to its raw essence with the new, smaller band, sounding bigger than ever. On record and on stage, Tommy Castro & The Painkillers’ road-hardened, seemingly telepathic musicianship bring an unmatched passion to Castro’s blue-eyed California soul and hard-rocking, good-time songs. His hometown newspaper, The San Francisco Chronicle, describes Castro’s music as, “funky Southern soul, big city blues and classic rock...silvery guitar licks that simultaneously sound familiar and fresh.” \n\nWith months of tour dates across the U.S. and Europe, Tommy Castro & The Painkillers will be bringing the songs from their new album directly to their fans. No Depression says “Castro plays gritty, string-bending blues like a runaway soul train...a glorious blend that rocks the soul and lifts the spirits.” Blues Revue says simply, “Tommy Castro can do no wrong.” With Stompin’ Ground, he is clearly, once again, doing everything right.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/62/59/61-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1533024"},{"venue":"Neighborhood Theatre","event":"OH WONDER - Ultralife Tour","date":"10/06/2017","times":"Doors: 7:00 pm","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1498896-oh-wonder-ultralife-tour-charlotte/","desc":"English alternative pop duo, based in London. They rose to fame through Soundcloud, in which they had decided to post an original song every month, beginning on 1 September 2014. Each song was written, recorded, produced and mixed by the duo in their home studio in South-East London. These monthly installations culminated a year later in the release of their self-titled album, which also included two unreleased songs.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/44/04-og.jpg?w=100&h=100&fit=crop&crop=top","tix":"https://www.ticketfly.com/purchase/event/1498896"}]