[{"venue":"Neighborhood Theatre","event":"OH WONDER - Ultralife Tour","date":"10 06 17","times":"7:00 ","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1498896-oh-wonder-ultralife-tour-charlotte/","desc":"English alternative pop duo, based in London. They rose to fame through Soundcloud, in which they had decided to post an original song every month, beginning on 1 September 2014. Each song was written, recorded, produced and mixed by the duo in their home studio in South-East London. These monthly installations culminated a year later in the release of their self-titled album, which also included two unreleased songs.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/56/44/04-og.jpg?w=100&h=100&fit=crop&crop=top"},{"venue":"Neighborhood Theatre","event":"HEATHER McDONALD","date":"09 16 17","times":"7:00 ","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1521112-heather-mcdonald-charlotte/","desc":"Heather McDonald is one of the most in-demand and multi-faceted comedians today, who not only juggles a career as a nationally touring stand-up, actress, and accomplished writer, but is also a devoted wife and mother…when the rest of her family isn’t driving her up the wall.\n\nCurrently, Heather can be heard weekly on her sensational new podcast “Juicy Scoop” on PodcastOne.  Every week, Heather holds nothing back and gets the most surprising, scandalous, and intimate scoops from her celebrity guests. Heather has a hilarious way of delving into celebrity gossip, fancying herself a tabloid detective where if she can’t find the truth she’ll make it up herself.\nAs a stand-up comedian, McDonald continues to perform for enthusiastic fans all over the country. She opened for all 4 of Chelsea Handler’s sold out tours throughout the country from Carnegie Hall to Arenas up to 10,000.\n\nIn 2016 she just debuted her first Showtime special ‘I Don’t Mean To Brag,’ which achieved record ratings on the network and is currently streaming on Netflix. She gained a throng of loyal fans as a staff writer and for her regular roundtable appearances on E!’s top rated show ‘Chelsea Lately’. She also starred in After Lately, a mockumentary series on E! for 3 successful seasons. \n\nAs an author, Heather’s debut book (released June 2010), You’ll Never Blue Ball in this Town Again, spent seven weeks on the New York Times best-seller list, and climbed to the #1 position on Amazon’s “Bestsellers in Entertainment” list. McDonald released her follow up to Blue Balls in February 2013 titled MY INAPPROPRIATE LIFE: Some Material Not Suitable for Small Children, Nuns, or Mature Adults which also became a national bestseller. My Inappropriate Life is an irreverent account of McDonald’s attempts to balance fame with family time, all while doing it her way. Heather’s writing has also been featured in Redbook Magazine, Reader’s Digest, The Hollywood Reporter and she has contributed to New York Magazine’s Vulture.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/59/60/34-og.jpg?w=100&h=100&fit=crop&crop=top"},{"venue":"Neighborhood Theatre","event":"KILL THE NOISE [Opening Act: shlump, Yuki, Azira]","date":"09 15 17","times":"8:00 ","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1543533-kill-noise-charlotte/","desc":"Covering the EDM spectrum from electro house to dubstep, Kill the Noise is one of the projects from Rochester, New York-based producer Jake Stanczak. After finding dancefloor success under the name Ewun, Stanczak launched the spacier and more dubstep-oriented Kill the Noise in 2008 with the album Kill Kill Kill. Successful remixes of the hit Estelle and Kanye West track \"American Boy\" followed, while 2010 found him working with Jon Gooch on the Feed Me's Big Adventure EP, which was released by Deadmau5's label Mau5trap. In 2011 he partnered with Skrillex and co-produced two tracks for Korn's dubstep-oriented album The Path of Totality. A year later, focus switched to Kill the Noise's front-facing career, with both the Roots Remixed and Black Magic EPs dropping in 2012. In 2014 he collaborated with Skrillex and Fatman Scoop on the hit track \"Recess,\" and in 2015 he released the album Occult Classic, with guests like Dillon Francis and AWOLNATION. ~ David Jeffries, Rovi","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/02/64/67/36-og.png?w=100&h=100&fit=crop&crop=top"},{"venue":"Neighborhood Theatre","event":"PINK FLOYD LASER SPECTACULAR","date":"09 21 17","times":"7:00 ","tuneStub":"","href":"http://www.neighborhoodtheatre.com/event/1531548-pink-floyd-laser-spectacular-charlotte/","desc":"After 30+ years of touring, Paramount's Laser Spectacular has become a cult classic, presenting the music of Pink Floyd like you've never seen it before. Presented for the first time in 1986, producer Steve Monistere has established the Laser Spectacular as the longest running, touring theater show in history! Driven by cutting edge effects, Full Color Lasers, Hi-Def Multi-Screen Video Projection, Concert Quality Sound and Lighting Effects, your senses are confronted with an array of visual displays, choreographed to the soundtrack of the 2.5-hour show.\n\nViewed through specially designed 3-D glasses, the audience is drawn into this magical production, often singing along with the re-mastered sound track. The show has become a favorite with progressive rock fans of all ages. At most shows, parents are seen rocking out with their teenagers, as the Laser Spectacular brings together two generations of Pink Floyd music fans.","ticketfly":"","img":"https://image-ticketfly.imgix.net/00/01/95/96/37-og.jpg?w=100&h=100&fit=crop&crop=top"}]