[{"venue":"Jackalope Jack's Restaurant & Bar","event":"Boxing Day 2017 at Jackalopes!","date":"12/26/2017","times":"10:00 AM","tuneStub":"","href":"http://www.facebook.com/events/245711949285321","desc":"Boxing Day\nnoun\nDefinition of Boxing Day for English Language Learners\n\n    : a holiday that is celebrated especially in England and Canada on the first day after Christmas that is not a Sunday\n\nAnother reason to come and enjoy some cold beer specials at Jackalopes, we love all of our customers.  It's the day after X-mas so the more the merrier.   Serving cold beer of your choice with a full English Brreakast for only $15.","ticketfly":"","tix":"http://www.facebook.com/events/245711949285321"},{"venue":"The Rabbit Hole","event":"11/28 Dead And Co. After Party At The Rabbit Hole","date":"11/28/2017","times":"10:00 PM","tuneStub":"","href":"http://www.facebook.com/events/226902667836859","desc":"TBA, stay tuned!","ticketfly":"","tix":"http://www.facebook.com/events/226902667836859"},{"venue":"The Rabbit Hole","event":"Velvet Productions Presents: Pink Talking Fish 11/16 (2 sets)","date":"11/16/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/126645181276070","desc":"Pink Talking Fish seamlessly combine the music of Pink Floyd, Talking Heads, and Phish in a unique out of this world show! Founding Member Eric Gould you may know from the original Particle line up makes sure to keep it funky. TIcket link coming soon.\n$15 in advance $18 day of","ticketfly":"","tix":"http://www.facebook.com/events/126645181276070"},{"venue":"The Rabbit Hole","event":"The Southern Belles w/ Emma's Lounge at The Rabbit Hole","date":"11/09/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/2007931432770228","desc":"The Southern Belles \nSo many wild things have been said to describe The Southern Belles' music and live shows and it's all true. It's like watching a honky-tonk band fight a blues band with George Clinton as the referee. That's the best I can say too. If someone out there can describe the Belles' music in less than words than \"Oh my god, they melted my face,\" I invite you too. Floor is yours.\n-Doug Nunnally // RVA Magazine\n\nEmma's Lounge\nGet here early for Emma's Lounge a high energy folk/rock and roll band I had the pleasure of seeing at the Big What?! They mashed together Nine Inch Nails \"Closer\" with Justin Timberlake's SexyBack, and it was so fucking good I am typing about it right meow! Mark your calendars for 11/9\n\nhttp://thesouthernbelles.bandcamp.com/\nhttp://deliradio.com/the-southern-belles\nhttps://soundcloud.com/the-southern-belles\nhttps://www.youtube.com/user/southernbellesmusic\nhttp://www.reverbnation.com/thesouthernbelles\n$10/$12","ticketfly":"","tix":"http://www.facebook.com/events/2007931432770228"},{"venue":"The Rabbit Hole","event":"11/4 After Party with Machine Funk At The Rabbit Hole","date":"11/04/2017","times":"11:00 PM","tuneStub":"","href":"http://www.facebook.com/events/114219382587788","desc":"Machine Funk \n\"Tribute to Widespread Panic\" was formed in the summer of 2006 in Florence, SC. The band tours the southeast, night after night their set lists are never the same. With having over 120 songs in their repertoire you will not see the same show twice. They also include songs from Led Zeppelin, Black Sabbath, Talking Heads and many others. Machine Funk has shared the stage with musicians from The Dirty Dozen Brass Band, North Mississippi Allstars, Keller Williams and Jojo Herman of Widespread Panic. Each show is a musical journey that can't be explained, only experienced! We thank you for your support. See you on the road!\n\nShow 11pm-2am \n$10/$12 or $10 with your wristband from Oteil!","ticketfly":"","tix":"http://www.facebook.com/events/114219382587788"},{"venue":"The Rabbit Hole","event":"11/3 Machine Funk and Polecat Voodoo at The Rabbit Hole","date":"11/03/2017","times":"8:30 PM","tuneStub":"","href":"http://www.facebook.com/events/713361312192143","desc":"Machine Funk\n\nMachine Funk \"Tribute to Widespread Panic\" was formed in the summer of 2006 in Florence, SC. The band tours the southeast, night after night their set lists are never the same. With having over 120 songs in their repertoire you will not see the same show twice. They also include songs from Led Zeppelin, Black Sabbath, Talking Heads and many others. Machine Funk has shared the stage with musicians from The Dirty Dozen Brass Band, North Mississippi Allstars, Keller Williams and Jojo Herman of Widespread Panic. Each show is a musical journey that can't be explained, only experienced! We thank you for your support. See you on the road!\n\nPolecat Voodoo\nA Tribute to Little Feat featuring some of Charlotte's finest musicians!\n\n$10/$12","ticketfly":"","tix":"http://www.facebook.com/events/713361312192143"},{"venue":"The Rabbit Hole","event":"Randy and Mr. Lahey (Trailer Park Boys) + Matthew Silver 10/28","date":"10/28/2017","times":"7:00 PM","tuneStub":"","href":"http://www.facebook.com/events/1989335291296041","desc":"VOICE OF PIZZA Presents: Halloween! with Randy & Mr Lahey LIVE + Matthew Silver and Crackers And Snackmeat\n\n$20 ADV/$25 DoS\n\nRandy and Mr. Lahey LIVE (from the Trailer Park Boys) - www.facebook.com/randyandmrlaheyLIVE\n\nThe Randy and Lahey show is a silly, sexist, drunken hour and a half of songs and skits, audience participation, profanity, Shakespeare, and general hilarity. Over the past eight years it has developed into the fastest moving two man show in the known universe.\n\nFrom Newfoundland to Vancouver Island several hundred thousand people have thrilled to Randy and Lahey's shennanigins. It's a constantly moving showcase of two television icons who pull no punches when battering the audience with \"Batman and Robin\" or \"The Shit Rap.\" The innocent honesty of an out- of-control drunken ex-cop Trailer Park Supervisor and his side-kick Randybobandy the cheeseburger eating ex male prostitute, weekend Trailer Park Supervisor is pants pissing humour at its warmest.\n\nThe show itself is roughly based on the T.V. series and movies, but being live, necessitates a different format and different is the operative word here. There is nothing like it anywhere. Shit talk and poetry; sodomy and sweet talk all thrown together with music and mayhem. What more could a room full of fun seekers want.\n\nRandy and Lahey can do a toned down version but why bother. It's no fun that way. In other words; adult audiences only.\n\nMatthew Silver - www.facebook.com/matthewsilverlovefarts/\n\nMatthew Silver - Viral video star \"Accept yourself, love yourself\" and performance artist has made appearances on MTV Ridiculousness, and Adult Swim.  Currently on Netflix in Karl Pilkington's Moaning of Life second season.  His work promotes love with an added flavor of farts on the street and stage.\n\nHe has 301k plus followers on his Facebook page. https://m.facebook.com/matthewsilverlovefarts/\n\nHis most popular videos:\n\nWords of Wisdom from an Unexpected Citizen\nhttps://youtu.be/Y7rXlbHtcqM\n\nLove Is the Answer Stop Buying Stuff\nhttps://youtu.be/E5f5KEhwMjs\n\nLove Yourself, Accept Yourself\nhttps://youtu.be/Pzwv7kbopZw\n\nMatthew Silver The Great Performer\nhttps://youtu.be/ky1cvScWqng\n\n---------------------------------------------------------------------\nCrackers & Snackmeat\nhttps://www.facebook.com/Crackers-And-Snackmeat-105581977163/\n\nCrackers & Snackmeat are seasoned veterans to the Charlotte music and comedy scene. They were most recently the house band for the \"Crazy Late show with Johnny Millwater\". They have played with internationally touring comedian Doug Stanhope along with local and regional comedic talent such as Kerry White, Carlos Valencia, Joe Zimmerman, Tom Stover, Johnny Millwater, Jonas Garvin, and Allegra Barnett. They have carved out a solid niche with other comedy acts as well. It doesn't stop there as they have shared the stage with The LRC, Satta Tribe, Eyes of the Elders, One Big Love, Red Letter Blue, a little ugly, The Side, cul-de-sac, 20 Past 4, The Thought Criminals, Andy Wood, Case Federal & The Agents, Roots Essential, Matthew Paul Butler, The Lights Fluorescent, Wicked Jones, Tater Famine, Attila's Honey, SouthSide Punx, Dr. Cirkustein, Funky Geezer, Sherman Hellville, Rogue Planet, Run Engine, Spongecake & The Fluff Ramblers, and many others over the years.\n\nSince their inception they have stretched the musical boundaries with pounding funk grooves, laid back blues, and hard hitting hooks. Fearless in exploring different genres, from jazz to rock to metal as they continue to grow as a musical team.\n\nThe original line-up as put together in January 2008 by the now defunct Habitual Ritual Sketch Comedy Troupe was guitarist Phil Black and bassist Jason French (formerly backups at The Perch Comedy Club), drummer Chris \"SkeeZe\" Slezak from a myspace bulletin, and singer/actor/improv comedian James Lee Walker II. Drummer Colin Ray (Case Federal & The Agents, Sherman Hellville) joined the band in May of 2013 to replace Chris \"SkeeZe\" Slezak who relocated to Austin, TX. Bassist Steve Saldutte (Case Federal & The Agents, Plato's Stepchildren, Chris Sanchez Band, The House Cats) joined the band in December 2016 to replace Jason French.\n\nCrackers & Snackmeat released \"Down The Road\", their debut album with Milkjug Records in August 2009 and are currently working on their sophomore effort \"That's What's Up!\" due later this year.","ticketfly":"","tix":"http://www.facebook.com/events/1989335291296041"},{"venue":"The Rabbit Hole","event":"10/25 Buzzov-en, Earthride, Green Fiend, and POW Reunion Show","date":"10/25/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/169374926955986","desc":"10/25\nVelvet Productions Presents\n\nBUZZOV-EN\n\nEarthride\nPure Maryland doom for the brotherhood of music.\n\nGreen Fiend\nStoner Metal\n\nP.O.W.\nWeed Doom Metal\n\n$15, $18","ticketfly":"","tix":"http://www.facebook.com/events/169374926955986"},{"venue":"The Rabbit Hole","event":"The Nth Power and TBA at The Rabbit Hole","date":"10/14/2017","times":"8:00 PM","tuneStub":"","href":"http://www.facebook.com/events/109857493068566","desc":"Time2Fly Music Presents - The Nth Power at The Rabbit Hole \n\n$12 Presale\n$15 DOS\n\nThe Nth Power - Proving that soul music can be exponentially greater than the sum of its parts, The Nth Power is on a mission to share the light. Formed during an impromptu late-night jam at Jazz Fest 2012 in New Orleans, the relentlessly funky and soulful band believes in music as a higher power – tapping into an energy that is simultaneously sexy and spiritual, with songs that will inspire audiences to dance, groove, make love or just stand there with goose bumps.\n \nThe quartet hails from diverse musical backgrounds, races and creeds. Female powerhouse Nikki Glaspie was Beyonce’s world-touring drummer for five years before she joined Ivan Neville’s New Orleans outfit, Dumpstaphunk. Bassist Nate Edgar of Groovechild and John Brown’s Body perfectly compliments Singer and Guitarist Nick Cassarino who came from the Jennifer Hartswick Band and toured with Big Daddy Kane. Finally rounding off the ensemble is the newest and youngest member, Courtney J’Mell Smith who brings his soulful vocals and keyboard abilities to the table.\n \n“It’s my dream team,” says Glaspie. “Each one of us is a songwriter, so when we get together, everything becomes much stronger.” Beyond raw skill, however, Glapsie cites a deep spiritual connection as the glue that binds them together. “Music is what brought us together, but it’s the spiritual bond that makes us play so in touch with each other.”\n \nAt the core of their vibe is a deviously simple concept – the healing power of Love.","ticketfly":"","tix":"http://www.facebook.com/events/109857493068566"},{"venue":"The Rabbit Hole","event":"THE STONE FOXES at The Rabbit Hole","date":"10/07/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/1938018779745196","desc":"THE STONE FOXES at The Rabbit Hole","ticketfly":"","tix":"http://www.facebook.com/events/1938018779745196"},{"venue":"The Rabbit Hole","event":"Bassel & The Supernaturals at Rabbit Hole (Charlotte, NC)","date":"09/30/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/483298948696275","desc":"Join us for TWO SHOWS in Charlotte, NC c/o Time2Fly Music! We've got funk for days and can't wait to get down in the Carolina sunshine. Here's the full scoop, spread the word!\n\nSAT, 9/30; 9pm @ The Rabbit Hole\nw/ TBA | $10 ADV, $12 DOS | 21+\n\nSUN, 10/1; 12pm @ Heist Brewery\n\nBassel & The Supernaturals\n[Syrian Heart, Chicago Soul]\nwww.basselmusic.com\n---------------------\nBassel & The Supernaturals combines neo-soul and funk with captivating lyrics about love, loss, and a war in Syria that has affected Bassel Almadani’s family along with 10,000,000 others.\n\nThe soulful Syrian-American vocalist and his ensemble raised over $11,000 during the preorder campaign for their full-length album, Elements (2017), with over $3,000 in donations for humanitarian aid in Syria. Their album was premiered by Noisey (Vice) and led to their involvement in the nationally-acclaimed SXSW showcase ContraBanned: #MusicUnites featuring artists from the diaspora of the countries targeted by the travel ban. They've since been featured on PRI, Al Jazeera, Reuters, Paste Magazine, Huffington Post, NowThis, and many others. In addition to performing in clubs and festivals across the nation, Bassel partners with universities and charity organizations nationwide to host seminars, workshops, and benefit concerts drawing attention to the crisis in Syria.","ticketfly":"","tix":"http://www.facebook.com/events/483298948696275"},{"venue":"The Rabbit Hole","event":"Tony MacAlpine with special guest Felix Martin","date":"09/26/2017","times":"7:00 PM","tuneStub":"","href":"http://www.facebook.com/events/481764968842745","desc":"VIP Ticket Upgrades Available: http://t-m.ac/0926VIP\n\nTony MacAlpine is widely known as a guitar virtuoso who is just as skilled on the keys. \"Edge of Insanity\", one of fourteen solo albums, is still considered in the top ten shred albums of all time. Aside from his solo work, Tony has also been part of several rock supergroups including Planet X with Derek Sherinian and Virgil Donati, PSMS,(Portnoy/Sheehan/MacAlpine/Sherinian) as well as the Grammy nominated CAB with bassist Bunny Brunel and drummer Dennis Chambers. MacAlpine also spent seven years playing keys and duplicating Steve Vai’s formidable guitar leads in Vai's touring band.\n\nVenezuelan guitarist Felix Martin plays like no one else....literally! Martin is the only guitarist the world over to fuse two guitars into one creating both a style and sound unlike anything heard before. Mixing rock, metal, Latin, and progressive styles with jazz chops firmly plants Martin as the preeminent king of 14 and 16 string guitar.","ticketfly":"","tix":"http://www.facebook.com/events/481764968842745"},{"venue":"The Rabbit Hole","event":"Robot Johnson Sketch Comedy with Crackers & Snackmeat afterparty","date":"09/22/2017","times":"8:00 PM","tuneStub":"","href":"http://www.facebook.com/events/1465817903464168","desc":"Doors open at 8:00\nRobot Johnson Show starts at 9:00\nCrackers & Snackmeat after party happens after the Robot Johnson Sketch Comedy Show. \n\n21+\n\nParking in Plaza Midwood can be challenging, give yourself enough time to find parking.\n\nRobot Johnson is made up of an eclectic mix of actors, writers, stand ups, improv and sketch comedy veterans. That mix allows us to create original content shows that will have a little something for everyone and a lot of something for sketch fans.\n\nThe group formed in late 2007. Since then, they've written and produced well over a hundred original-content sketch comedy shows. Robot Johnson has over the years won a number of accolades, boons, pittances and windfalls such as a Metrolina Theatre Award in 2009, Charlotte Magazine's Best Sketch Comedy Group in 2010 & 2013, Funniest Twitter account in 2013, Funniest Instagram in 2014. In addition to delighting comedy fans in Charlotte, Robot Johnson performs in comedy festivals across the Southeast including the Charleston Comedy Festival, NC Comedy Arts Festival and Asheville's SketchFest.\n\nShows are rated R for content and language. Show runs approximately 70 minutes with no intermission.\n\nhttps://www.facebook.com/RobotJohnson/\nInstagram: robotjohnsoncomedy\nTwitter: RobotJohnson\n\nCrackers & Snackmeat\nhttps://www.facebook.com/pg/Crackers-And-Snackmeat-105581977163/\n\nCrackers & Snackmeat are seasoned veterans to the Charlotte music and comedy scene. Since their inception they have stretched the musical boundaries with pounding funk grooves, laid back blues, and hard hitting hooks. Fearless in exploring different genres, from jazz to rock to metal as they continue to grow as a musical team.\n\nThe original line-up as put together in January 2008 by the now defunct Habitual Ritual Sketch Comedy Troupe was guitarist Phil Black and bassist Jason French (formerly backups at The Perch Comedy Club), drummer Chris \"SkeeZe\" Slezak from a myspace bulletin, and singer/actor/improv comedian James Lee Walker II. Drummer Colin Ray (Case Federal & The Agents, Sherman Hellville) joined the band in May of 2013 to replace Chris \"SkeeZe\" Slezak who relocated to Austin, TX. Bassist Steve Saldutte (Case Federal & The Agents, Plato's Stepchildren, Chris Sanchez Band, The House Cats) joined the band in December 2016 to replace Jason French.\n\nCrackers & Snackmeat released \"Down The Road\", their debut album with Milkjug Records in August 2009 and are currently working on their sophomore effort \"That's What's Up!\" due later this year.","ticketfly":"","tix":"http://www.facebook.com/events/1465817903464168"},{"venue":"The Rabbit Hole","event":"End of Summer Reggae Party w/ TreeHouse, Sol Seed, Zach Fowler","date":"09/16/2017","times":"8:00 PM","tuneStub":"","href":"http://www.facebook.com/events/1426547180757711","desc":"TreeHouse\n\nSol Seed\n\nZach Fowler of Sun-Dried Vibes\n\n$10/$12","ticketfly":"","tix":"http://www.facebook.com/events/1426547180757711"},{"venue":"The Rabbit Hole","event":"Watkins Glen Tribute featuring Mojo Ruckus","date":"09/15/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/1911797952476178","desc":"In the summer of 1973, 600,000 people poured into the Watkins Glen Raceway in New York State.  According to The Guinness Book of World Records, at the time, this was the biggest show in history.  Through days of rain and other obstacles, The Band, The Grateful Dead, and The Allman Brothers Band played a show that would live on for ages.\n      We are pleased to announce that on September 15, over 44 years later,  The Rabbit Hole will take the chance at reliving some of that magic.  Our old friends Mojo Ruckus will be performing three sets that evening in tribute to all three of these amazing bands.  We hope to see you all there! Cheers\nDoors-8pm\nShow-9pm\n21+\n$10","ticketfly":"","tix":"http://www.facebook.com/events/1911797952476178"},{"venue":"The Rabbit Hole","event":"9/9 Randall Bramblett Album Release Show at The Rabbit Hole","date":"09/09/2017","times":"9:00 PM","tuneStub":"","href":"http://www.facebook.com/events/107209906531598","desc":"Randall Bramblett Peforms with his band at THe Rabbit Hole celebrating his newest album Juke Joint at the Edge of the World.\n$10/$12\n\nhttp://www.randallbramblett.com/\n“Randall is in my opinion the most gifted & talented southern singer-songwriter musicians of the past several decades.” —Chuck Leavell (Rolling Stones, Allman Brothers) \n\n\nThings hit high gear with the release of “The Bright Spots” on New West Records in 2013, charting well on Americana, Roots Rock and Triple A charts. Many critics wrote this is the best album of his career, and one of the top CD’s of 2013 including Sirius/XM’s The Loft, AllMusic.com, HITS Daily Double, The Americana Music Association, Cool Music & Movies, Wildman Steve Radio show, Australia’s Rhythm’s Magazine, WFPK and Al Kooper. \n\nNo matter how many legends he has been involved with his music evolves, keeping a modern and cutting edge sound. Looking forward to his newest CD, \"Devil Music\" out in September '15 on New West. Bramblett’s already shining star continues to rise.","ticketfly":"","tix":"http://www.facebook.com/events/107209906531598"},{"venue":"The Peculiar Rabbit","event":"Weekend rooftop DJ!","date":"09/08/2017","times":"10:00 PM","tuneStub":"","href":"http://www.facebook.com/events/1928028974131778","desc":"Thats right you guessed it by the picture...LIve DJ energy and music every Friday and Saturday.  Jamming Music with Jamming views of downtown.  Cold drinks and a great flavor of local and national beers served on our third floor patio.  Come early stay late.  Rob out.","ticketfly":"","tix":"http://www.facebook.com/events/1928028974131778"},{"venue":"The Peculiar Rabbit","event":"All you can eat Rib Mondays!","date":"09/04/2017","times":"5:00 PM","tuneStub":"","href":"http://www.facebook.com/events/112230606112191","desc":"We are trying something new for size,  one of our best chefs and all around good guy Sheldon is creating some slamming smoked ribs with home made BBQ sauce and because we got a good price on them we are offering a all you can eat in house special.  Comes with fries and coleslaw.   This is Mondays only for a trial period of two months.  Don't forget we have a DJ every Friday and Saturday., And Brunch Saturdays and Sunday.  Come  early and stay late.  Rob out.","ticketfly":"","tix":"http://www.facebook.com/events/112230606112191"},{"venue":"The Rabbit Hole","event":"Labor Of Love Fest feat Sam Holt Remembering Mikey & More","date":"09/03/2017","times":"5:30 PM","tuneStub":"","href":"http://www.facebook.com/events/267035140464956","desc":"Time2Fly Music presents Labor Of Love Fest feat Sam Holt Band - Remembering Mikey \nHonoring The Music, Memory & Sprit of Michael Houser - 15th anniversary\n\nSoul Mechanic\nVoodoo Visionary\nPolecat Voodoo\n\nCOVER:\t$12 adv - $15 dos\nDOORS: 6\nSHOW:\t7\nAGES: all with parent","ticketfly":"","tix":"http://www.facebook.com/events/267035140464956"}]