[{"venue":"The Visulite","event":"BIRDTALKER & BECCA MANCARI","date":"09 06 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2575","hrefRef":"","desc":"Birdtalker is Zack and Dani Green, Andy Hubright, Brian Seligman, and Jesse Baker.\n\nZack and Dani were married in 2012 and soon after their wedding tried writing a couple songs together. They liked it, so they wrote a couple more. Andy, a friend from college and very talented drummer, was into the songs and started beating on stuff while Zack and Dani played them. It sounded good. While these 3 were playing the songs at Shakespeare in the Park one August afternoon, Brian became interested in adding his immense talent to the mix as well and began playing along with mandolin and guitar. It sounded even better. Birdtalker as these 4 members wrote and practiced for about a year when yet another talented friend and Birdtalker's biggest fan, Jesse, expressed interest in lending his bass sounds to the band. It is the combination of each member's specific offerings that gives Birdtalker the life and sound that it now possesses. And it doesn't hurt that they all like each other a heck of a lot, too. \n\nZack and Dani write songs as a way to share ideas they care about and sentiments they feel deeply. Playing music has proven to be a powerful avenue for connection and communion, within the band as well as with listeners. Birdtalker's hope is simply that the more music they write and share, the more true and vulnerable interactions may be born from it.\nBecca Mancari is rewriting the rules.\n\nBorn in Staten Island, New York, to an Italian-Irish preacher and a Puerto Rican mother, Mancari has lived a life of transition - from working as a janitor in South Florida, to writing songs with train hoppers in the Blue Ridge Mountains and seeking spirituality in India. But it was her time in Virginia and Nashville where she found the roots music that would continue to inspire her musical evolution to today. \n\nHer anticipated debut album, \"Good Woman,\" is hauntingly lonesome, with dust-cloud swells of electric guitar and don't-look-back lyrics revealing scenes from Mancari’s well-travelled story. She recalls, “I remember being 19, and I would go to this old warehouse where a bunch of old timers would be siting around picking and drinking moonshine...and we are talking straight up moonshine.\" During this time, Mancari's curiosity to see the world with eager, fresh eyes grew, drawing her to travel and experience all types of people and places. Her travels would inevitably impact her music; since her music is the landscape of all she's seen, “Good Woman” evokes the sound of city grit and the mountain music of her youth, swirling into a fresh, nostalgic sound. \n\nMancari explains that she wants her music to be familiar to audiences, but also pushing creative boundaries, rewriting the rules for her genre. She explains, “Our hope is that we’re doing something that respects the roots but also has space and the galaxy in it.” It's these planetary frontiers, along with the powerful fragility in her voice, that make Mancari's music beyond standard classifications.\n\nPerhaps more striking than Mancari’s sound is the tender honesty and vulnerability present in each of her songs. Ann Powers describes Mancari’s writing as \"lyrical and raw,\" commenting on the \"great personality in her songs.\" As a gay woman in the south, she has fought hard to reconcile her spiritual beliefs with her sexuality. Her strong personality enables her to be a spokeswoman to the outcast and the misfit, helping her redefine the categories that so often divide people. Mancari explains, “It was not an easy road when I came out. No matter how hard I tried to fit into society’s molds, I could not. I want to be open and proud of who I am, because I needed people like that in my life when I was young.” Mancari hopes that people will find the bravery in her story and be able to discover their own inner strength. \n\nWhen Mancari sings, she shines with authenticity. It is evident that Mancari knows exactly who she is, and her music has a strong sense of identity. But it is her refusal to subscribe to molds and societies trends that sets Mancari apart. Mancari is challenging all of us to throw away the old book and create a new genre of music. \n\nIn a short time, Mancari has made a name for herself in Nashville and the southeast. She has toured and played with Margo Price, Hurray For The Riff Raff, The Lone Bellow, SUSTO, Joan Osborne, The Weeks, and more.\n","img":""},{"venue":"The Visulite","event":"JESSE COLIN YOUNG","date":"11 12 17","times":"6:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2643","hrefRef":"","desc":"PRICES BEGIN AT $25.00 -CLICK HERE FOR MORE INFO AND TICKETS\n\nPRESENTED BY: MAXXMUSIC, VISULITE THEATRE & BLUMENTHAL PERFORMING ARTS\n\nFor 50 years Jesse Colin Young has been singing songs about peace, relationships and the environment. From his folk days in Boston and his first record, Soul Of a City Boy, he has articulated and recorded the tumultuous times of the 60s, 70's, 80's to the present, while reminding us that it is all about family, community and the precious natural world we live in. His musical style is now considered Americana, but in fact it's his unique fusion of jazz, blues, folk and rock with an emphasis on his extraordinary voice that makes his signature sound.  \n","img":""},{"venue":"The Visulite","event":"THE MONDAY NIGHT ALLSTARS","date":"09 11 17","times":"8:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2632","hrefRef":"","desc":"","img":""},{"venue":"The Visulite","event":"ABBEY ROAD LIVE!","date":"09 23 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2622","hrefRef":"","desc":"Abbey Road LIVE! Beatles Tribute\n-------------------------\n\"one of the world's premier Beatles cover bands”\n        -US News and World Report, December 2012\n\n\"unquestionably expert at what they do”\n        -Indyweek, September 2013\n-------------------------\nSince 2002, Abbey Road LIVE! has been rocking the music of The Beatles. Initially a tribute to the monumental \"Abbey Road\" album, the band has expanded its repertoire to include more than 150 Beatles tunes, from all eras of the Fab Four's career.\n\nThis is not your typical Beatle look-alike tribute act; don't expect mop-top haircuts and fake British accents. Rather, an Abbey Road LIVE! show is about bringing to life some of the more mature and complex Beatles material in a raw & spirited fashion, while remaining true to the original recordings. Combining attention to detail with a creative exuberance, the band always delights its audiences with its diverse repertoire of hits and more obscure favorites.\n\n\"A splendid time is guaranteed for all!\"\n","img":""},{"venue":"The Visulite","event":"10th ANNUAL SPASTA! GREEK NIGHT","date":"09 09 17","times":"9:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2639","hrefRef":"","desc":"Opa! 10 years and going strong! CarolinaGreeks.com invites you to the longest-running annual Greek party in the Carolinas... The Annual Greek Fest Weekend Greek Night, “Spasta!” 2017!\n\nNEW additions this year include enhanced lighting & visuals by PRISM live design. Smile for the camera :) A professional photographer & videographer will be on location to capture the night’s festivities.\n\n*** MUSIC ***\nFeaturing sounds by DJ's Thanasti + Kosta X\n• All the chart-topping Greek & International music hits from this summer in Greece & across the globe\n\nTICKETS\n","img":""},{"venue":"The Visulite","event":"WILL HOGE & DAN LAYUS","date":"09 08 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2552","hrefRef":"","desc":"\"Took a whole lot of miles to know what I know now,\" sings Will Hoge on \"Growing Up Around Here,\" the opening track off of his tenth studio album, Small Town Dreams. \"I'm kinda proud of growing up around here.\" It's been a whole lot of miles, indeed: miles on the road, driving the bus himself from venue to venue since the nineties; miles to and from Nashville writing rooms, where he's spent countless hours penning songs – some for him, some for others; miles exploring lands outside of his native Franklin, Tennessee, chasing the spirits of his musical heroes. Roads meet, roads split, roads led to home. This is the album that follows them all, every twist and turn in Hoge's American journey – a journey that's positioned him as one of our keenest, most honest modern storytellers, telling both his tale and ours. \n\n\"It's a reflection of where I am currently in my life,\" says Hoge of Small Town Dreams, \"but also where I grew up, and, ultimately, where I think I'm going.\" From the streets of the town where he was raised, to the sidewalks of cities a hundred times the size, we all have dreams; and these are the stories of growing up, looking back and passing on those dreams, told as only Hoge can. Nostalgia, in his hands, is truly magic. \n\nAn extremely prolific songwriter with ten albums under his belt and countless songs written for others (including a Grammy nomination for Eli Young Band's number-one hit, \"Even If Breaks Your Heart,\" co-written with Paslay), Hoge saw this next phase of his journey as an opportunity to explore even deeper into both his country and rock & roll roots. Never fitting particularly neatly into a genre box, he's always just made the music that moved him – but it's safe to say that he feels more kinship with the country community than ever, particularly as a storyteller. \n","img":""},{"venue":"The Visulite","event":"APOCALYPTICA – PLAYS METALLICA BY FOUR CELLOS TOUR","date":"09 08 17","times":"7:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2547","hrefRef":"","desc":"PRICES BEGIN AT $25.00 -CLICK HERE FOR TICKETS\n\nPRESENTED BY: MAXXMUSIC, VISULITE THEATRE & BLUMENTHAL PERFORMING ARTS\n\nOn May 10, 1996 Finnish Rockers, Apocalyptica, released their epic debut Plays Metallica By Four Cellos. The instrumental cello-driven rock opus changed the landscape of heavy music for years to come. To celebrate the 20th Anniversary of the album, the group is re-releasing it remastered with 3 bonus tracks on July 22, 2016.  Added to this new version will be brand new/never-before-released instrumental recordings of \"Battery,\" \"Nothing Else Matters\" and \"Seek & Destroy.\" The album will be available on vinyl (2 LP set) for the first time in many years. Upon its release, Plays Metallica By Four Cellos was a new approach to the hits of the biggest metal band the world has seen. Even more Apocalyptica created their very own genre and laid the foundation to a career that has lasted for 20 years so far with millions of records sold and sold out shows around the world. Apocalyptica will remain staying on the road supporting their latest album release 'Shadowmaker' until the end of 2016 with shows in USA, Europe, Australia, and Latin America. In 2017 the band will return with special anniversary shows to celebrate the 20th anniversary of Plays Metallica By Four Cellos.\n \n","img":""},{"venue":"The Visulite","event":"COSMIC CHARLIE - HIGH ENERGY GRATEFUL DEAD","date":"09 15 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2621","hrefRef":"","desc":"\"Cosmic Charlie really is a great band - these guys do this music the way it should be done: having the conversation in their own voices.”\n \n-David Gans, Grateful Dead Hour\n \nCosmic Charlie was born in the musical Mecca of Athens, Georgia. From its summer 1999 inception, the band swiftly cemented its reputation as a band that puts a unique and personal twist on the Grateful Dead catalogue, a Dead cover band for folks that are ambivalent about Dead cover bands. Rather than mimicking the Dead exactly, Cosmic Charlie chooses to tap into the Dead's energy and style as a foundation on which to build. The result is healthy balance of creativity and tradition, and both the band and its audience are taken to that familiar edge with the sense that, music is actually being MADE here tonight.\n \nMoving and shaking even the most skeptical of Deadheads, Cosmic Charlie storms into a town and plays with an energy that eludes other bands, an energy that often eluded the Dead themselves. Those precious moments during Dead jams when the synchronicity is there and all is right with the world, these are moments that Cosmic Charlie relishes and feverishly welcomes with open arms. Clearly, Cosmic Charlie's audiences are also eager to arrive at those moments, and together with the band, they have indulged in many memorable evenings.\n","img":""},{"venue":"The Visulite","event":"THE SPACE COWBOYS & THE COSMIC GIRLS (JAMIROQUAI TRIBUTE)","date":"09 22 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2577","hrefRef":"","desc":"Hailing from Asheville, NC, the Space Cowboys & the Cosmic Girls is the South's premiere Jamiroquai Tribute.   This 11 piece collective of musicians come from diverse backgrounds which has shaped this dance-funk powerhouse. Many members come or came from other Asheville groups, such as Empire Strikes Brass, Jahman Brahman, Deja Fuze, Sister Ivy, Hank West & the Smoking Hots, and Story Daniels.\n\nThe Space Cowboys and The Cosmic Girls have packed venues and rocked festival stages in North Carolina, Virginia, and Tennessee.  With a powerful stage presence and a full spectrum of sound, The Space Cowboys and The Cosmic Girls deliver explosive and memorable performances.  \n","img":""},{"venue":"The Visulite","event":"BIG SOMETHING & TREEHOUSE!","date":"10 26 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2634","hrefRef":"","desc":"BIG SOMETHING IS ...\n\nNick MacDaniels - Guitar, Lead Vocals\nJesse Hensley - Lead Guitar\nCasey Cranford - Sax, EWI\nJosh Kagel - Keys, Trumpet\nDoug Marshall - Bass\nBen Vinograd - Drums\n\nCameron Grogan - Sound & Lights\nPaul Interdonato - Lyricist\n\nA 6 piece powerhouse with a sound that is both unique and timeless, BIG Something fuses elements of rock, pop, funk, and improvisation to take listeners on a journey through a myriad of musical styles. It's no secret why this group has quickly become one of the most exciting new bands to emerge from the Southeast. Soaring guitars, synths, horns and alluring vocal hooks rise to the top of their infectious collection of songs and represent a sound that has caught the ears of such revered Summer circuit stalwarts as Umphrey's McGee, Galactic, moe., Robert Randolph, and even The B52s who have all tapped Big Something as direct support.\n\nIn February 2017 the group released their 4th full-length studio album, Tumbleweed, which was recorded once again with the help of grammy nominated producer John Custer (Corrosion of Conformity). He has produced all of their albums including Truth Serum, which was named 2014 Album of the Year by The Homegrown Music Network, making Big Something the only band ever to win this award 3 times with 3 different releases (2010, 2013, and 2014). BIG Something has been featured in Relix Magazine, Guitar World, Glide Magazine, JamBase, ArtistDirect, and more.\nForming in 2010, American Reggae Jam Rock band TreeHouse! has performed hundreds of shows a year throughout the country, introducing established reggae, rock and jam band scenes to a brand new fusion of sounds. These road warriors have shared the stage with top names and international acts in both genres, including 311, Dirty Heads, Steel Pulse, SOJA, Pepper, Stick Figure, Kung Fu, The Mantras, The Wailers, Tribal Seeds, and more.\n\nThe TreeHouse! single, \"Blessings\" was picked by Stephen Marley and Ky-Mani Marley as one of the top 10 songs out of hundreds of contestants in the Marley's Music Uprising, because they felt this song exemplified the spirit of Bob Marley.\n\nTreeHouse has released two official studio albums, \"Growth\" (2013) and \"Lifted\" (2015), with another on the way, thousands of US fans and growing, and solid touring across the country.\n","img":""},{"venue":"The Visulite","event":"MOUTH SOUNDS - ALBUM RELEASE & TBA","date":"09 21 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2598","hrefRef":"","desc":"“Don’t get carried away with the words on the page, they’re just words anyway,” asserts Daniel Howie on ‘In The Night,’ the first single from his new project Mouth Sounds.  Howie, former front-man of Charlotte, NC’s revered alternative rock band Sugar Glyder, transitions effortlessly into indie-pop territory on the projects debut album Sing or Swim.\n\n\nIn the early 2010’s Sugar Glyder transcended to national success with an appearance at SXSW, tours with Paper Route and The Almost, and high-profile opening slots for artists such as Neon Trees, Silversun Pickups, and Manchester Orchestra to name a few. In addition to national attention, the band is also often credited for defining the local music scene in their hometown of Charlotte, NC during the heavy alt rock era that dominated most of the late naughts.  \n\n\nLyrically, the album retains Howie’s signature cryptic messaging while knee-deep in his trademark metaphors and imagery. The beats are complex and challenging but a partnership with drummer-producer Mark Eckert brings everything to a politely packaged final form. It is within this stark juxtaposition that Mouth Sounds finds it’s identity. First time listeners are greeted by polished indie-pop gems, but those who choose to dive deeper will uncover the pull towards chaos and leave wondering if the band is really in control at all. This uncertainty reflects the projects genuine appeal. Where other rock-to-pop transitions feel like complacent appeals to relevancy, Howie is still digging, exploring, and ultimately, still having fun. \n \nHuman Resources is a new-wave dance rock band from Charleston, South Carolina. The band utilizes a contemporary approach to writing and producing its music, incorporating new tones and technologies to create accessible songs that are deeply engrained with dance and heavy groove sensibilities.\n\nAs the flagship project of Charleston based record label, Coast Records, the individual members of H? frequently lend their services, both as producers and session players, to a wide variety of musical acts in the area, an effort that has resulted in a comprehensive understanding of both the conceptualization and execution of a complete musical product. While the sound is instantly accessible, the band’s emphasis on layered, textural grooves allows listeners the opportunity to find new moments of excitement within each experience.\n\nHuman Resources’ live shows further reflect the band’s eye for concise and professional production. In addition to varying set lists, song manipulation, and intricate segues, each show also contains unique lighting and visual elements.\n","img":""},{"venue":"The Visulite","event":"THE MYSTICS' BALL - MASQUERADE","date":"09 01 17","times":"9:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2614","hrefRef":"","desc":"Since the beginning of time, secret societies have existed to seek power, enlightenment and hidden knowledge. Take a step into the surreal and leave your inhibitions at the door, as we transport you to a world of bizarre sensual acts and taboo earthly pleasures. Welcome to our circle!\n\nMandyland Presents. . . \n~ The Mystics' Ball ~ Masquerade ~\n\nThis is a costumed ball. Formal, fantasy, carnival, goth, fetish, or traditional/folk guises are encouraged. Fancy lingerie is perfectly fine, as long as your naughty bits are covered. \nBusiness wear is acceptable, athletic wear is not. \nIf in doubt, wear black. \nMASKS ARE REQUIRED until midnight.\nIf you do not bring a mask, you may purchase one at the door. Proceeds will be donated to local charity.\n\nWe enjoy the company of diversity. LGBTQ, Straights, Swingers, Kinksters, Rennies, and Cosplayers of all shape, size, race, and creed are welcome!\n\nEntertainment lineup TBA. . . \n\n~This event is LGBTQ+, Kink, Drag, Swing, and Swirl Friendly!~\n","img":""},{"venue":"The Visulite","event":"THE WHITE BUFFALO & TBA","date":"02 11 18","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2633","hrefRef":"","desc":"\"I've always taken great pleasure in being difficult to categorize,\" says the White Buffalo's big-voiced frontman, Jake Smith. Since releasing his first album in 2002, Smith has explored the grey area between genres, carving out a sound rooted in dark folk, countrified soul, cinematic storytelling and roadhouse-worthy rock. He keeps things unclassifiable on the White Buffalo's sixth album, Darkest Darks, Lightest Lights, the most hard-hitting, electrified album of his career. \n\nAlthough recorded in Smith's hometown of Los Angeles, where he grew up listening to the country twang of George Jones and the pissed-off punk of Bad Religion, Darkest Darks, Lightest Lights looks to the passion and punch of White Buffalo's live shows for inspiration. Smith has been a road warrior for more than a decade, doubling as his own tour manager along the way. Gig after gig, he's built a cult following without a major label's support, boosting his band's international visibility with more than a dozen TV-worthy songs — including the Emmy-nominated \"Come Join the Murder\" — that were featured on shows like Sons of Anarchy and Californication.\n\n\"I'm kind of an island,\" he says proudly. \"We tour on our own and have built our own fanbase, so the idea with this album was to capture that live feel — the passion that we produce in a stage setting — in a studio performance.\"\n\nIsland or not, Darkest Darks, Lightest Lights finds Smith reaching far beyond his own experience for a string of detailed, character-driven songs. Many of these tunes explore the gloomy, dangerous corners of America, spinning stories of sinners, crooks, bad decisions and broken hearts. On \"Border Town/Bury Me in Baja,\" a drug dealer awaits his death at the hands of the Mexican mafia. \"Avalon,\" a desperate, driving anthem worthy of Bruce Springsteen, finds its protagonist \"wishing he could flip a switch [and] turn his life around.\" \"Nightstalker Blues\" — an amped-up blast of harmonica-filled, guitar-fueled roots rock — revolves around the story of serial killer Richard Ramirez, whose murder spree haunted southern California during the mid-Eighties.\n\nAs the album's own title promises, though, this is a record about balance. A record about life's ups and downs. \"I wanted to hit all the emotional spots,\" explains Smith, whose voice — a booming, rumbling baritone, with a slight quaver that can sound ominous one minute and warmhearted the next — takes a tender turn during love songs like \"Observatory\" and \"If I Lost My Eyes.\" \n\nTogether, Darkest Darks, Lightest Lights offers up the White Buffalo's strongest material to date, doubling down on Smith's strengths while pushing his sound into new territory. Stripped-down folk. Electrified swamp-soul. Heartland rock. Bluesy boogie-woogie. It's all here, tied together by the super-sized vocals and articulate songwriting of a bandleader whose work is sometimes moody, sometimes menacing, but always melodic \n\n\"My hope is that this album will touch people,\" he says. \"Make people feel. The good, the bad, and the ugly. The darkest darks, and the lightest lights.\"\n","img":""},{"venue":"The Visulite","event":"GREG HUMPHREYS ELECTRIC TRIO & TBA","date":"09 24 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2642","hrefRef":"","desc":"Music fans are familiar with Humphreys’ songs, voice and guitar from his years leading North Carolina faves Dillon Fence and Hobex. With songs influenced by the best in pop, funk, soul, R&B, and rock n' roll, you might find Greg Humphreys Electric Trio in the same idiosyncratic corner of the big Americana tent where you'd find Alabama Shakes, Chris Stapleton, Sharon Jones & the Dap-Kings, or the North Mississippi Allstars\n","img":""},{"venue":"The Visulite","event":"HAYDEN JAMES & BAYNK","date":"11 17 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2628","hrefRef":"","desc":"Hayden James may have only released his first track in late 2013, but he has already amassed 30 million plays across Soundcloud and YouTube for his work. Producing immense summer jams with soulful and evocative vocals his music has stockpiled consistently rave reviews from the US, Europe and Australia alike, being labelled the “face of the new Australian production music scene”. Hayden’s first single “Permission to Love” garnered worldwide love and attention hitting #1 most blogged on Hype Machine, as well as becoming the most played track on national broadcasting giant Triple J in Australia.\n\nIt is still early days for Hayden, with just the one EP, a string of remixes out on tastemaker label Future Classic and a 60 date 6 country tour, but with BBC Radio 1’s Pete Tong labelling “Something About You” a song to watch in 2015, Triple J again making the single their most played over summer, and a visually stunning live show to boot, it seems like everyone wants a hit of Hayden’s love….\n\n \n\nPresented in conjunction with LiveNation.\n","img":""},{"venue":"The Visulite","event":"KEN BLOCK & DREW COPELAND (of SISTER HAZEL) & TBA","date":"10 28 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2638","hrefRef":"","desc":"Ken Block and Drew Copeland, best known as two of the five members of the platinum-selling southern rock band Sister Hazel are available for intimate acoustic shows. The shows are reminiscent of their earlier performance daysplaying the club and coffee shop circuit as a duo from Gainesville, Florida. The show take fans through intimate acoustic performances of Sister Hazel favorites, a few “B sides” and deep cuts, and new material that writers have called “some of the freshest new music to come out of Music City”. No evening with Ken and Drew would be complete without lots of laughs and some crafty storytelling, all delivered using their well-known wit. \n","img":""},{"venue":"The Visulite","event":"BAD DADDIES & HAD MATTERS","date":"09 16 17","times":"7:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2641","hrefRef":"","desc":"Bad Daddies are back! This year's BIG event will certainly bring the house down!!!! Joining the Bad Daddies is Chapel Hill's one and only, Had Matters. The BDs are bringing the heat with several special guests...so get right for the big night!!!\n\nHad Matters is pushing a similarly aggressive agenda, bringing in all the original members to celebrate the band's 30th Anniversary!!!\n\nThis will be an EPIC night!!!\n\nWe hope that you will join us in an evening of unparalleled energy and excitement, as the bands supply the gas in the tank for the ultimate \"Wayback Machine\"!!!\n\nTICKETS ON SALE NOW!!!! ...get 'em quick, because this show will sell out!\n\nThe Bad Daddies are a five-piece rock-n-rolla-funk-n-disco-make-you-shake-it party band based in Charlotte, NC and barnstorming through villages, hamlets, cities and towns across the Southeast.  The BDs have spent more than fifteen years ensuring that every event with which they are involved receives the appropriate amount of schwee.  We would love to help you ice the cake of your next banquet, wedding, birthday party, fundraiser, gala, boat christening, roof raising or crop harvest.  Our only objective is to help you and your guests have the best time possible under the generally accepted moral codes of decent behavior.\n\n \n\nTICKETS\n","img":""},{"venue":"The Visulite","event":"SAMMY J & ANUHEA","date":"10 13 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2625","hrefRef":"","desc":"Sammy J currently resides in Auckland. His mother is Australian and his father is Maori hailing form Ngati Raukawa, Waikato. Born and bred in Aussie he describes himself as a 'Mozzie' but proud and confident in his identity and embraces his maori and Polynesian heritage and roots which influenced his perspective on life.\n","img":""},{"venue":"The Visulite","event":"GONDWANA VIP","date":"10 17 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2604","hrefRef":"","desc":"","img":""},{"venue":"The Visulite","event":"VITA AND THE WOOLF & TBA","date":"10 12 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2624","hrefRef":"","desc":"Inspired by the love relationship between novelists Vita Sackville-West and Virginia Woolf, Philadelphia’s Vita and the Woolf just released their long-awaited new album, Tunnels on June 16 on Believe Global Label Services.\n\nThe project has received widespread critical acclaim, among others finding a fan in M83 who wrote about them for USA Today as well as recently being dubbed a “Band You Need To See” by Billboard. A dynamic and cerebral collection of soulful pop, the album touches on power dynamics in relationships and society as well as sexual discovery and empowerment.\n\nDriven by the anthemic voice of front woman, Jennifer Pague and supported by the dynamic drumming of Adam Shumski and guitar stylings of Dane Galloway, Vita and the Woolf has been melding cross-genre influences in their powerhouse electronic style since the first EP Fang Song was released in 2014.\n\nThe band’s head-turning live show has since grown to reflect both the range of Pague’s vocals and the music’s shape shifting energy. In 2016 and 17 they have toured with Rasputina, Clap Your Hands Say Yeah, and Bell X1 with other festival appearances scheduled for summer 2017 including Firefly Music Festival.\n","img":""},{"venue":"The Visulite","event":"THE SHADOWBOXERS","date":"11 05 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2578","hrefRef":"","desc":"The Shadowboxers have a passion for captivating lyrics, tight harmonies, and soulful vocals. Founding members Scott Schwartz, Matt Lipkins, and Adam Hoffman experienced an almost-instantaneous musical compatibility when they first started writing together. Together with bassist Carlos Enamorado and drummer Cole McSween, they've forged a cohesive sound based on a shared reverence for the strong, taut harmonies of Simon & Garfunkel, D'Angelo, and The Beatles. This young band's unified sound has an R&B-soaked, smart perspective replete with an abundance of vocal talent and songwriting skill. In the short time they've been playing together, The Shadowboxers have found a collective voice that is intelligent, soulful, and catchy.\n \n","img":""},{"venue":"The Visulite","event":"THE WEEKS & JUNIOR ASTRONOMERS","date":"10 20 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2620","hrefRef":"","desc":"High-energy, back-to-basics rock & roll. That's the sound of Easy, The Week's long-awaited followup to their breakthrough album, Dear Bo Jackson. Recorded at Ardent Studios in Memphis — a place filled with the ghosts (and gear) of the Replacements, ZZ Top, and Big Star, all of whom traveled to Ardent to create their own landmark albums —Easy finds The Weeks doubling down on a mix of groove, grit, and guitars. It's swaggering and sharply-focused, shining new light on a band of brothers who, although still in their mid-20s, have already logged a decade's worth of sweaty gigs together.\n\nIf Easy bears resemblance to the raw, rowdy attitude of the The Weeks' live show, it's because the album was written at the end of a busy, five-year period that found the group rarely leaving the road. \"We moved to Nashville in 2010,\" remembers frontman Cyle Barnes, who formed the band in Jackson, Mississippi, with his three longtime bandmates: drummer (and twin brother) Cain Barnes, guitarist Sam Williams, and bass player Damien Bone. \"We spent 2011 to 2015 touring. November 2015 was the first time we ever spent an entire month in Nashville.\"Those years on the road were eye-opening for The Weeks, all of whom were just teenagers when they began playing together in 2006.\n\nBy their early 20s, the guys were touring Europe with Kings of Leon, promoting the newly-released Dear Bo Jackson in front of 20,000 people each night. Back in America, The Weeks continued playing their own club shows, too. The experience taught them how to bridge the gap between arena shows and smaller gigs. In short, it taught them how to be themselves, no matter the audience.\nJunior Astronomers. A consistency in disorder breathes into existence a quintet bound to the loud and impulsive. Gritty and jangled on some occasions, then mangled and diverting in others. The only thing planned is the outburst itself.\n\nA hypnotic trance is created through guitars painted heavy and a rhythm section bound for movement, but beneath the distortions and muddled screams Junior Astronomers seek to achieve more than just reactions from onlookers; the band itself tries to document the human experience. \"Music needs to sound like human beings, like it's alive,\" frontman Terrence Richard declares. \"A lot of people want to make sad shit all the time--that's one part of life but it's not all life. There's fun, there's happiness, there's sadness.\"\n\nOn stage the mess of humanity is embraced through a livid live show—devoid of controlled manipulation each night's set stumbles onto new devices. Passion bleeds over lofty construction making sure the songs themselves are the frame. The rest is unhinged and never over thought. \"If something is forced it feels like a job,\" the band echoes.\n\nContinually on the move since forming in 2007, with only two EPs to their name, Junior Astronomers have toured and shared stages with the likes of Harvard, The Weeks, Dignan, Color Revolt, Des Ark, and Polvo. Poised to not take a break in the near future the North Carolina natives bring with them a promise, there is an elemental energy that lies in-between art and craft.\n","img":""},{"venue":"The Visulite","event":"HUMMING HOUSE & BECCA MANCARI","date":"11 09 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2623","hrefRef":"","desc":"Turning on the radio, computer, or television can seem like a gamble, at best. Each new tuning offers a deluge of anxieties to greet us. In the face of this 21st century tumult, Humming House is on a quest. They do not want to wish away the pain and fear all too real in our lives, but to put those elements in conversation with the elements that sustain us: hope, partnership, even joy. And so, their newest album begins with Tam’s unmistakable voice intoning, “I want to be your companion.” It’s an appropriate beginning for a band who has built itself on complex musicianship and careful collaboration. They know the value of hard work and compromise. Their music is evidence of the thrill of creativity. \n\nHumming House is Justin Wade Tam, Bobby Chase, Joshua Wolak, and Benjamin Jones. The band formed organically out of jam sessions that Tam held in his living room in East Nashville—evidence that some of the best projects come from spontaneous collaboration and the subsequent seeing it through. Now, three albums and six years later, Humming House continues to embody what is best about the Nashville each transplant chooses to call home. \n\nWhat Humming House does so well is paint sonic landscapes that are at once compelling and honest, even in the most rollicking of songs. Revelries, Humming House’s second full-length album released in 2015, was largely influenced by the band’s history of touring. Its songs revealed the power and revelations that come from travel. Companion, to be released by Soundly on the 6th of October 2017, continues to pursue that which transforms. In part, it is still movement, movement that comes easily to the body as well as movement driven by the unease we daily brush up against. What’s most powerful about Humming House is their ability to be present with you, to take those moments in life that seem mundane and shift the lens so that they are rendered extraordinary. Theirs is a music of presence. \n\nHumming House maintains that sense of intimacy that derives from making music with friends altogether in the same room. It is fun combined with substance. With Tam’s sincerity, Jones’ groove, and Chase and Wolak’s charm, their live shows extend the invitation to participate. As Dustin Ogdin observes in No Depression, “Humming House exudes restraint and a wily intelligence. They never pander to their crowd, but do respect them. They also seem to understand that the best music comes from an exchange between artist and audience rather than simply one giving and the other receiving.”\n\nThese essential traits of Humming House are evident in Companion. The story of the album mirrors the story of the band: it’s one of collaboration, experimentation, and showing up for each other over and again. There are songs of hope and of desperation so that the prevailing mood is one of exchange and balance. In the spirit of experimentation, the band threw out the constraining rule that they would only write with acoustic instruments. While those sounds still center the creative impulses of the songs, the added electric experimentation and expanded instrumentation imbue the new songs with a dynamism that is irresistible. Tam notes that the “extremes of the record in emotion are wider on this album. There’s more desperation, but there’s also fun and an upbeat aspect that’s more joyous.” The first half of the album is infused with Indie Rock, especially in songs such as “Can’t Stay Away,” “Takin’ Over,” and “Make it Through.” The influence of quirky 90s rock, a la Cake, is there too. “Takin’ Over” adheres to the Humming House desire to move you and is emblematic of those moments in our lives where the rhythm of the things that we love: music, friends, family commandeer our bodies until we’re compelled to move in joy.\n\n “Sign Me Up” and “Companion” nod to Paul Simon, while “Silver Lining,” “Find What Waits,” and “London” gesture to Humming House’s long engagement with classical composition and songwriter driven melodies so strong in the realm of Americana. The album isn’t all hip swinging bravado; halfway through, “Silver Lining” will stop and compel you to attend to the broken things that shape us. “Make it Through” and “Hope in My Head” are prisms to transform difficult days into livable ones. “I Want It All” does justice to the nostalgia and influence of a favorite album, while “Sign Me Up” conveys the increasing distance between our digital, urban lives and the ecosystems that sustain us. \n\n“Wishing Well” is a late album gem. It opens with the observation, “Be patient with the ones you love / because we’re not here for long enough / to judge,” and so the song is an invitation to come to terms with our collective humanity, a difficult enough feat in the current torrid climate of politics, environmental concerns, and general unease. Thankfully, Humming House is dedicated to honest songwriting, attending to the complex interactions that shape us, and is committed to being present with us in their albums and live shows. What choice do we have but to respond? Theirs is a music that places us.\nBecca Mancari is rewriting the rules.\n\nBorn in Staten Island, New York, to an Italian-Irish preacher and a Puerto Rican mother, Mancari has lived a life of transition - from working as a janitor in South Florida, to writing songs with train hoppers in the Blue Ridge Mountains and seeking spirituality in India. But it was her time in Virginia and Nashville where she found the roots music that would continue to inspire her musical evolution to today. \n\nHer anticipated debut album, \"Good Woman,\" is hauntingly lonesome, with dust-cloud swells of electric guitar and don't-look-back lyrics revealing scenes from Mancari’s well-travelled story. She recalls, “I remember being 19, and I would go to this old warehouse where a bunch of old timers would be siting around picking and drinking moonshine...and we are talking straight up moonshine.\" During this time, Mancari's curiosity to see the world with eager, fresh eyes grew, drawing her to travel and experience all types of people and places. Her travels would inevitably impact her music; since her music is the landscape of all she's seen, “Good Woman” evokes the sound of city grit and the mountain music of her youth, swirling into a fresh, nostalgic sound. \n\nMancari explains that she wants her music to be familiar to audiences, but also pushing creative boundaries, rewriting the rules for her genre. She explains, “Our hope is that we’re doing something that respects the roots but also has space and the galaxy in it.” It's these planetary frontiers, along with the powerful fragility in her voice, that make Mancari's music beyond standard classifications.\n\nPerhaps more striking than Mancari’s sound is the tender honesty and vulnerability present in each of her songs. Ann Powers describes Mancari’s writing as \"lyrical and raw,\" commenting on the \"great personality in her songs.\" As a gay woman in the south, she has fought hard to reconcile her spiritual beliefs with her sexuality. Her strong personality enables her to be a spokeswoman to the outcast and the misfit, helping her redefine the categories that so often divide people. Mancari explains, “It was not an easy road when I came out. No matter how hard I tried to fit into society’s molds, I could not. I want to be open and proud of who I am, because I needed people like that in my life when I was young.” Mancari hopes that people will find the bravery in her story and be able to discover their own inner strength. \n\nWhen Mancari sings, she shines with authenticity. It is evident that Mancari knows exactly who she is, and her music has a strong sense of identity. But it is her refusal to subscribe to molds and societies trends that sets Mancari apart. Mancari is challenging all of us to throw away the old book and create a new genre of music. \n\nIn a short time, Mancari has made a name for herself in Nashville and the southeast. She has toured and played with Margo Price, Hurray For The Riff Raff, The Lone Bellow, SUSTO, Joan Osborne, The Weeks, and more.\n","img":""},{"venue":"The Visulite","event":"JOHN PRINE","date":"09 16 17","times":"7:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2563","hrefRef":"","desc":"PRICES BEGIN AT $59.50- CLICK HERE FOR TICKETS\n\nPRESENTED BY: BLUMENTHAL PERFORMING ARTS & NS2\n\nTwo time Grammy-winner, singer-songwriter, John Prine, is among the English language’s premier phrase-turners.\n\nForty-five years into a remarkable career that has drawn effusive praise from Bob Dylan, Kris Kristofferson, Bonnie Raitt, Roger Waters, Tom Petty, Bruce Springsteen, and others who would know, Prine is a smiling, shuffling force for good. He is a Nashville Songwriters Hall of Fame member whose classic debut album, simply titled John Prine, is recognized as part of the Recording Academy’s Grammy Hall of Fame.\n","img":""},{"venue":"The Visulite","event":"TWICE AS NICE: AN EVENING WITH DEER TICK & CHRIS CROFTON","date":"09 20 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2576","hrefRef":"","desc":"The tour is to support the new records Deer Tick Vol. 1 & Vol. 2.\n\nAt each show, they will play two sets; an “acoustic” set and an electric set. There will be an intermission and a comedian will open the shows.\n\nDeer Tick will play music from all their albums.\nChris Crofton started performing comedy after he graduated from college in 1991. He moved to New York City from Connecticut and appeared at open mics around the city: Stand Up NY, The West End, Rose's Turn, New York Comedy Club, The Village Gate, and Gladys's Comedy Room at Hamburger Harry's. Crofton was also writing songs at this time. Following the release of his critically acclaimed first album, The Alcohol Stuntman, on Stylus Records, he moved to Nashville to pursue music. From 2001 up to the present, he has performed and recorded with Chris Crofton The Alcohol Stuntband. Known as much for Crofton's between-song comments as the music, The Alcohol Stuntband has played with The Black Keys, Rocket From the Tombs, Richard Lloyd, Lucero, Danko Jones, The Paybacks and many, many, more. From 2005 to 2009 Crofton hosted the now-legendary \"Best of Bread\" radio show on Nashville's WRVU, a weekly program in which he and his brother Greg mixed topical and absurd commentary with 70s soft-rock classics. \n\nCrofton is also an award-winning actor who has appeared in numerous\nindependent films. In 2006, a local comedian asked Crofton to try standup again for fun. After performing for 10 years with The Alcohol Stuntband, Crofton had developed a remarkable ease onstage, and his topical palette had expanded dramatically. These qualities combined with Crofton's unique perspective to create a comedy monster. His style mixes the social commentary of Richard Pryor and Bill Hicks, the absurdity of Steve Martin, and the pacing and stage presence of Lenny Bruce.\n\nIn 2007, Crofton was invited to open for Neil Hamburger in Nashville. Hamburger was impressed with his set and arranged for him to open a show for Bob Odenkirk and Louis CK at the Upright Citizens Brigade Theater in Los Angeles. In 2009, after seeing his standup, Harmony Korine cast Crofton in his film Trash Humpers and brought him to select cities to perform comedy prior to screenings. Later in 2009, after WRVU s lamented demise, Crofton adapted the Best of Bread broadcast into the popular weekly podcast \"The Chris Crofton Show.\" In May 2012, Chicken Ranch Records released Crofton's debut comedy album, \"Pearls Before Swine: Live at The Springwater, which, according to Nashville Scene editor Jim Ridley, captures [Crofton s] nervy, abrasive act on crackling vinyl before an audience that s by turns incensed, indifferent and doubled over in hysterics.\n","img":""},{"venue":"The Visulite","event":"SCHOOL OF ROCK CHARLOTTE: SUMMER SHOWCASE","date":"09 10 17","times":"11:3","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2615","hrefRef":"","desc":"12:00 pm - Rock 101: The Beatles vs The Rolling Stones\n1:00 pm -Trash Pop\n2:30 pm - AC/DC\n4 pm - Green Day: A Greatest Hits Tribute\n5:30 pm - Modern Soul\n7 pm - Queen\n8:30 pm - Led Zeppelin\n\nWe believe the best way to learn music is to play music. We take students from the lesson room to the stage, developing both their confidence and musicianship with programs designed for all skill levels.\n\n\nSchool of Rock teaches guitar, bass, vocals, keyboards, drums and combines weekly private music lessons and group band rehearsals to prepare students to take the stage in front of live audiences in an authentic concert setting.\n\nTo date our students have played thousands of concerts, to more than 100,000 people, at such legendary venues as The Fillmore Charlotte, Visulite Theatre, Neighborhood Theatre, Amos' Southend, The Double Door Inn & The Chop Shop. We have also had the great fortune to be able to play at music festivals such as Lollapalooza, Austin City Limits & Gathering of the Vibes. \n\nOur performance-based teaching method is an immersive experience that inspires our students to be their best. We get our students playing music as quickly as possible because we know that that is what our students want to do. As a result our students become more interested in the theory of music.\n","img":""},{"venue":"The Visulite","event":"SOUTHERN CULTURE ON THE SKIDS & IT'S SNAKES","date":"09 29 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2558","hrefRef":"","desc":"The Chapel Hill, NC trio Southern Culture On The Skids has been spreading the rock and roll gospel since 1983. Rick Miller – guitar/vox, Mary Huff – bass/vox and Dave Hartman – drums, play a greasy mix of surf, rockabilly, R&B and country fried garage with a side of psych. It's a musical gumbo Miller calls, \"Americana from the wrong side of the tracks.\" For over 30 years, the band have toured everywhere from the NC Prison System to Mt. Fuji, Japan, delivering what Rolling Stone calls \"a hell raising rock and roll party.\"\n\n\nSince 1983, when they formed in Chapel Hill, North Carolina, SCOTS have played their unique hybrid of Americana, surf, R&B, rockabilly, and swamp pop (the band describes their sound as \"toe sucking geek rock – kinda weird, but it feels good when you're doing it\"), all the while driving fans into ecstatic, sweat-drenched paroxysms of joy. Assisted by his cohorts in chaos – drummer Dave Hartman and bassist/singer/heartbreaker Mary Huff – Miller and crew have been prolific and ubiquitous for over twenty years.\n\nNew for 2015, Southern Culture On The Skids and Fred Schneider of the B-52's announced their first-ever collaborative 12\" remix EP, Party At My Trouse on YepRoc records! This 12\" nugget of colored vinyl, also available as a digital download, features remixes by THE UPTOWN EXPLOSION (Alap Momin and Jon Spencer) and DJ King Smoothie.\nSCOTS have done almost everything in their 30-year career, except this – a 12\" Dance Mix single with Fred Schneider. One hot week in August Fred, Rick, Mary and Dave met up at The Kudzu Ranch in rural NC to record an ode to butt shakin' – \"PARTY AT MY TROUSE\" B/W the slinky chaser \"HEY MARY\" which was released for Record Store Day 2014 as a 7\" single. Millions of fans missed out on the 2014 limited edition, so by popular demand the band and Fred decided to extend the boogie into the night with a 12\" EP featuring 5 brand new booty-shakin', southern-fried, jukin' remixes!\n\nIn 2013 Southern Culture on the Skids re-recorded and updated every SCOTS original song from 1994's classic Ditch Diggin' and released Dig This on CD/LP/digital through the band's own Kudzu Records.\n\nSinger/guitarist, Rick Miller recalls the inspiration, \"We have a drainage ditch that runs by the Kudzu Ranch that had been left unattended for so long it was not doing its job. I decided to dig a new ditch or at least upgrade the old ditch. I was dragging tree limbs, shoveling the muck, looking for turtles and watching for snakes and humming the riff to \"Ditch Diggin'.\" That is when it dawned on me that it had been almost 20 years since we recorded the album of the same name, and all those songs could use an upgrade to 2013 specs just like this ditch I am sweating over right now, but instead of a shovel – I'd use a guitar. Easier on the back!\"\n\nFrom their 1985 debut Voodoo Beach Party, to the international smash, 1998's Dirt Track Date (featuring the hit single \"Camel Walk\"), and on to the shake-a-butt dance party of Party At My Trouse Southern Culture on the Skids have continued to throw what Rolling Stone dubbed \"a hell raising rock and roll party.\" Their 2005 live outing, Doublewide and Live!, captured all of this on tape, dirty, rough, wild and above all fun!! 2010 saw the band's first self-release, The Kudzu Ranch, plus the reissue of their classic 1991 album, Too Much Pork For Just One Fork. In 2011 the band released the out of print 1996 Santo Swings EP digitally for the first time ever on Cinco de Mayo. And in fall 2011 Zombified, Southern Culture On The Skids' tribute to the horror and exploitation movies that populated Southern theaters and drive-ins during the 60s and 70s, was re-released. Originally released in Australia as an eight song EP in 1998, the Zombified Extended Release is now a full LP with the addition of five new tunes.\nIt’s Snakes likes you to dance or a least tap your toes. The Charlotte quartet plays original rock and roll, with a pinch of hillbilly and a dash of disco. \n\nFounding members Hope Nicholls and Aaron Pitkin started the seminal alternative band Fetchin Bones in the mid ’80’s in Charlotte, touring the country and recording multiple albums for Capitol Records. They continued to rock with Sugarsmack in the 90’s and Snagglepuss for the new millennium.\n\nIt’s Snakes is what’s up now, featuring Hope on drums, singing her heart out and banging the heck out of the skins, all while standing on one foot. Aaron is back on the guitar for the first time since the ‘Bones days; Greg Walsh of the Aqua-Lads and Darrin Gray of the Chalkies complete the rowdy combo with boss guitar and booming bass. \n\nTheir first album, self-titled and produced by Charlotte’s own Chris Shinn, is available on iTunes, Spotify, and CD Baby.\n","img":""},{"venue":"The Visulite","event":"Abacab","date":"10 27 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2636","hrefRef":"","desc":"Formed in July 2015 by five well-seasoned musicians in the Charlotte NC metro area, Abacab is comprised of:\n\nVocalist/Drummer/Multi-instrumentalist: Pete Lents\nBassist/Rhythm Guitarist: Cliff Stankiewicz\nKeyboardist: Patrick Raymaker\nLead Guitarist/Bassist: Ryan Richard\nDrummer: Matthew Hedrick\n","img":""},{"venue":"The Visulite","event":"AN EVENING WITH THE JERRY DOUGLAS BAND","date":"10 10 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2601","hrefRef":"","desc":"PRICES BEGIN AT $28.00- CLICK HERE FOR TICKETS\n\nPRESENTED BY: MAXXMUSIC, VISULITE THEATRE & BLUMENTHAL PERFORMING ARTS\n\nDobro master and 14-time Grammy winner Jerry Douglas is to the resonator guitar what Jimi Hendrix was to the electric guitar: elevating, transforming, and reinventing the instrument in countless ways. In addition to being widely recognized as the foremost master of the Dobro, Jerry Douglas is a freewheeling, forward-thinking recording artist whose output incorporates elements of bluegrass, country, rock, jazz, blues and Celtic into his distinctive musical vision.\n\nCalled “dobro’s matchless contemporary master,” by The New York Times, fourteen-time Grammy winner Jerry Douglas is one of the most innovative recording artists in music, both as a solo artist and member of groundbreaking bands including J.D. Crowe & the New South, the Country Gentlemen, Boone Creek, the Grammy-winning The Earls of Leicester, and Strength In Numbers. Douglas’ distinctive sound graces more than 1500 albums, including discs released by Garth Brooks, Paul Simon, James Taylor, Elvis Costello, Earl Scruggs, and Ray Charles, among many others.\n\nSince 1998, he’s been a key member of “Alison Krauss and Union Station featuring Jerry Douglas”, touring extensively and co-producing and playing on a series of platinum albums. He has produced albums for Krauss, the Del McCoury Band, Maura O’Connell, and Jesse Winchester and is is co-Music Director of the acclaimed BBC TV series Transatlantic Sessions, and his latest solo album Traveler features guest appearances by such notable friends as Paul Simon, Mumford & Sons, and Eric Clapton, among others. \n\nAs he continues his incalculable influence on Americana, bluegrass and their many related genres, Douglas forges as a true pioneer in American music.\n\n \n","img":""},{"venue":"The Visulite","event":"GRETA VAN FLEET **SOLD OUT** & GOODBYE JUNE","date":"08 29 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2605","hrefRef":"","desc":"Frankenmuth, Michigan – Michigan’s “Little Bavaria” - is known for its scenic farmland. Crispy chicken dinners. The State’s best indoor water parks.  Picturesque wine and chocolate boat cruises.  The world’s largest Christmas store.\n\nThese days it’s also home to one of the most exciting rock ‘n’ roll acts to come from the heartland, or anywhere, in many a year.\n\nGreta Van Fleet – which took its name from one of the close-knit community’s town elders – is a hard rocking quartet whose creative ambitions and achievements reach far beyond the ages of the four band members, not all of them old enough to have voted in last November’s election.  On its debut EP Black Smoke Rising, the group deftly straddles the line between timeless and future, sounding at once like many things you’ve heard before and also something you’ve never heard before.  The three brothers – twins Josh (vocals) and Jake (guitar) Kiszka, younger brother Sam Kiszka (bass, keyboards) and drummer Danny Wagner – have turned their rich and varied musical background into an arresting mélange of rock ‘n’ roll with flavors of metal, pop, blues and grunge, the result of years of practice, study and familial good times.\n\n“When we were not even born yet my father played us blues music and R&B, soul music – all the good stuff,” says Sam.  Dad Kiszka was a musician himself, playing guitar and harmonica. “Our parents had a lot of vinyl laying around,” recalls Josh, so we grew up listening to that and really liked playing with the vinyl albums – putting them on the turntable and speeding them up and slowing them down.  But, yeah, I really liked the blues and the soul and the funk – Wilson Pickett is the big one, and Joe Cocker, those kinds of things.”\n\nThe Kiszka kids furthered their music education during winter ski trips to Michigan’s Yankee Springs, where a plethora of family and friends would gather with instruments. Someone was playing something nearly every minute of the day, and Josh, Jake and Sam soaked it up with relish. “Every year was better than Christmas,” Josh recalls. “In the evenings or during the day, there was always music being made there, everybody getting together and experimenting with sounds, having lots of fun, making music.”  For Jake, meanwhile, it was “really awe-inspiring when you see this completely surrealistic environment, to see all these people from all over the place come together, and what brought them together was music. That was mind-blowing.”\n\nIt was Jake who turned that inspiration into Greta Van Fleet, drawing the idea from the likes of Cream, the Yardbirds, The Who and other 60s British Invasion favorites. “We liked to see how the English bands had reinterpreted the blues, and we wanted to interpret it again – Y’know, wouldn’t it be interesting if an American band came right back and reinterpreted the reinterpretation that the English did?” the guitarist explains.  “I thought there was something there that needed to be created.”\n\nJake gradually assembled his brothers into a band. Sam was caught up when Jake began jamming at the family home with a drummer friend from school. “It dawned on me that I needed to play bass for them,” Sam says. “Plus,” he joked, “my mom always said I looked like a bass player.” Josh, meanwhile, was studying theater, film and painting at school, with acting giving him an ease on stage, as well as a voice, that made him a no-brainer to be Greta Van Fleet’s frontman. “It wasn’t something I set out to particularly do. But it felt pretty natural,” he says now.\n\nDanny Wagner, a friend of Sam’s since kindergarten, became the last piece of the Greta Van Fleet puzzle, joining a year after the group started, after being a regular at the Kiszka house for jams and rehearsals. “We all have similar taste in music and that helps a lot,” Wagner notes. “But at the same time we have these little differences in what we like, and when it comes together it produces this sound. It’s got that classic kind of vibe but it has a lot of soul, a lot of energy, and that’s a huge part of it.”\n\nYou won’t find a better description of the four songs on Greta Van Fleet’s EP, recorded at Rust Belt Studios in suburban Detroit with producers Al Sutton (Kid Rock, Hank Williams Jr.) and Marlon Young from Kid Rock’s Twisted Brown Trucker Band. The introduction runs a gamut from the dusty grind of “Highway Tune” to the sinewy punch of “Safari Song” and the muscular crunch of “Black Smoke Rising.” “Flower Power,” meanwhile, is a trippy sonic tapestry that weaves psychedelic and folk textures into the mix.  “No limits, no barriers, no boundaries,” Jake declares. “It was like that when we were growing up, and it’s like that when we’re making our own music.”\n\nListen closely and you’ll also hear the flavor of a small, tight-knit community seeping into the group’s songs. “I think it has a huge presence in the music,” Josh says. “It’s this romantic, simple, Americana kind of thing, like Tom Sawyer or Huckleberry Finn growing up outside of town in the country.”\n\nThe good news is there’s more where these four songs came from.  The group has been in the studio for about two years now, with nearly 20 tracks down and more coming every day. “We’ve been writing since Josh and I were 16 and Sam and Danny were 13,” Jake says. “We have so many songs we’re working on it’s ridiculous. We’re just trying to develop and get better. That’s very important to us.”  So is playing live, where Greta Van Fleet has been slaying audiences with an electrifying show that sounds more like a band that’s been around for decades rather than just a few years. The group can’t wait to take it around the country, and around the world in support of the EP, showing off the big sound this band from a little town can make whenever it hits the stage.\n\n“It’s really happened so quickly. It’s definitely overwhelming and exciting – and it’s awesome,” says Wagner. “All these things are happening – the record deal, management, William Morris (booking agency). It’s slowly starting to build up, and we’re starting to get that fever. We’re itching to show everybody who we are and what we can do.”\nStraight up rock & roll isn’t dead, it’s just returned to the fringes and outskirts where it can find its organic roots all over again. Goodbye June understands all that: cousins who came together to cope with the death of lead guitarist Tyler Baker’s brother. That thrash, slash, churn, burn rages through grief as their catharsis fuels every note they play.\n\n“I came to the band as a coping mechanism,” Tyler Baker admits. “I was gonna be an engineer or accountant, but when he passed, it was a light switch. I’d always loved music, and I realized life is now – and you better live it. That’s what pushed us together, and the grief is what we were all trying to get out.”\n\nFor the trio, the death may’ve been a fulcrum moment; but it was more than grief the trio was trying to exorcise. Beyond the obvious loss, the church-raised extended family members were also trying to reckon with their own background.\n\n“It was a grieving process, really,” Brandon Qualkenbush acknowledges, “especially for me and Landon. But it was so much more. It was a rebellion of sorts, an unraveling of a lot of things and layers we’d grown up believing. It comes down to, do we believe in some thing? No one really knows…”\n\n“At this point,” Milbourn picks up without missing a beat, “our faith is in our music and our lifestyle.”\n","img":""},{"venue":"The Visulite","event":"UB40 LEGENDS ALI, ASTRO & MICKEY","date":"09 15 17","times":"7:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2562","hrefRef":"","desc":"PRICES BEGIN AT $25.00-CLICK HERE FOR TICKETS\n\nPRESENTED BY: MAXXMUSIC, VISULITE THEATRE & BLUMENTHAL PERFORMING ARTS\n\nAs original members of UB40, Ali, Mickey and Astro helped to define reggae music for a generation. The multi-racial band, formed in 1979 in the Birmingham suburb of Moseley, pooled a diverse set of influences to put a fresh, indigenous slant on Jamaican reggae. After encouragement from Chrissie Hynde, who offered them support slots with her chart-topping band The Pretenders, they recorded their independently released debut album, Signing Off, on an eight-track tape machine in the home of producer Bob Lamb. An unexpected number two album, it gave them the conviction to chart their own course.\n\nUB40 went on to dominate charts around the world, not least with the hugely successful Labour Of Love series. The first Labour Of Love album, in 1983, yielded a cover of Neil Diamond’s Red Red Wine that topped the charts on both sides of the Atlantic. The band secured two further chart-topping singles at home in (I Can’t Help) Falling In Love With You (also another US number one) and I Got You Babe, a duet between Ali and the band’s old friend Chrissie Hynde, and Ali and Robin Campbell also scored a No.1 with Baby Come Back.\n\nWhen Ali Campbell departed in 2008 after 29 years and a dozen major world tours with the band, he was followed out of UB40 by Mickey Virtue. Campbell, with Mickey lending a helping hand, has since released two solo albums. Astro remained with the band until November 2013, when he left to team up again with Ali and Mickey. Now, following some spectacular gigs at home and abroad, the trio are facing the future with renewed confidence and vigour.\n","img":""},{"venue":"The Visulite","event":"NOAH GUNDERSEN & SILVER TORCHES","date":"10 25 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2606","hrefRef":"","desc":"In America today, anyone can engage in spiritual surrender. Performing the rite is simple: one first gathers with their community in a room of mirrors (in peripheral vision these mirrors appear as windows). Next, the agendas, hopes, and grievances of each individual are written down and cast along pulsed radio frequencies to data centers. From here they are automatically sifted through a neural network of graphics processing units, and contributed to an artificial intelligence engine. The principal aim of the ritual is to preserve the cosmic movement of collective perception. Secondary aims include catharsis, prosperity, and (occasionally) procreation. Because of the persistence of social stresses and mounting political dread, the ritual’s cyclic performance is necessary (twice daily, once at dusk and once at dawn).\n\nParadoxically, even those who question the efficacy of this tradition must do so from within the same framework, in the form of status updates, tweets, or blog posts. In the early part of 2017 Noah wrote:\n\n“This is our voice. The Aether. An invisible platform. A maze of wires and boxes safely containing our proclamations... While white men with pens close their doors, stuff their ears with cotton, and break the world... we piss in the ocean... we drown in white noise.”\n\n(Once upon a time, Noah Gundersen poetically sang that the storms which make us tremble also “fill our organs up with air,”...allowing us to sing “honest songs”. What of our songs now? Are they just piss in the ocean? White Noise?)\n\nA longtime fan responded via Facebook, referring to the entry as “a goddamn dumpster fire of a post”.\n\n“Your early records are masterpieces,” he commented, “...but this scramble to be anything but what your parents are is killing your authenticity.”\n\nAuthenticity can be a fickle mistress it seems. Noah has been peddling sincerity and introspection in musical form for almost a decade; songs that give listeners a taste of the emotional nectar in the pit of another human’s gut. He’s been dredging up viscous fistfulls of his own being and shaping them into little waxen votives, candles meant to illuminate the territory between shameless confession and hopeless redemption, for all of the other twenty-somethings who’ve been groping around in that long existential shadow.\n\nAt some point this whole process must have lost its charm. It was two years ago that Noah, like some artistic ouroboros, began to sing the words “Am I earning the right to live by looking in a mirror? There’s nothing more sincere than selfish art?” The cyclic ritual of self- induced nausea, staring in the mirror mouth agape, waiting to wretch new words and sounds, was catching up with him. Not long after, in the early part of 2016, he sat down for a show and felt like he was dying.\n\n“Instead of my life up to that point flashing before my eyes, it was my future. A future playing songs I didn’t believe in... pouring my soul out into a vehicle I no longer recognized or loved.”\n\nNoah turned to a fellow songwriter, who shared this mote of reassurance from dancer and choreographer Martha Graham:\n\n“No artist is pleased... There is only a queer divine dissatisfaction, a blessed unrest that keeps us marching and makes us more alive than the others.”\n\nThis crisis was an opportunity for the serpent to relinquish hold of its own tail, for forward motion. To turn his gaze away from reflection, and maybe instead at the mirror itself, alternate voices and distorted perceptions that throw their weight onto the human psyche in powerful ways, but evade expression in introspective storytelling.\n\nSo, that’s White Noise, I think: the fluorescent glow of queer divine dissatisfaction. The distorted buzz manufactured by dumb metal phalluses thrust into a vacuum of waves and signals. It doesn’t dwell on (and in fact seems uninterested in) introspection. Not a guiding light. Not the reasoned problem-solving of the ego, but the muddled demands of the id. It’s a myriad\n\nof interpolated signals, symbols, and voices, like a tube-TV greedily flipping through channels on auto-program:\n\n“Heavy Metals” is cosmic dismay that’s been pasted over with a sugary synth veneer. “Cocaine, Sex, and Alcohol (From a Basement in L.A.)”, like a messy public broadcast, leverages a din of drunken band sounds and disoriented muttering, “I’ve got all this alcohol... do you wanna see my show?”\n\nThe decadent yearning of “Bad Desire” sits between the other songs of dissolution like a soap opera broadcasting alongside the evening news. Just as Noah finishes crooning the final honey-sweet chorus, “...and I wanna see you tonight, one last time,” we transition into night sweats, the frantic yelling of sleep terrors, all heralding the cathartic industrial funeral dirge of “Wake Me Up, I’m Drowning”.\n\nNoah is no longer lighting votives, but dumpster fires—big, bright, symbolic and chaotic. Musical vignettes of combustion, rubbish, degeneracy and, perhaps most comfortingly, warmth; because sometimes overlooked in the mad grasping for heady, introspective Authenticity is music that’s heartfelt. In “The Sound”, Noah scourges a source of entitlement that is entirely ambiguous, but does so with a sort of exasperated conviction that is only ever reserved for one’s nation, one’s God, or one’s self. The words “How many times will you shit on what you’re given? How many times till you shut up and listen?” escape his throat with a desperation that (bafflingly) surpasses even his most vulnerable songs about heartbreak, addiction, or loss of faith.\n\nWhether the voices he channels are symbolic or literal, paralyzed with fear or pushing a manic brand of salvation, each amounts to something laced with warm, ruddy veins (I have a feeling that Noah’s music always will). If you listen closely you’ll hear the spiritualist, who takes solace in the fact that when he’s gone, the water in his body may be the beginning of something new. There’s also the doomsayer, certain of his fate, but still so afraid, who can’t help but ask of his own violent trembling, “Are these my feet attempting to dance?” Then there’s mortality, trying to shout through all of the noise, “Send my love to everyone.”\n\nWhite Noise was produced by Nate Yaccino and features long-time band-members and collaborators Abby Gundersen, Jonny Gundersen, and Micah Simler. It will be released into the Aether on September 22nd, 2017. \nErik Walters of Silver Torches has grown up.\n\nOften when we say this of an artist, it speaks to big leaps and enormous changes. Huge pushes forward in style and a radically new sound.\n\nBut that’s not how growing up works. Growing up is a slow, hard-won road. It is set backs and tiny steps. It is a slow waking up to yourself and the world around you.\n\nOn his debut album, Heatherfield, Walters grappled with the reality of new adulthood - relationships, finding his purpose. It was nostalgic for the easy days of youth, it was optimistic for what was coming.\n\nBut in the interim years, Walters has changed, as we all inevitably do. The space between the early twenties and the late twenties is a riotous one, and with his new album, Let It Be a Dream, he comes back to the studio with more nuance, but fewer answers.\n\nRecorded at Studio X, Hall of Justice, and the home of the producer, Andy Park, Let It Dream dives deeper into the fears we have as we near the apex of young adulthood - the fear that we’ve been left behind. The realization that we’re not the center of the universe. As Walters sings, with vocal luminary Courtney Marie Andrews, on “At the Lantern”:\n\nI’m getting older every day\n\nStill waiting for the sea to change\n\nFor a chance to make things better\n\nChasing that elusive dream\n\nI had when I was seventeen\n\nWhen my future was unfettered\n\nBut not all darkness is despair. As the grip of nostalgia loosens, as heartache clarifies into the fear underneath it, Let It Be a Dream shifts to allow beams of light in after everything has collapsed. But they aren’t bright like a sunrise. They are shifting - the relief that comes when you’ve realized a hard truth. Greg Leisz’s pedal steel sifts through the rubble on “I Can’t Lie”, a track that breathes life into one of the few Americana centered songs.\n\nHurts me just to think\n\nThat you had your reasons\n\nAnd I thought I had mine\n\nIf I ask you forgiveness\n\nWould that be a crime?\n\nBreaking away from the standard singer-songwriter fare, Walters adds synths to tracks like “If I Reach”, ripped out of a John Hughes fever dream. It is an exploration not into a style of music, but into a tapestry of the second coming-of-age, the period that teen movies ignore and rom-coms brush over. The period when you descend into the depths of yourself to find something other than comfort - to find yourself.\n\n\nLet It Be a Dream is that torn map to the center of growing up, full of folded corners and wandering, rife with questions, and, just like all of us, waiting to be pieced together.\n","img":""},{"venue":"The Visulite","event":"BLIND PILOT","date":"10 21 17","times":"7:30","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2602","hrefRef":"","desc":"PRESENTED BY: MAXXMUSIC, VISULITE THEATRE & BLUMENTHAL PERFORMING ARTS\n\nThe past isn't finished with us yet. Love can be like that, too. A couple of years ago I found love in different forms leaving my life at once. In a single month I lost my closest group of friends, my 13 year relationship ended, and my dad was diagnosed with cancer. I had just stopped touring to write the next Blind Pilot album, but instead I was watching each of my plans unthread as a new season pulled forward relentlessly.\n\nAvoiding suffering, is avoiding real happiness too. My reason to tell this story isn’t because it broke me and pinned me breathless. There was suffering, but those two years, as I moved to my hometown to help my parents through my dad’s sickness and eventually his death, also brought me true closeness, a deeper will to care and hope, and many moments of beauty I can barely describe.\n\nThis album came from love for my family, my town, my friends, my community. We don’t have to be so afraid of loss. We can speak and share its name, knowing we are together in it. If these songs are invitations to talk about loss and death, the invitation is to talk closely of the courage we find when we face loss honestly, cracked open and unsure of what we will become.  \n\n– Blind Pilot’s Israel Nebeker\n\nBlind Pilot’s ‘And Then Like Lions’ on ATO Records is the third LP from the Portland, Oregon-based sextet consisting of frontman Israel Nebeker, fellow founding member Ryan Dobrowski, Luke Ydstie, Kati Claborn, Ian Krist and Dave Jorgensen.  The album was produced by Israel Nebeker and Tucker Martine (The Decemberists, Neko Case, My Morning Jacket), and was written and composed by Nebeker.  It comes five years after the band’s well-received ‘We Are the Tide’ and three years after Nebeker thought he’d be starting the songs that would become the band’s third album.\n\n‘And Then Like Lions’ opens with “Umpqua Rushing,” the first single from the album and the track that most directly deals with the end of his relationship. It’s inspired by memories of visiting the Umpqua River with his then girlfriend. The song connects images of a forest fire to the destruction and new beginning found in love’s wake.\n\n“Umpqua Rushing” has a strong, mid-tempo flow built on major chords and rich instrumentation that matches the river the song’s named for. Nebeker’s voice soars on strings to an uplifting ending, and it’s as vulnerable and open as he’s ever been. \n\nPacked Powder is an upbeat, solidly-driven song filled with elevated textures of guitar hooks and trumpets. It comes from an idea Nebeker had as a teenager, when he and his friends found they could repack fireworks to different outcomes: “We’re all made of the same stuff, but who knows how we’re packed and what we’ll show as we burn across the black sky of our own time?” The song speaks lightheartedly of ironic outcomes when trying to better a life through different career paths, and then sings a chorus that surrenders and desires life to reveal what we are made of.\n\n‘And Then Like Lions’ ends triumphantly on “Like Lions,” a song inspired by various stories of courage Nebeker has witnessed in his recent years, including watching his father fight for life and, before the end, find strength enough to give himself and be at peace with his own mortality.\n\nBlind Pilot has performed on Ellen and The Late Show with David Letterman, at the Newport Folk Festival, Bonnaroo, and Lollapalooza. The group has shared stages with The Shins, Local Natives, Andrew Bird, and more. The project began in 2007 when Israel and co-founding member Ryan Dobrowski went on a West Coast tour via bicycle. Blind Pilot's six members recorded for this new album and will tour through 2016.\n","img":""},{"venue":"The Visulite","event":"SERATONES & TBA","date":"10 08 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2635","hrefRef":"","desc":"Get Gone, the potent debut album by the Shreveport, Louisiana natives in Seratones, makes a strong case that this little-known corner of the state is fertile ground, musically speaking. A.J. Haynes (vocals), Connor Davis (guitar), Adam Davis (bass) and Jesse Gabriel (drums) serve up a combination of Southern musicality, garage rock ferocity, and general badassery.\n\nHaynes’s powerful singing voice, first honed at Brownsville Baptist Church in Columbia, Louisiana at age 6, rings across every track. Davis’s bass and Gabriel’s playing propel every song with the grit, energy, and rawness of punk, the feeling of soul, and occasionally, a little jazz swing. The other Davis offers a clinic in guitar riffs, from swaggering blues to searing interstellar leads.\n\nRecorded at Dial Back Sound studios in Mississippi, Get Gone is all live takes, a portrait of the Seratones in their element. Add the soul and swagger of a juke joint with the electricity coursing through a basement DIY show, and you’d begin to approach the experience of seeing this foursome live. The well-paced, multi-faceted set showcases a band dedicated to sonic exploration. “Don’t Need It,” which opens with a muscular swing and tight guitar lines, builds into a monster finish with a nasty corkscrew of a guitar line. “Sun,” a brawny thrasher, courses with huge, raw voltage riffs. “Chandelier,” a mid-tempo burner and vocal workout by Haynes, goes from croon to a crescendo that would shake any crystals hanging from the rafters.\n\nShared history in the city’s music scene brought the Seratones together a few years ago. All four had played together with one or another in various local punk bands, bonding through all-ages basement shows, gigs at skate parks and BBQ joints, and late nights listening to jazz and blues records. In a city of multiple genres, no fixed musical identity and a flood of cover bands, these adventurous musicians carved out their own path, personifying the do-it-yourself ethos. The group was quickly recognized after forming, winning the Louisiana Music Prize in 2013.\n\n“Shreveport is always shifting its identity,” says Haynes. “You can do a lot of different things when it seems like every band is its own genre.”\n\nSeratones’s music, created with collaborative songwriting and spontaneous creativity, is certainly their own, due perhaps in part to Shreveport’s unique sonic geography. The city sits at a nexus roughly equidistant from Memphis soul, Mississippi Delta Blues, and New Orleans jazz, with Texas swing located just over the nearby state border. The band’s sound draws from those touch points and more, ranging from Black Sabbath’s Paranoid to Kind of Blue. They’ll happily connect the dots between Ornette Coleman and Jello Biafra.\n\nSeratones have different names for the amalgamation of styles found on their debut: Their own “expression of freedom,” music that’s “all about waking people up,” a safe space to feel what you want. However you choose to describe it, Get Gone is unexpected and unbowed, a head-snapping showcase of the twin pillars of Southern music, restlessness and resourcefulness.\n","img":""},{"venue":"The Visulite","event":"SPAFFORD & VOODOO VISIONARY","date":"10 24 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2579","hrefRef":"","desc":"Spafford is a four piece funk rock act hailing from Phoenix, Arizona. The band is comprised of Brian Moss (Guitar), Jordan Fairless (Bass), Andrew “Red” Johnson (Keys), and Cameron Laforest (Drums). Refusing to be restricted to any musical boundaries, Spafford seamlessly blends together an eclectic mixture of all of their collective musical experience. The heart of their sound is rooted in deep sonic exploration with a focus on improvisational elements. With jams stretching well beyond the typical structures of their songs, fans have flocked to their live shows to experience the unique energy captured within each performance. A focus on blending genres with a deep foundation of patient groove building has helped craft a sound all their own.  Formed in 2012 by happenstance, the band has been building an organic fanbase in the Southwestern United States through word of mouth ever since. As the secret has gotten out Spafford has moved onto national touring, sharing the stage on a coast to coast tour with jam heavyweights Umphrey’s Mcgee in 2017.  Reaching the next level in their ascent in an ever changing jam band landscape, Spafford has risen to the top of the next wave of acts by providing quality improvisation and a truly unique musical experience.\nVoodoo Visionary hails from the dirty south musical mecca of Atlanta. Their improvisational funk dance music delicately balances a tight, grooving rhythm section with diverse and dexterous keys and masterful guitar licks to create a sound the group calls psychofunk. Influenced by a wide array of artists such as Parliament Funkadelic, the Meters, the Grateful Dead, and Talking Heads, Voodoo Visionary has a uniquely blended sound that’s guaranteed to put the 'oogie in yo boogie.\n\nThe band is made up of Dennis Dowd (keys), Jimmy Lynch (bass), Scott MacDonald (vocals), Mac Schmitz (drums), and Mike Wilson (guitar). Wilson, Schmitz and Lynch have been playing together for over 8 years, during which time they built a unique chemistry that allows for exceptional improvisation during live shows. MacDonald joined the group in July 2013 as the lead vocalist and Voodoo Visionary began writing new music and playing shows immediately. Dowd was added to the band in March 2014 providing a missing link that enhanced the band’s distinctive sound, and the group has since taken off in the Atlanta music scene. Jose Rivera (percussion), Martin Anderson (saxophone), and Ben Otieno (trumpet) are regular additions to the live show and are featured on Voodoo Visionary's sophomore album.\n\nVoodoo Visionary released their debut album, Spirit of the Groove in March 2015. Over the past three years, while playing across the country, the band has shared the stage with acts such as Karl Denson’s Tiny Universe with Jimmy Herring, The Motet, TAUK, Col. Bruce Hampton, Zach Deputy, Earphunk, Roosevelt Collier, Jerry Joseph, The Main Squeeze, and Futurebirds. The band has been performing at venues like Variety Playhouse, Terminal West, the Georgia Theatre, Barrelhouse South, Ringside Cafe, and Crowbar, as well as major festivals such as Counterpoint Music and Arts Festival and Sweetwater 420 Fest. The band has made live radio appearances on WUGA's It's Friday program, WMNF's In the Groove, and WPRK's Green Eggs and Jams. In 2016, they pushed further into the regional and national music scene with festival performances at Sweetwater 420 Fest, Purple Hatters Ball, Great Outdoors Jam, Imagine Festival, Hookahville, and Backwoods Music Festival. In February of 2017, the band released their second album, \"Off the Ground,\" recorded at WonderDog Sounds, further advancing their sound, and propelling them to the next level. 2017 has seen the band further expand their national footprint, with more dates in the Midwest, Colorado, and the Northeast.\n\n“If this band had been around in the early ‘70s out of Atlanta, they would surely have been scooped up in a heartbeat by Capricorn Records... Repeated listenings reveal layer upon layer of elements. This is simply a superb recording, in terms of composition, performance, and sound.”\n– Scott Hopkins, MusicFestNews.com\n\n“Spirit of the Groove refuses to confine the band to a single genre and takes listeners on an adventure through sound and time... Voodoo Visionary has embraced and harnessed this epic blend [of influences], resulting in a truly amazing studio record.”\n– Randy Harris, Live Music Daily\n\n“While genre conventions are clearly upheld, driving rhythms, blistering lead guitar, and gospelesque lyrics, Voodoo Visionary escape the generic and create their own space, capitalizing on what works within funk as a genre. These guys will no doubt jam easily into the college bar scene, keeping the waning hippie contingent well fueled with healthy servings of funk. For that matter, Voodoo Visionary maintains the spirit of bump and sway in an otherwise monolithic universe of EDM. Before robots usurped dance music, this was what you dropped doses to. This is what outer space looked like from fifty thousand feet.”\n– Jon Litten, The Artifact Magazine\n","img":""},{"venue":"The Visulite","event":"SUSTO & ESME PATTERSON & ESME PATTERSON","date":"10 14 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2627","hrefRef":"","desc":"Justin Osborne needed a break.\n\nHe'd been writing music and making albums since he was 15, and by the age of 26, he felt like he was spinning his wheels. He knew he needed a change, so he ended his old band Sequoyah Prep School and moved to Cuba. He thought he might be done with music for a while, but the songs just kept coming.\n\n\"I had this idea in my mind that I was going to try and join some kind of Latin American Leftist movement. I wanted to jump off a cliff,\" Osborne says. \"Once I got there I immediately started hanging out with musicians and going to shows. I started showing them the songs from this project that was kind of just an idea in my head.\n\n\"They were like, 'man, don't throw away your passport, go home and continue to make music,'\" he says. \"I was encouraged by them to try again.\"\n\nOsborne ended the relationship he was in, started touring and writing constantly and eventually dropped out of school with just one paper and exam left to finish. He also made an aesthetic upgrade, getting the words \"Acid Boys\" tattooed across his knuckles.\n\n\"I was always afraid of committing fully to the idea of trying to make it. I think in some ways, that's what held my old band back. I thought maybe I'll go to school and I'll be an anthropologist and go live abroad,\" he says. \"Then I did all that, and I realized no, I need to go back to what I'm good at. I got the knuckle tattoos to keep me out of everything else.\"\n\nOsborne was already writing the songs for what would be SUSTO's 2014 self-titled debut when his producer Wolfgang Zimmerman introduced him to Johnny Delaware, a guitarist and songwriter who had moved to Charleston, South Carolina to make an album with the producer.\n\n\"We started meshing and gelling really well. We liked aspects of what each other did, so as the record started to really take shape in the studio, Johnny came in and really played a key role in that,\" Osborne says. \"At that point, it became one step closer to being a band thing.\"\n\nSUSTO is a Spanish word referring to a folk illness in Latin America that Osborne learned as anthropology student, meaning \"when your soul is separated from your body,\" and also roughly translates to a panic attack. For Osborne, the music of SUSTO was something he had to get out into the world.\n\n\"Going through my life I was just lost, and I didn't have direction, and I wanted direction,\" he says. Raised in Puddin' Swamp, South Carolina, Osborne moved to Charleston to attend military school, and didn't really get to experience much of the city -- one of the main artistic hubs of the South -- until he left his junior year to tour with his first band.\n\n\"I did acid for the first time. I started to gradually grow away from religion. I started to become my own person when I moved to Charleston,\" he says, adding that it's an especially great place to play music because \"people are into all kinds of stuff. They go out to shows. I wouldn't say Charleston is a country music town or an indie rock town, it's just a town where people like cool shit, so I think that people appreciate creativity when it comes to creating a genre instead of working within one that exists.\"\n\nSUSTO released their debut album independently and toured relentlessly to get the word out. They were an immediate hit in their hometown, packing venues, getting airplay at all the bars and even making a fan of Band of Horses' Ben Bridwell. \"I got an e-mail from him, telling me he loved the record and wanted to meet with me and Johnny,\" he says. \"That was actually the day I wrote my professor, and I said, 'I'm not coming in.'\"\n\nBut that wasn't enough. \"I was like, 'we can't just make it in Charleston.' My friends in the band Shovels & Ropes told me once, 'it's a big country and we got to get out there and get everybody.'\"\n\nThe members of the live band that Osborne and Delaware recruited -- Corey Campbell (guitar, keys, backing vocals), Jenna Desmond (bass), and Marshall Hudson (drums, percussion) contributed to SUSTO's new album & I'm Fine Today, which will be released via Caroline. \"We just wanted to go further. We started something with the first record, and we want to keep going in that direction,\" Osborne says of the album, which finds them taking the spacey country rock of their debut into the stratosphere, piling on layers of sighing keyboards, galloping rhythms and frayed, noisy guitar solos atop wistful melodies and lyrics that examine growing up and growing into yourself. Much of the album was recorded by Osborne, Delaware and Zimmerman, with the other members contributing as needed.\n\nOn \"Hard Drugs,\" Osborne muses about reconnecting with an estranged friend during a personal crisis (\"I'm thankful that I have some friends that are totally fine with me telling some stories about things we've all been through together\") and on \"Mystery Man,\" Delaware writes about \"the feeling of appreciation for someone coming into your life, someone like yourself.\" On \"Wasted Mind,\" one of the most personal songs on the album, Osborne, and Delaware reflect on the journey they've been through together.\n\n\"We wrote that [song] about finally having a voice that was being heard, and about trying and failing and then finally getting some ears to listen to you,\" he says. \"It's about the ups and downs of that, and how you get to travel, and you're just kind of in and out of people's lives, and it's hard but beautiful, and also how you start to come out of the haze of partying and start thinking about your life's value.\"\n\nIn many ways, \"Wasted Mind\" is & I'm Fine Today in miniature, as the album circles around the theme of punching through life's difficulties and learning to be comfortable with the person you've grown into. \"I feel like I am better. We put the first record out, and we worked hard, and it just feels like a good place to be,\" he says, noting that while the first record focused on his own struggles, & I'm Fine Today is more concerned with looking at the world beyond the struggles in your head.\n\n\"I've learned to appreciate the fact that I just get to be here. It's all perspective,\" he says. \"This album is about coming to terms with yourself and feeling okay with your place in the universe.\"\nSometimes you have to turn off your brain and let your body sing. That's what Esmé Patterson did on her third full-length, We Were Wild, set for release on Grand Jury Music on June 10th, 2016. \"At its core, rock 'n' roll is where madness and order collide. Where our sexual, raw, animal nature meets our heart and mind. On this album I explored deeper, more far out sonic spaces. I hunted the vibe through vast wilderness,\" says the Portland-based songwriter.\n\nHer decadal musical career sprang from Colorado's mountains when she co-founded Denver's beloved indie-folk ensemble Paper Bird. After four acclaimed albums and perpetual touring, Patterson set a new course. In 2012, she wove local talents, including Nathaniel Rateliff, into her first powerful, ethereal solo release All Princes, I. Her 2014 release, Woman to Woman, rounded out previously one-dimensional females from popular songs to the praise of The New York Times, The Guardian and others. \"Dearly Departed,\" her hit collaboration with Shakey Graves led to millions of streams, sold out shows nationwide, as well as performances on Conan and The Late Show With David Letterman.\n\nAcross We Were Wild, her delicate voice, wry humor, poignant storytelling, and impassioned delivery entwine with fuzzed-out guitars, deep-in-pocket percussion, hints of roots-y country, and a swirling psychedelic hum.\n\n\"I needed to paint using more colors,\" she goes on. \"On my past records everything was hyper realistic. I didn't overdub much or fix mistakes. Woman To Woman was basically recorded in a day, and everything was played live. In contrast, the pre-production for We Were Wild spanned over almost a year. Lyrically and musically, I went a little bit more fantasy. Groovy fantasy.\"\n\nThe opener \"Feel Right\" gallops along on a wiry riff as her voice carries an irresistible refrain. \"The song is about the dissonance between the body and the mind,\" she explains. \"You can't understand one extreme without the other. Light can't exist without dark. Until you see contrasted with the other, the two are indistinguishable. They're both necessary.\"\n\nElsewhere on the album, \"Wantin' Ain't Gettin'\" showcases the expanse of her dynamic voice. \"No River\" flows on a silky beat that gives way to Esmé's soulful delivery, while \"Find It\" offers up sharp introspection over a delightful groove.\n\n\"These songs reflect my life and where I am,\" she admits. \"They also negotiate where I want to be. In the process of writing and recording We Were Wild I now see that I was subconsciously trying to give myself permission to want more, to move forward into the unknown and seek what my spirit needs.\"\n\nUltimately, Esmé progresses by embracing exactly who she is.\n\n\"I'm always transforming, renewing, living, and growing.\" she leaves off. \"I love the way music can be a companion in life and a tool for transformation. I hope this record can act as a friend for everyone on their respective journeys. A lot of these songs were lessons my heart was giving my mind. I want to share them because maybe they can help others the way they helped me.\"\n\n \n","img":""},{"venue":"The Visulite","event":"HAMILTON LEITHAUSER & COURTNEY MARIE ANDREWS","date":"10 19 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2557","hrefRef":"","desc":"I Had A Dream That You Were Mine is an album of songs Hamilton Leithauser and Rostam wrote and recorded together between July 2014 and February 2016. In the spirit of collaborative albums, not unlike those of David Byrne and Brian Eno, each musician’s individuality remains in tact, while in fact, on this record, both Hamilton’s identity as a singer and Rostam’s as a producer seem to reach new heights.   \n\n“This was a record I’d been wanting to make for at least a decade” Rostam says, “As a fan of Hamilton’s voice in the Walkmen I’d been wanting to capture it in ways it hadn’t been captured before—to make songs with him that placed the crooner right beside the howler, the screamer beside the whisperer—to try to leave no stone unturned in terms of how we should approach the delivery of a song. And also to try to push his voice outside of any musical context it had lived in before.”  \n\nSays Leithauser, “Rostam’s one-man-band process is so fundamentally different from the way I’ve always written songs, and it’s very impressive. We had no idea what kind of music we were going to make—we actually didn't know we were working on an album at first—but unexpected things kept falling into place. We were writing and recording everything simultaneously—it was flat-out inspiring just to be there.”\n\nMany of these songs seem to take place in a memory of New York’s past, or wading through the waist high waters in a half-submerged New York of the future. Yet what unites them is that they tell stories—I Had A Dream That You Were Mine is an album, a collection of songs yes, but also a collection of narratives. The Bride’s Dad faithfully recounts an unexpected (an probably uninvited) guest at a friend’s recent wedding; You Ain’t That Young Kid follows the wistful narrator through a night of lost love and transformed resolve.\n\nFrom the doo-wop of When the Truth is… to the country pedal steel of The Morning Stars; from the piano and organ alchemy of the Band in A 1000 Times, to the Leonard Cohen-esque Spanish triplets of In a Black Out; the album harnesses the exploding musical styles of midcentury America—which, when melded with the warbled 1980’s analogue synthesizers of You Ain’t That Young Kid, the ultramodern sub bass of Sick as a Dog, the intimate falsetto of 1959, and the raucous bar-room chorus of Rough Going—sparks an entirely unexpected and innovative style.\n\nThe album, which dropped in September, debuted at #1 on Billboard’s Heatseeker’s Chart, #1 New Artist Album, Top 10 Alternative and #151 on the Billboard 200. The duo’s song “In A Black Out” is currently sound tracking the new Apple iPhone 7 commercial (WATCH HERE).  The band was also recently featured on The Late Show with Stephen Colbert performing their song “A 1000 Times” (WATCH HERE).\n\nThe duo’s song “In A Black Out” currently soundtracks the Apple iPhone 7 commercial (WATCH HERE) and has over 4 million views to date.  Hamilton Leithauser + Rostam also partnered with Pitchfork for a black and white session performance of their song “1959”.  Shot in Brooklyn at Be Electric Studios, the video features Hamilton and Rostam accompanied by Kelly Zutrau (Wet) as well as a string quartet (WATCH HERE).\n\nHamilton Leithauser is currently on a world tour in support of the Hamilton Leithauser + Rostam album I Had a Dream That You Were Mine. He’s performing the music with Stephen Patterson (Drums), and Gregory Roberts (Bass) with Rostam to join in Washington, D.C. and NYC.  \nAt just 16 years old, Courtney Marie Andrews left home in Arizona for her first tour. She traveled up and down the West Coast, busking and playing any bars or cafés that would have her. Soon after, she took a Greyhound bus four nights straight from Phoenix to New York to do the same on the East Coast. For a decade or so since, Courtney’s been a session and backup singer and guitarist for nearly 40 artists, from Jimmy Eat World to Damien Jurado. She never stopped writing her own material, though. Picking up admirers like Jurado and Ryan Adams along the way, she has quietly earned a reputation as a songwriter’s songwriter.\n\nWith plans to settle down for a bit and focus on her own songs, Courtney moved to the Northwest in 2011 to record her last full-length record On My Page. However, the record had hardly been released before she was on the road again performing other artists’ songs, eventually leading her overseas to play guitar and sing with Belgian star Milow. At the tour’s end, though, the other session players joined her to record her 2014 EP Leuven Letters in one take.\n\nIt was during this time that Courtney also wrote many of the songs on Honest Life. She found herself realizing the impact of growing up on the road and this constant reconciling between her and other’s art and identity. Courtney will take it from there:\n\nWhile in Belgium for four months, I was going through a major heartbreak. I started growing homesick for America and the comfort of family and friends, and life in the states. That's where I wrote the first songs for Honest Life. It was a giant hurdle in my life. My first true growing pains as a woman. That's why in a sense, I feel this record is a coming of age album. A common thread that runs through the songs, is a great desire to fit somewhere, when nowhere fits. And wanting to get back home to the people I know and love. Once I got back to the states, I started to bartend at a small town tavern. I was home for awhile, and needed to post up while rehearsing with the band for the record. At the tavern, I felt I could truly empathize with the stories and lives of the people there. I wrote the other half of the songs about coming home and feeling a sense of belonging again. A lot of the stories at that tavern definitely ran parallel with my own, even though our lives were so different. I was the \"musician girl.\"  They were farmers, construction workers, plumbers, waitresses, and cashiers. But, no matter how different, I felt we were all trying to live our most honest life.\n\nCourtney produced the entire record herself at Litho Studios in Seattle with recording engineer Floyd Reitsma. Honest Life is available now on LP, CD and digitally August 19th from Mama Bird Recording Co. (USA/World) and on January 20th from Loose Music (Europe).\n","img":""},{"venue":"The Visulite","event":"GONDWANA","date":"10 17 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2603","hrefRef":"","desc":"When The Police debuted at the Festival of Vina del Mar (February 1982), in a small and combative population of northern Santiago, La Pincoya, a young Locks Labbe surprised and influenced by this action made the decision that would change the fate of his life and that of many: to found a band, that band reaches that same stage and play bass. All these wishes were fulfilled: GONDWANA founded in 1987, the first group of reggae of Chile and one of the first in South America. Over time, he also reached the biggest stage of Chilean music, performing three times at the Festival of Vina Del Mar, being the bassist and composer of many of the songs of the band.\n\nThe recruitment of other members was slow and easy, buying instruments playing slowly and where we could. The surprise came when the first Gondwana began to realize that what they did liked, and much, achieving from the start to have a growing and faithful number of followers.\n\nThen they moved to the bohemian Barrio Bellavista, where the music scene was centered. There began the expansion of prestige and call for fewer amateurs GONDWANA. They came the biggest stages, even opening a Los Pericos in an acclaimed performance at the Teatro Caupolicán in 1994. Four songs were recorded as Demo in Anachena studies of the Frugone brothers, and then came the first recording contract with BMG. The debut could not be better, multiplatinum album, with several singles in the Top 10 radio, which remained tonic for subsequent disks.\n\nAbout to turn 25 years of history, GONDWANA begins the festivities with their sixth studio album. The whole history of Gondwana has been crossed by a force of will that has managed to cross every imaginable adversity: slums, repression and darkness during the dictatorship were the initial culture broth. Lack of money and opportunities forged letters and conscious desire to leave the dark equally.\n\nOnce established as the first reggae band the way he never ceased to be rising. 10 years in the underground temple and gave them coherence. Then in 1997 came the gold and platinum albums, singles razing radios throughout Chile sized tours, highlighting three Vina del Mar Festival and National Stadium with 60,000 people vibrated in unison.\n\nThe international breakthrough came in 2000 and has been a constant source of joy absolutely unprecedented in the Chilean music scene.Continental tours have not stopped growing, hand fanaticism that knows no boundaries. Along with the remaking of the music business, GONDWANA has led an overwhelming activity on social networks, with records on YouTube, Facebook and other sites where is the Fan calls the shots and not an increasingly away from public music market.\n\nBy the end of 2011, \"Revolution\" is published a mature and powerful album that became a success.\n\nThey are currently presenting their latest album \"Reggae & Roll\" seventh studio album, eighth counting the CD + DVD recorded in Buenos Aires.\n\nThe album features collaborations Boris outstanding Bilbraut of Culture Prophetic, Celsa Mel Gowland, Daniel Sais (former keyboardist of Soda Stereo), Thomas Pearson of Los Cafres, among several others and is published simultaneously in Chile, Argentina and USA. The new songs include two covers of two major bands in the history of Argentine rock: \"The Rite\" Soda Stereo and \"Do You See\" Divided.\n","img":""},{"venue":"The Visulite","event":"ANDREW COMBS + LINDI ORTEGA & LINDI ORTEGA","date":"09 17 17","times":"7:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2616","hrefRef":"","desc":"“Ever heard of a happy song?” \n\nThat question is posed to Andrew Combs in “Rainy Day Song”, the lead track on his acclaimed 2014 album, All These Dreams, during a barstool chat with a sarcastic friend. The singer — offended but gracious — smiles and allows the moment to pass, eschewing confrontation for the sake of a gem he polishes as an afterthought for the listener: “Tab’s on me if you think I’m lying / Laughing ain’t a pleasure till you know about crying.” The moment, full of the understated charm and pulsing honesty that defines his music, is as good a metaphor as any for the songcraft of Andrew Combs.\n\nA Dallas native now living near the same Nashville airport immortalized in the opening sequence of Robert Altman’s country music odyssey, Andrew Combs is a singer, songwriter, guitarist and heir to that 1975 film’s idea of the Nashville troubadour as a kind of musical monk. Here in the twenty-first century whorl of digital narcissism, where identity can feel like a 24/7 social media soft-shoe performance, Combs makes music that does battle with the unsubtle. Like the pioneering color photographer William Eggleston, he sees the everyday and the commonplace as the surest paths to transcendence, and he understands intuitively that what is most obvious is often studded with the sacred. As a songwriter, Combs relies on meditative restraint rather than showy insistence to paint his canvases, a technique commensurate with his idea of nature as an overflowing spiritual wellspring. NPR music critic Ann Powers noted as much in a 2014 review: “His song-pictures are gorgeous, but he recognizes their impermanence as he sings.” This deeply felt sense of ecology, of the transient beauty within nature’s chaotic churn, lies at the heart of Combs’s approach to his art.\n\nAfter touring behind All These Dreams, a record that earned him international accolades and comparisons to everyone from Leonard Cohen to Mickey Newbury to Harry Nilsson, Combs has returned with a new album that puts down stakes in fresh sonic terrain. Canyons of My Mind, out in March on New West, is — as its title suggests — a landscape where the personal and the pastoral converge. Drawing inspiration from the biographies of literary figures like Charles Wright and Jim Harrison, Combs has created an album that explores the notion of “sustainability” in its many facets — artistic, economic, spiritual, environmental.\n\n“When I set out to record All These Dreams, I had a distinct vision of what I wanted the record to sound like. It was a cocktail of the Roy Orbison, Glen Campbell, Nilsson vibes that you can hear right there on the surface,” Combs says. “Canyons of My Mind is much more personal. It’s a testament to my acceptance of who I am as a man, and who I am becoming.” The record’s sonic adventurousness bears witness to that evolution, as well as to some big changes in his personal life. Between All These Dreams and Canyons, Combs married his longtime girlfriend Kristin, with whom he honeymooned for six weeks in the Minnesota wilderness. “She walks through her life exuding such open-mindedness and kindness,” Combs says. “I can’t help but watch in awe. She lets me be whoever I want to be, and that’s new to me. And quite refreshing, and freeing.”  \n\nThe quiet struggles and satisfactions of carving out an identity in a world gone wrong are palpable throughout the album. Whether questing through the labyrinth of his own spiritual yearning, (“Heart of Wonder”), recreating a rail rider’s full-body sensation of freedom beneath an azure Montana sky (“Rose Colored Blues”), imagining a near-future dystopia where the very idea of green spaces has been annihilated (“Dirty Rain”), or channeling the desire of a peeping Tom who has fallen in love with his sylvan quarry (“Hazel”), Combs refines the vulnerable vagabond persona he mastered on All These Dreams while pushing it beyond those boundaries, into a more pastoral realm aligned with artists like Nick Drake and Tim Buckley. The idea of the artist’s creative life as an ecosystem — one just as in need of cultivation and care as our own imperiled world — informs much of Canyons. For Combs, the quest to sustain his own capacity to create on a daily basis is what drives him. “I want to create for the rest of my life — writing, singing, painting,” he says. “I also want my life to include a family, a house, and kids. Seeking out other artists who’ve been able to keep the lights on without compromising their art – that keeps me inspired.” \nWhen Lindi Ortega went in search of some quiet last year, the award-winning artist was pleasantly surprised to find a voice she hadn’t heard in some time – her own. Amid sparse, atmospheric production, it’s precisely this voice – a combination of Ortega’s fatalistic perspective expressed with her evocative soprano – that grips your attention on a brand new EP, Til The Goin’ Gets Gone.\n\nA dogged resilience permeates this unadorned collection – three originals and a cover of Townes Van Zandt’s “Waiting ‘Round To Die.” The songs are the hard-won spoils of an internal war with words that struck after an extended stretch of touring, addressed in the EP’s title track about the detours and ditches that a traveling musician faces.\n\n“What A Girl’s Gotta Do,” a song that is the silver lining of an otherwise dreadful date, explores the gritty pragmatism of making ends meet. Alongside the title track, this song offers a second metaphor about artistic life that strengthens the EP’s overall sense of resolve. Ortega’s somber rendition of “Waiting ‘Round to Die,” acknowledges a personal debt – her recent discovery of the legendary songwriter’s music is what finally cured her writer’s block. The closer, “Final Bow,” came when Ortega assumed she only had one song left in her. “I thought I had to quit music but I wanted to leave gracefully,” she says. “But then I decided to get up and sing some more.” As a whole, this statement captures the essence of Ortega’s new EP – it’s about dusting off, gutting it out, stepping up for another round.\n\nOrtega recorded Til The Goin’ Gets Gone in a converted East Nashville manor, where therapy horses linger on the property. Recording with her longtime guitarist James Robertson, Ortega co-produced the set with Jay Tooke and Jason “Rowdy” Cope. The small production team and minimalist instrumentation make an intimate, immediate setting for Ortega’s stark vision of the human condition. Although classic country is an indelible part of her musical history, the EP also sets the tone for the next chapter of her career: “I'll always love Loretta, Dolly and Patsy. But I just want more space. I want more ambience.”\n\nOrtega’s guitar-playing chops and innate country music instincts put her in an elite group of artists;\nshe has earned an unusually inclusive type of success with both indie cred and mainstream country recognition. From supporting Carrie Underwood on the CMA Awards to her opening slot on Chris Stapleton’s recent Canadian arena tour, Ortega is a sought-after and unique personality in Nashville’s music community and beyond.\n\nCareer Highlights\n\n- Canadian Country Music Association – Roots Artist of the Year (2014 + 2015) - Grand Ole Opry debut (2015)\n- Critical praise from NPR, Rolling Stone, Billboard and more.\n","img":""},{"venue":"The Visulite","event":"THE RUSS LIQUID TEST & RECESS","date":"10 05 17","times":"8:00","id":"","href":"https://www.visulite.com/showDetails.cfm?showID=2609","hrefRef":"","desc":"Redefining the possibilities of modern music, The Russ Liquid Test fuses the raw vitality of classic funk and the inventive sound design of electronic production. Songwriter/producer and renowned brass specialist Russell Scott heads up the New Orleans-based band. Guitarist Andrew Block and drummer Deven Trusclair round things out, with each providing a distinct musical background deeply rooted in the New Orleans jazz scene. Their debut EP 1984 featured an eclectic array of guest collaborators such as Mr. Lif and Ivan Neville—successfully creating an auditory canvas to forge The Russ Liquid Test’s irresistibly soulful future-vintage stylings. \n\nA kinetic energy infuses each track on 1984. Giving way to a mixture of funk/jazz/electro, The Russ Liquid Test evokes a kaleidoscope of textures, senses, and moods. Featuring Ivan Neville on keyboards and the Funky Meters’ Russell Batiste Jr. on drums, the effervescent and synth-heavy title track “speaks about the current state of America from the perspective of an outsider,” as described by Scott. Lead single “Honesty,” meanwhile, finds The Russ Liquid Test slipping into a woozy psychedelia, offset by a brilliantly structured dichotomy introduced in its second-line-inspired groove. \n\nAt the heart of The Russ Liquid Test is an improv-driven musicality that began with Scott’s taking up classical piano. After spending several years playing in a jazz quintet on cruise ships and touring with psychedelic ska band Uprite Dub Orchestra, his one-of- a-kind artistry was unveiled in the genre-busting musical performance group MarchFourth Marching Band. Capable of playing the trumpet and saxophone, Scott quickly began experimenting with electronic music, eventually adopting the moniker of Russ Liquid. As his full-length debut, 2013’s Foreign Frequency showcased a forward-thinking mentality and fearless vision, anchored by an incomparable knowledge of music as a whole. “I wanted new colors to paint with,” says Scott of his foray into electronic music. “I kind of look at the electronic world as this whole other color palette, compared to the traditional sounds we’ve been working with for the past however many years.” \n\nWhile on tour with Gramatik in 2014, Scott crossed paths with Block and discovered the duo’s shared musical tastes and philosophies. A South Florida native, Block grew playing guitar in his local Pentecostal church. “I wasn’t religious, I just wanted to play at that church because the music there was amazing,” says Block. He later relocated to New Orleans, pursuing his dream of becoming a full-time musician. The guitarist’s legendary endeavors reached fellow purveyors of soul/funk/R&B, ranging from Pretty Lights to New Orleans icon Dr. John. Capable of collaborating and working as a solo artist without missing a beat, Block released his 2014 debut You Can Only Go Up From Here on Gramatik’s independent label Lowtemp.\n\n In the making of 1984, The Russ Liquid Test compounded their potent chemistry by bringing in a lineup of equally impassioned musicians. “Coming from a background of playing in bands and then getting into electronic music, I’d really missed having that interaction with other musicians,” says Scott. “The most rewarding thing for me is being able to bounce ideas off other people, so that the music ends up having more than just one person’s vibe to it. Ultimately it lets you give the audience even more to connect with.” \n\nThe studio workhorses have already begun working on a sophomore EP. The Russ Liquid Test also presents a joyful sense of synergy in their high-powered live shows, with recent appearances including Shambhala Music Festival, Lightning in a Bottle, Summer Camp, and Sonic Bloom, among others. No matter the setting, a clear multidimensionality can always be heard in The Russ Liquid Test’s projects. “We want to make people feel good but also give them something to reflect with,” says Scott. “It’s not about just making party music or music that’s more introspective—it’s for the full gamut of human expression, and we want it to be just as dynamic as life itself.”\nRECESS blends their jazz backbone with swanky bass lines, bouncing old school beats, smooth guitar, and biting spacey synthesizer leads to take the listener on a methodical musical journey intended to touch on as many genres as possible. Since forming in 2014, Recess has spent countless hours in the studio perfecting their sound as well as performing live shows centered around a playground of improvisation and their intrinsic love for music. The duo, comprised of Fort Smith, AR based guitarist/producer Drew Birch and keyboardist Ian Gilley, have conjured a genre-bending sound, which channels everything from EDM to jazz and hip-hop. Recess’s debut album \"The Brothel Gospel\" entwines intricate melodies, raw funk, and powerful grooves that create a unique listening experience and make for an eccentric live performance.\n \n","img":""}]